[{"Id":"getting-comfortable-being-uncomfortable","Title":"Getting comfortable being uncomfortable","Abstract":"How do we stay focused day to day, working towards a big future goal? How do we come to meet the challenges? How do we handle the unknown, the uncomfortable, the crisis?<br><br>Keavy McMinn shares some of her experiences dealing with these issues in her life.","Level":"Basic","TimeSlotId":"09.00","Speaker":"Keavy McMinn","SpeakerId":"keavy-mcminn","Room":"Marvin"},{"Id":"continuous-discovery-the-power-of-pure-agile","Title":"Continuous Discovery, The Power of Pure Agile","Abstract":"Continuous Discovery: The future is for us to discover, one moment at a time.<br><br>The strength of Agile lies in the simplicity and clarity of the Values and Principles expressed in the  Agile Manifesto.  I'll share with you how I apply and use \"Pure Agile\" in my daily work, and encourage Continuous Learning, Continuous Growth, and Continuous Discovery in the teams and companies I work with.  Let's explore together and discover the path to future we want to create.<br> <br> <br><br><br><br>","Level":"Intermediate","TimeSlotId":"10.20","Speaker":"Woody Zuill","SpeakerId":"woody-zuill","Room":"HAL9000"},{"Id":"using-scriptcs-as-part-of-your-api-development-workflow","Title":"Using scriptcs as part of your API development workflow","Abstract":"This talk will combine two things that I am extremely passionate about, API development and scriptcs. I am sure you’ve heard of APIs, but what is scriptcs? It’s a lightweight way to develop C# which offers a less-montonous C# experience and fully supports nuget. In this talk I am going to show you you can use scriptcs to offer a programmatic fiddleresque experience for interacting with APIs as your developing, including and most importantly working with Hypermedia.","Level":"Advanced","TimeSlotId":"10.20","Speaker":"Glenn Block","SpeakerId":"glenn-block","Room":"KITT"},{"Id":"ingredients-of-successful-java-ee-7-applications","Title":"Ingredients of Successful Java EE 7 Applications","Abstract":"Depending how to tackle it, Java EE 7 can be hell or heaven. From a scary enterprise monster to a nimble startup killer app. <br>What makes Java EE applications succeed? In this session I would like to introduce you to the “Best of Breed” Java EE 7 and Java 8 APIs, approaches<br>and techniques of “successful” Java EE applications. “Successful” means: the application works and the developers enjoy the building and the maintenance process.","Level":"Intermediate","TimeSlotId":"10.20","Speaker":"Adam Bien","SpeakerId":"adam-bien","Room":"Marvin"},{"Id":"continuous-delivery-with-openshift","Title":"Continuous Delivery with OpenShift","Abstract":"Building software is hard. Building the supporting environments and processes are even harder. OpenShift PaaS hides much of that complexity and provides a quick way towards delivering software quickly and continuously so that you can focus on building software rather than all the boring stuff. This talk will introduce OpenShift and demonstrate how to do Continuous Delivery though building a delivery pipeline on top of OpenShift. We will be pushing code to live servers within minutes.","Level":"Intermediate","TimeSlotId":"10.20","Speaker":"Siamak Sadeghianfar","SpeakerId":"siamak-sadeghianfar","Room":"R2D2"},{"Id":"dont-take-it-for-granted-how-would-we-code-if-programming-was-worse-in-various-ways","Title":"Don't Take It For Granted: How would we code if programming was worse in various ways?","Abstract":"In order to better understand the choices and tradeoffs we make, it can be interesting to look at how various constraints might cause us program in other ways. We'll walk through how a small program would have to be implemented differently in a bunch of darker, angrier worlds - for example, what if we had no variables? If there was no stack? If there were no pointers? What can we learn by exploring a set of dangerous and tricksy alternate realities?","Level":"Intermediate","TimeSlotId":"10.20","Speaker":"Danielle Sucher","SpeakerId":"danielle-sucher","Room":"Roomba"},{"Id":"beyond-responsive-design--ui-for-the-modern-web-application","Title":"Beyond responsive design - UI for the modern web application","Abstract":"Responsive design is great for websites, but it's use is limited when it comes to web applications. It's much better to design your UI from the ground up using  to work equally well on phones, tablets and browsers and in this talk, I'll show you how.","Level":"Intermediate","TimeSlotId":"10.20","Speaker":"Peter Smith","SpeakerId":"peter-smith","Room":"T-800"},{"Id":"refactoring-to-functional","Title":"Refactoring to Functional","Abstract":"How many times have been told how functional programming is so much better than imperative, and then being presented with a functional approach to calculating a fibonacci sequence, leaving you wondering how that can be even remotely useful when working in real world applications? Yep, we’ve all been there. It seems that every time someone wants to explain functional programming to us, it’s around how to solve some mathematical problem. But how does that provide us value? How do we deal with things like grouping functionality, loose coupling and consequently dependency injection?","Level":"Basic","TimeSlotId":"10.20","Speaker":"Hadi Hariri","SpeakerId":"hadi-hariri","Room":"Wall-E"},{"Id":"real-world-lessons-on-the-anti-patterns-of-node-js-applications","Title":"Real World Lessons on the Anti-Patterns of Node.js Applications","Abstract":"The rapid adoption of Node.js has resulted in a significant amount of patterns and approaches from the community, some which work and others that have completely failed. This session will highlight the anti-patterns of Node.js, such as Callback Hell, how to write better applications and the lessons Ben has learned while building Node.js applications.","Level":"Advanced","TimeSlotId":"11.20","Speaker":"Ben Hall","SpeakerId":"ben-hall","Room":"HAL9000"},{"Id":"generation-64--the-shaping-of-a-successful-it-and-gaming-nation","Title":"Generation 64 - the Shaping of a Successful IT and Gaming Nation","Abstract":"Presentation by the author of \"Generation 64: Commodore 64 Made Me Who I Am\" - a coffee table book about the young Swedes who grew up with the Commodore 64 and laid the foundation of a successful IT and Gaming nation.","Level":"Basic","TimeSlotId":"11.20","Speaker":"Jimmy Wilhelmsson","SpeakerId":"jimmy-wilhelmsson","Room":"Johnny Five"},{"Id":"build-a-better-bootstrap","Title":"Build a Better Bootstrap","Abstract":"Need the power of Bootstrap without the bulk? Come see how to build your own CSS framework! We'll start with a solid CSS foundation, add on some component scaffolding for your most common use cases, and top it off by discussing how to share your new web framework with your team. Grab your hard hat and come learn how to build a better Bootstrap!","Level":"Intermediate","TimeSlotId":"11.20","Speaker":"Tim G. Thomas","SpeakerId":"tim-g-thomas","Room":"KITT"},{"Id":"angularjs-2-0","Title":"AngularJS 2.0","Abstract":"Have burning questions about AngularJS 2.0? Want to know what we're up to, what's planned or get a status update? This is the place. In this talk we'll start by looking at the fundamental motivators and design goals of AngularJS 2.0. Next, we'll talk about specific features such as Dependency Injection, Templating, Binding and Routing. You'll gain a solid understanding of what AngularJS 2.0 comprises and have a feel for what the next generation of JS client development will be like.","Level":"Intermediate","TimeSlotId":"11.20","Speaker":"Rob Eisenberg","SpeakerId":"rob-eisenberg","Room":"Marvin"},{"Id":"a-sign-of-the-times-dates-and-times-in-java-8","Title":"A sign of the Times: Dates and Times in Java 8","Abstract":"A long standing thorn in the side of Java developers is the set of problems associated<br>with java.util.Date and Calendar. Inconsistencies such as whether numbers start at 0, 1<br>or 1900. Poor design decisions such as inherently thread unsafe formatters.<br><br>Thankfully Java 8 introduces a new API for date and time values based on domain modelling, thread safety and fluency. If you want to learn about how to use the API and how to integrate it into your existing projects then this is the talk for you!","Level":"Basic","TimeSlotId":"11.20","Speaker":"Richard Warburton","SpeakerId":"richard-warburton","Room":"R2D2"},{"Id":"advanced-android-textview","Title":"Advanced Android TextView","Abstract":"The humble TextView was there when you wrote your Hello World app. You know how to change its text size and color, perhaps its font too. But do you know that you can also put multiple font sizes in the same TextView? Highlight individual words? Embed inline images? Come and learn how to unleash the power of TextView with Span, Paint, and much more.  ","Level":"Advanced","TimeSlotId":"11.20","Speaker":"Chiu-Ki Chan","SpeakerId":"chiu-ki-chan","Room":"Roomba"},{"Id":"clojurescript-for-the-web","Title":"ClojureScript for the web","Abstract":"","Level":"Intermediate","TimeSlotId":"11.20","Speaker":"Michiel Borkent","SpeakerId":"michiel-borkent","Room":"T-800"},{"Id":"retrospectives-are-boring-and-useless--or-are-they","Title":"Retrospectives are boring and useless – or are they?","Abstract":"Often I hear people say that retrospectives are useless, boring & take too long.<br> <br>This means that its not done right; do it right and get some value from it :)<br> <br>The difference between a good & a bad retrospective?<br>The structure and the facilitation.<br> <br>Retrospectives are the strongest tools in the agile toolbox and an important part of continuously inspect & adapt.<br> <br>I will talk about the structure of a good retrospective and important principles to follow to get a good retrospective every time.","Level":"Intermediate","TimeSlotId":"11.20","Speaker":"Gitte Klitgaard","SpeakerId":"gitte-klitgaard","Room":"Wall-E"},{"Id":"evolving-the-nuget-org-architecture","Title":"Evolving the NuGet.org Architecture","Abstract":"After 3 years of usage growth though, NuGet.org needs to be more reliable, scalable, and maintainable, with the goal of 99.999% availability of package downloads.  To achieve this, we’re evolving the architecture away from a monolithic website/service into several independent services, connected purely through HTTP.  Come learn how we’re starting to use Command Query Responsibility Segregation (CQRS), JSON-LD/Linked Data, and event sourcing.","Level":"Basic","TimeSlotId":"12.20","Speaker":"Jeff Handley","SpeakerId":"jeff-handley","Room":"HAL9000"},{"Id":"oauth-2-0-for-javascript-applications","Title":"OAuth 2.0 for JavaScript-Applications","Abstract":"OAuth 2.0 brings several variations, called flows. But which of them can be used for JavaScript-Applications and what are the consequences in view of security? This session gives an answer to this question. It shows which flows are suitable in which situations, how to implement them with JavaScript as well as the pros and cons of the existing options.","Level":"Intermediate","TimeSlotId":"12.20","Speaker":"Manfred Steyer","SpeakerId":"manfred-steyer","Room":"KITT"},{"Id":"functional-thinking","Title":"Functional Thinking","Abstract":"Learning the syntax of a new language is easy, but learning to think under a different paradigm is hard. This session helps you transition from a Java writing imperative programmer to a functional programmer, using Java, Clojure and Scala for examples. This session takes common topics from imperative languages and looks at alternative ways of solving those problems in functional languages.","Level":"Intermediate","TimeSlotId":"12.20","Speaker":"Neal Ford","SpeakerId":"neal-ford","Room":"Marvin"},{"Id":"witness-tdd-with-real-live-refactoring-maniacs","Title":"Witness TDD with real, live REFACTORING MANIACS","Abstract":"Classic old-school TDD recommends refactoring as part of every cycle -- red, green, refactor. In fact, it recommends refactoring mercilessly. Relentlessly. To succeed at classic TDD, you have to be some kind of refactoring maniac!<br><br>Refactoring maniacs are an endangered species, but you're in luck: we have one of the last remaining pairs. See for yourself how refactoring fits into the TDD cycle, and when practiced mercilessly, allows beautiful, simple code to emerge.","Level":"Advanced","TimeSlotId":"12.20","Speaker":"Angela Harms","SpeakerId":"angela-harms","Room":"R2D2"},{"Id":"julia--a-fast-dynamic-language-for-technical-computing","Title":"Julia – a fast dynamic language for technical computing","Abstract":"Julia is a high-level, high-performance dynamic language for scientific computing. It has been gaining traction as a faster alternative to Matlab, R and NumPy and as a more productive alternative to C, C++ and Fortran. Julia is particularly relevant when both expressiveness and performance are paramount – in areas like machine learning, “big statistics”, linear algebra, bioinformatics, and image analysis.","Level":"Intermediate","TimeSlotId":"12.20","Speaker":"Stefan Karpinski","SpeakerId":"stefan-karpinski","Room":"Roomba"},{"Id":"automation-abstractions--page-objects-and-beyond","Title":"Automation Abstractions - Page Objects and Beyond","Abstract":"Writing automation code requires good design and organisation in addition to 'test' code. Abstraction layers help make code readable, and maintainable. But what options are open to you? DSLs, DOM Level Abstractions? Page Objects? What about Gherkin? In this session you will see examples and learn the thought processes that led to the decisions.","Level":"Intermediate","TimeSlotId":"12.20","Speaker":"Alan Richardson","SpeakerId":"alan-richardson","Room":"T-800"},{"Id":"javafx-on-your-wall-in-your-car-or-on-a-plane","Title":"JavaFX on your wall, in your car, or on a plane!","Abstract":"Fast and sexy, JavaFX is the perfect toolkit for creating cool UIs for embedded applications such as on wall displays, in car dashboards, or in flight entertainment systems. For embedded development, performance and size are key, and with JavaSE Embedded 8 it is possible to deploy a smaller, faster subset of Java to embedded systems.","Level":"Intermediate","TimeSlotId":"12.20","Speaker":"Richard Bair","SpeakerId":"richard-bair","Room":"Wall-E"},{"Id":"nosql-an-introduction-to-polyglot-persistence","Title":"NoSQL: An introduction to polyglot persistence","Abstract":"The world of data is changing and becoming yet more important as data has become a significant competitive advantage. We are collecting increasing amounts of data, but wanting to process it in decreasing time. This demands new techniques in data storage, enabling the raise of NoSQL technologies.","Level":"Basic","TimeSlotId":"13.20","Speaker":"Pramod Sadalage","SpeakerId":"pramod-sadalage","Room":"HAL9000"},{"Id":"orms--youre-doing-it-wrong","Title":"ORMs - you're doing it wrong","Abstract":"ORMs, the necessary evil, the so-called \"Vietnam of computer science\", the despised of DBAs everywhere. Much of the ORM hate comes from just bad usage of ORMs. In this session, we'll learn ORM anti-patterns and see what successful ORM usage looks like.","Level":"Intermediate","TimeSlotId":"13.20","Speaker":"Jimmy Bogard","SpeakerId":"jimmy-bogard","Room":"KITT"},{"Id":"life-is-terrible-lets-talk-about-the-web","Title":"Life is Terrible: Let's Talk About the Web","Abstract":"It’s been known for years that JavaScript is a dangerous, unholy language that is banned in 27 countries and most fine restaurants. In this talk, I will use deeply personal and completely biased examples to describe why I hate JavaScript. I will then provide additional reasons why the entire web stack is a thing that should not be tolerated by moral human beings. I will also describe some of my futile research efforts to make web browsers moderately less the worse thing ever.","Level":"Intermediate","TimeSlotId":"13.20","Speaker":"James Mickens","SpeakerId":"james-mickens","Room":"Marvin"},{"Id":"mobile-apps-that-work-even-when-your-network-doesnt","Title":"Mobile apps that work, even when your network doesn't","Abstract":"A deep dive on the new cross-platform offline data sync feature in Azure Mobile Services and how to data sync in existing apps.","Level":"Intermediate","TimeSlotId":"13.20","Speaker":"Yavor Georgiev","SpeakerId":"yavor-georgiev","Room":"R2D2"},{"Id":"classical-typography-and-digital-interfaces","Title":"Classical Typography and Digital Interfaces","Abstract":"What does 500 to 50 year old teaching on typography have to do with making a good digital interface today? This session will look at Gutenberg, Garamond, Bodoni, on up to early 20th century typographers such as Tschichold, Frutiger and the relevance of their work in designing better interfaces and digital experiences now in 2014.","Level":"Basic","TimeSlotId":"13.20","Speaker":"Sean Wolcott","SpeakerId":"sean-wolcott","Room":"Roomba"},{"Id":"testing-your-mobile-app-for-real-world-network-conditions","Title":"Testing Your Mobile App for Real-World Network Conditions","Abstract":"Mobile is no longer an option – more people are browsing, using mobile devices than desktops. Now that you have a mobile presence, how does it behave in extreme network conditions? (some of your customers will be on 2G, or at a conference)  Learn techniques and tools to make sure your mobile experience is awesome at any speed.","Level":"Intermediate","TimeSlotId":"13.20","Speaker":"Doug Sillars","SpeakerId":"doug-sillars","Room":"T-800"},{"Id":"your-agile-challenges","Title":"Your Agile challenges","Abstract":"Agile development has become increasingly popular in practice but many challenges still exist. This talk will be based on an industry-academic partnership (Agile Research Network (ARN)). ARN aims to identify and investigate agile challenges and disseminate the findings. I will present an overview of the many different challenges and discuss our experiences. During the conference we will be running an “agile challenges wall” where you will be able to post YOUR agile challenges.","Level":"Intermediate","TimeSlotId":"13.20","Speaker":"Helen Sharp","SpeakerId":"helen-sharp","Room":"Wall-E"},{"Id":"iot-magic-show","Title":"IoT Magic Show","Abstract":"What do magicians and programmers have in common?  They are good at juggling, have very nimble fingertips, often make things vanish, and have lovely assistants!  Ok, so maybe not all of those describe your average hacker (unless your pair programmer partner happens to be Penny), but we are going to try to put on the most spectacular magic show that has ever been seen on the stage at a tech conference! [geeks only]","Level":"Intermediate","TimeSlotId":"14.20","Speaker":"Stephen Chin","SpeakerId":"stephen-chin","Room":"HAL9000"},{"Id":"how-sons-of-anarchy-can-teach-your-organisation-to-be-more-effective","Title":"How Sons of Anarchy can teach your organisation to be more effective","Abstract":"The programmer anarchy movement has showed that team autonomy is one of the key factor to create an effective organisation. But how do create such an environment? In the series Sons of Anarchy we get to know southern California chapter of the Sons of Anarchy and how they operate in a world of chaos. Many of the concepts in the series like chapter, table, prospect and the nomads can be used to give teams more autonomy help your organisation to become more effective.  ","Level":"Basic","TimeSlotId":"14.20","Speaker":"Emil Cardell","SpeakerId":"emil-cardell","Room":"Johnny Five"},{"Id":"bridging-the-gap-of-the-module-wars","Title":"Bridging the Gap of the Module Wars","Abstract":"RequireJS is for “client side” developers and browserify is for “node developers.” Bower is for “client side” developers and npm is for “node developers.” Or so the popular tweets and blog posts would make you think. I’d like to tear down these walls with you and show you how the two sides aren’t that different after all.  <br><br>Practically, I’ll show you not only how to use bower dependencies in your browserify project, and npm dependencies in your RequireJS project. ","Level":"Advanced","TimeSlotId":"14.20","Speaker":"John K. Paul","SpeakerId":"john-k-paul","Room":"KITT"},{"Id":"-noestimates-unplugged--a-conversation-about-agile-as-if-you-meant-it","Title":"#NoEstimates Unplugged - A conversation about Agile as-if-you-meant-it","Abstract":"Woody Zuill and Vasco Duarte share their experiences with #NoEstimates and describe how #NoEstimates is just one small part of getting back to Agile-as-if-you-meant-it<br>We tackle: #NoEstimates implications on teams, stakeholders, product management and even business. But most of all we talk about the implications to us as human beings.","Level":"Intermediate","TimeSlotId":"14.20","Speaker":"Vasco Duarte","SpeakerId":"vasco-duarte","Room":"Marvin"},{"Id":"continuous-delivery-in-a-net-world","Title":"Continuous Delivery in a .NET world","Abstract":"Continuous Delivery is not new. But Continuous Delivery with .NET is a shockingly sparse topic with few case studies to compare against [steal from]. This session outlines the .NET delivery pipeline I helped build, troubleshoot and maintain. Are you developing in .NET? There will be something in here for you.","Level":"Intermediate","TimeSlotId":"14.20","Speaker":"Adam Goucher","SpeakerId":"adam-goucher","Room":"R2D2"},{"Id":"ux-behind-the-steering-wheel","Title":"UX behind the steering wheel","Abstract":"The next generation of cars are being designed with digital systems integrated to the in-car experience. This presentation will introduce key aspects of designing UX for cars and will provide examples from Volvo Cars’ new SPA-platform. ","Level":"Basic","TimeSlotId":"14.20","Speaker":"Steffen Kramer Valsted","SpeakerId":"steffen-kramer-valsted","Room":"T-800"},{"Id":"vagrant--the-essence-of-devops-in-a-tool","Title":"Vagrant - the essence of DevOps in a tool","Abstract":"Traditionally, developers would write their applications without any thought as to what system it was going to be deployed on in production. It was also very difficult for them to understand how their software would react when releasing it into a production environment as they didn't really understand how that environment was configured. What if there was a way that developers could create the scripts needed to install dependencies and get the software running as it is developed? Vagrant does exactly this, it is a tool to create and configure lightweight, reproducible, and portable development environments. In this session, I will show you how to create a development work flow that will allow developers to use Vagrant to create a real continuous delivery pipeline. This means understanding the environment needs as well as what is needed to run the software. I will also show how we, at OpenTable, integrate Vagrant into our pipeline to allow us to create a good acceptance testing environment against known data sets rather than having brittle test.","Level":"Intermediate","TimeSlotId":"14.20","Speaker":"Paul Stack","SpeakerId":"paul-stack","Room":"Wall-E"},{"Id":"building-web-apps-for-the-cloud","Title":"Building Web Apps for the Cloud","Abstract":"A look at the issues and opportunities presented when designing, architecting and building web applications for public cloud platforms such as Microsoft Azure or Amazon Web Services.","Level":"Intermediate","TimeSlotId":"15.40","Speaker":"Mark Rendle","SpeakerId":"mark-rendle","Room":"HAL9000"},{"Id":"stress-and-insomnia--the-increasing-public-health-diseases","Title":"Stress and insomnia - the increasing Public Health Diseases","Abstract":"Today 25 percent suffer from sleeping problems. What are the symptoms and consequences. And how can you deal better with stress and insomnia. ","Level":"Basic","TimeSlotId":"15.40","Speaker":"Helena Kubicek Boye","SpeakerId":"helena-kubicek-boye","Room":"Johnny Five"},{"Id":"es6-getting-ready-for-javascript-vnext","Title":"ES6:  Getting ready for JavaScript vNext","Abstract":"The latest version of JavaScript - ES6 - has arrived.   There's a lot to be excited about - class syntax, generators, arrow functions, modules, promises, and enough syntactic sugar to keep you up past bedtime.  The latest drops of Chrome and node.js make it easier than ever to start building ES6 applications both on the client and the server.  This talk is going to go in depth on the most important features of ES6, and show you how to use many of them today in an ES5 kind of world.  ","Level":"Intermediate","TimeSlotId":"15.40","Speaker":"Justin Beckwith","SpeakerId":"justin-beckwith","Room":"KITT"},{"Id":"bridging-the-gap-between-developers-and-operations-creating-multi-tier-application-blueprints-for-easy-consumption","Title":"Bridging the gap between developers and operations creating multi tier application blueprints for easy consumption","Abstract":"The session will be on how developers and application architects can begin the journey to DevOps by automating the end-to-end delivery and management of infrastructure and accelerate the application deployment and releases.<br>Through a library of VMware and partner blueprints middleware and integrated multi-tier applications can be rapidly deployed either in the public or private cloud.","Level":"Basic","TimeSlotId":"15.40","Speaker":"Magnus Bergman","SpeakerId":"magnus-bergman","Room":"Marvin"},{"Id":"tester-love-developer","Title":"Tester Love Developer","Abstract":"Want tighter collaboration and better working rapport between testers and developers? Enough of the antagonistic images and comments of the tester and developer relationship, sure testers find code issues and point out the flaws of developer’s work but testers are also “helpmates” to developers. Karen identifies seven specific areas to build collaboration during development and testing of a product. She also explains how having an empathic approach can improve a tester/developer relationship.","Level":"Intermediate","TimeSlotId":"15.40","Speaker":"Karen Johnson","SpeakerId":"karen-johnson","Room":"R2D2"},{"Id":"the-quantum-physics-of-java","Title":"The Quantum Physics of Java","Abstract":"If we were able to take a microscope and observe how our programs work on the lowest level, we would be surprised and shocked. Close to the wire, programs behave very differently from what we expect.<br><br>In this session we will go through code examples that show the counter-intuitive behavior of Java on the lowest level. Topics covered will be the cache hierarchy, false sharing, pipelining, branch prediction, and out-of-order execution. ","Level":"Intermediate","TimeSlotId":"15.40","Speaker":"Michael Heinrichs","SpeakerId":"michael-heinrichs","Room":"Roomba"},{"Id":"datomic-for-the-96-percent","Title":"Datomic for the 96 Percent","Abstract":"Traditional SQL databases have great power, via ACID transactions and declarative query language (SQL). But these databases encounter problems on the web: namely they have rigid information models, update-in-place storage (no history!) and they struggle under high write volumes.<br><br>While the NoSQL movement has tried solving the third problem, the problem of the 4%, Datomic solves the first two problems with a flexible information and deployment models suited for the cloud.<br><br>Datomic is for the 96%.","Level":"Intermediate","TimeSlotId":"15.40","Speaker":"Ryan Neufeld","SpeakerId":"ryan-neufeld","Room":"T-800"},{"Id":"the-three-kinds-of-code-rs-","Title":"The Three Kinds of Code(rs)","Abstract":"See the hardcore production developer. See her optimize. See her unit test. See her scoff at the design implementation developer, who knows nothing of optimization, who, however, can turn a thumb drive full of drawings into an application before lunch. Brunch even. See them both scoff at the prototype developer. See the prototype developer invent five new interaction models between brunch and lunch, vetting them and down-selecting to the best of them before tea time. Let's see them all.","Level":"Basic","TimeSlotId":"15.40","Speaker":"Thomas Q Brady","SpeakerId":"thomas-q-brady","Room":"Wall-E"},{"Id":"building-the-halo-4-services-with-orleans","Title":"Building the Halo 4 Services with Orleans","Abstract":"Halo 4 is a first-person shooter on the Xbox 360, with fast-paced, competitive gameplay.  To complement the code on disc a set of services were developed and deployed in Azure.  These services needed to support high demand, with low latency, and high availability.  In this session will discuss some of the challenges faced while building this services, and how Orleans, Distributed Virtual Actors for Programmability and Scalability, was utilized to solve these problems.  ","Level":"Intermediate","TimeSlotId":"16.40","Speaker":"Caitie McCaffrey","SpeakerId":"caitie-mccaffrey","Room":"HAL9000"},{"Id":"democratize-data-by-igniting-a-crowd-powered-global-movement-","Title":"Democratize data by igniting a crowd powered global movement.","Abstract":"DEMOCRATISING DATA<br><br>How do we democratize data by igniting a crowd powered global movement with the aim of building a collaborative social fabric-enabling layer across diverse cultures and markets? To do this during times of unprecedented social, economic, environmental, demographic, and political uncertainty will require us to take a bold approach and step outside of the way we normally do things. ","Level":"Basic","TimeSlotId":"16.40","Speaker":"Steve Jennings","SpeakerId":"steve-jennings","Room":"Johnny Five"},{"Id":"security-for-developers","Title":"Security for developers","Abstract":"What makes SSL secure, and when is it not? How do we handle sensitive data in our apps/systems? Is encrypted data always protected (and protected against what)? Can we trust the code just because we wrote and/or compiled it ourselves? How do we protect our application logic?<br><br>These and similar questions are discussed (with demos) in this session. Whether you work on mobile/desktop apps or web/backend systems - if you want to learn more about security - this is the session for you.","Level":"Intermediate","TimeSlotId":"16.40","Speaker":"Emil Kvarnhammar","SpeakerId":"emil-kvarnhammar","Room":"KITT"},{"Id":"scaled-agile--spotify","Title":"Scaled Agile @ Spotify","Abstract":"","Level":"Basic","TimeSlotId":"16.40","Speaker":"Joakim Sundén","SpeakerId":"joakim-sunden","Room":"Marvin"},{"Id":"microservices-with-dart-polymer-and-hypermedia","Title":"Microservices with Dart, Polymer and Hypermedia","Abstract":"This talk is a feedback about developing OpenSnap, a SnapChat clone based on Dart end to end (client, server, tooling). I will explain how this application is structured, what code can be shared, and how Dart makes it easier to develop modular applications.<br><br>We will also see a concrete example of a Microservices architecture based on JSON, HAL (Hypermedia) and STOMP. On the client side, we will talk about Web Components, Polymer, Material Design and Paper Elements.","Level":"Intermediate","TimeSlotId":"16.40","Speaker":"Sébastien Deleuze","SpeakerId":"sebastien-deleuze","Room":"R2D2"},{"Id":"teaching-our-css-to-play-nice","Title":"Teaching Our CSS To Play Nice","Abstract":"As our websites, applications and teams grow larger and more complicated, so does our CSS. Before we know it, we find ourselves no longer with cute little stylesheets, but sprawling, surly teenaged CSS that doesn’t always play nice with others. We can use best practices for organization, formatting and syntax, along with tools like pre-compilers, frameworks and style guides to raise full-grown stylesheets any designer or developer would be happy to work with.","Level":"Basic","TimeSlotId":"16.40","Speaker":"Jen Myers","SpeakerId":"jen-myers","Room":"Roomba"},{"Id":"do-more-of-what-you-love-less-of-what-you-dont-love-with-cloud-foundry","Title":"Do more of what you love, less of what you don't love with Cloud Foundry","Abstract":"Cloud Foundry eliminates a lot of the more boring aspects of our job - no more installing middleware, sorting out databases, and banging heads against complex deployments. This leaves us with more time for the fun stuff - writing code and getting stuff out to users fast. This talk will demonstrate how to get started with Cloud Foundry by live-coding an application (with a front-end, a back-end, and even a middle-bit) and then live-deploying it to the web.","Level":"Basic","TimeSlotId":"16.40","Speaker":"Holly Cummins","SpeakerId":"holly-cummins","Room":"T-800"},{"Id":"distractedly-intimate--your-users-on-mobile","Title":"Distractedly Intimate - Your Users on Mobile","Abstract":"Building for mobile is not just a change of form factor, and web versus native is one of the least interesting design questions to answer. How do we build for the user's most intimate and most loved device, and allow for the intermittent, partial attention? When everyone has a device this powerful on them all the time, everything changes. Let's talk about what that means.","Level":"Basic","TimeSlotId":"16.40","Speaker":"Cate Huston","SpeakerId":"cate-huston","Room":"Wall-E"},{"Id":"imagining-the-touchless-generation-move-beyond-glass","Title":"Imagining the touchless generation move beyond glass","Abstract":"Mobile touchless interaction, connecting devices, internet of things","Level":"Basic","TimeSlotId":"17.40","Speaker":"Paul Cronholm","SpeakerId":"paul-cronholm","Room":"HAL9000"},{"Id":"how-to-market-yourself-to-boost-your-career","Title":"How To Market Yourself To Boost Your Career","Abstract":"Let's face it.<br><br>If you want to have a successful career in software development today, being a good coder doesn't just cut it anymore.<br><br>Sure, writing good code will help you keep your job, but there are plenty of good and great coders out there that you've never heard of, either looking for jobs, or unsatisfied with their current jobs.<br><br>If you really want to stand out and get noticed, you've got to learn how to promote yourself.","Level":"Basic","TimeSlotId":"17.40","Speaker":"John Sonmez","SpeakerId":"john-sonmez","Room":"Johnny Five"},{"Id":"fslab-doing-data-science-with-f-","Title":"FsLab: Doing data science with F#","Abstract":"How to get knowledge from data? In this talk, I'll demonstrate end-to-end data analysis using FsLab - a cross-platform data science tools based on F# that make it easy to access data using type providers, analyze data in an explorative way and produce beautiful HTML5 reports visualizing the results. Along the way, we'll look at examples using open-government data, Wikipedia and other fun data sources!","Level":"Intermediate","TimeSlotId":"17.40","Speaker":"Tomas Petricek","SpeakerId":"tomas-petricek","Room":"KITT"},{"Id":"a-cold-hard-look-at-the-world-of-mobile-apps-and-where-they-may-go","Title":"A cold hard look at the world of Mobile Apps and where they may go","Abstract":"There's an app for that! The craze about apps and their usefulness as a form factor for mobile phones has been going on for a few years now and there are many beautiful success stories in the press about them. In this talk Chris Heilmann is going to give an overview of how the app market is doing, where you should invest and what may just be marketing instead of true facts. If you are into apps and you wonder where to go with yours, check this talk.","Level":"Basic","TimeSlotId":"17.40","Speaker":"Christian Heilmann","SpeakerId":"christian-heilmann","Room":"Marvin"},{"Id":"clojurescript-interfaces-to-react","Title":"ClojureScript interfaces to React","Abstract":"","Level":"Intermediate","TimeSlotId":"17.40","Speaker":"Michiel Borkent","SpeakerId":"michiel-borkent","Room":"R2D2"},{"Id":"framework-and-smoke-machines--true-story","Title":"Framework and smoke machines - true story","Abstract":"In this session I will share the story of our framework; how it started, the wins, the fails, our daily workflow and how we plan to take it to the next level by making it a crucial part of our Design, UX and Development processes.<br><br>Last but not least I will try to explain why a framework and smoke machines are a great match! Why they are a must have in every workplace and why/how they need to become bigger and more powerful.","Level":"Basic","TimeSlotId":"17.40","Speaker":"Mads Hensel","SpeakerId":"mads-hensel","Room":"Roomba"},{"Id":"analyzing-and-searching-data-using-elasticsearch","Title":"Analyzing and searching data using Elasticsearch","Abstract":"In this talk I would like to show you a few real-life use-cases where Elasticsearch can enhance the user experience of your applications. We will start with the most basic use case with a seemingly simple problem of searching for documents and move on to more advanced topics such as faceted navigation and structured search.<br><br>I would like to demonstrate that the very same tool and dataset can be used for real-time analytics (topic distribution, publishing frequency, most popular or commented on content) and data mining in a distributed environment capable of handling terabyte-sized datasets.<br><br>Finally we will demonstrate how Elasticsearch can provide the infrastructure for features beyond search, such as automatic content categorization, user-defined categories or even real-time alerts.<br><br>Attendees should walk away with a good understanding of what Elasticsearch can bring them and where it is a good fit.","Level":"Basic","TimeSlotId":"17.40","Speaker":"Honza Kral","SpeakerId":"honza-kral","Room":"T-800"},{"Id":"teaching-kids-programming-using-the-intentional-method","Title":"Teaching Kids Programming using the Intentional Method","Abstract":"TKP has created and uses a new method of teaching children programming. We call this the intentional method. TKP output consists of customized courseware and teaching techniques. All of TKP material is freely available to use and improve.","Level":"Basic","TimeSlotId":"17.40","Speaker":"Lynn Langit","SpeakerId":"lynn-langit","Room":"Wall-E"},{"Id":"about-passion-and-collaboration","Title":"About Passion and Collaboration","Abstract":"Sharing knowledge, cross-pollinating for mutual enrichment is what Øredev is all about. We learn so much from each other. To celebrate a decade of Sharing Knowledge, we invited a person from who we thought you would learn from, a person who's life has been about Passion and Collaboration. Tony Ernst will be the one interviewing Nile Rodgers during the evening. Do not miss it!","Level":"Basic","TimeSlotId":"20.00","Speaker":"Nile Rodgers","SpeakerId":"nile-rodgers","Room":"Marvin"}]