[  
   {  
      "Id":3324,
      "Name":"Adam Kosinski",
      "Bio":"<p>Journeyman, developer, craftsman, currently coding C# in London. Interested in just about anything, excelling at discussions over code, beer and pizza.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/adk0s"
         }
      ],
      "Sessions":[  
         {  
            "Id":2117,
            "Title":"A Unit Testing Swiss Army Knife"
         }
      ]
   },
   {  
      "Id":2312,
      "Name":"Alessandro Melchiori",
      "Bio":"<p>Software craftsman, husband, father, ex-sportsman and inquiring reader. Since I was young I have loved taking apart and reassembling things to understand how they work. Now, this passion has become my job: the step from Lego to software development was small.</p>\n\n<p>Finding the best possible solution so that a complex system can work at its best and making it run smoothly are the goals of my work. C#, WCF, ESB, MongoDb and Azure make up my survival toolkit and help me cruise through distributed systems and enterprise solutions, with ease.</p>\n\n<p>Be it a command or an event, I try to do my best in contributing to the life of the communities that have adopted me (ugidotnet and webdebs), trying to “give back” at least a part of what I have received over these years.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://codiceplastico.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/amelchiori"
         }
      ],
      "Sessions":[  
         {  
            "Id":1108,
            "Title":"Functional DDD"
         }
      ]
   },
   {  
      "Id":293,
      "Name":"Anthony Brown",
      "Bio":"",
      "Links":[  
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/bruinbrown93"
         }
      ],
      "Sessions":[  
         {  
            "Id":2107,
            "Title":"Building Skynet: Machine learning for software developers"
         }
      ]
   },
   {  
      "Id":3322,
      "Name":"Barbara Fusinska",
      "Bio":"<p>Developer, architect, problem solver. \nStrongly believes in team work and providing the best environment to help people reach their potential to the fullest.\nEnjoys designing beautiful system architectures using good practices, patterns and a great deal of common sense.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://barbarafusinska.com/"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/basiafusinska"
         }
      ],
      "Sessions":[  
         {  
            "Id":4133,
            "Title":"Architecture - why so serious?"
         }
      ]
   },
   {  
      "Id":5333,
      "Name":"Bart Read",
      "Bio":"",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://www.bartread.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/bart_read"
         }
      ],
      "Sessions":[  
         {  
            "Id":4135,
            "Title":"Scream if you want to go faster: speed up .NET and SQL Server web apps"
         }
      ]
   },
   {  
      "Id":3319,
      "Name":"Ben Hall",
      "Bio":"<p>Performed the rounds as a tester, developer, speaker, freelancer &amp; startup entrepreneur. Currently working on the next venture</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://www.ocelotuproar.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/ben_hall"
         }
      ],
      "Sessions":[  
         {  
            "Id":2111,
            "Title":"What Developers Need To Know About Visual Design "
         }
      ]
   },
   {  
      "Id":302,
      "Name":"Chris Canal",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":102,
            "Title":"Super charging your JavaScript development experience"
         }
      ]
   },
   {  
      "Id":11,
      "Name":"David Simner",
      "Bio":"<p>I started playing with computers when I stuffed sweets into my parents' floppy disk drive when I was 5.  They weren't happy.  When I was 10, I progressed onto something much more fun: coding!</p>\n\n<p>After a brief stint pretending to be an academic, I returned to what I love.  For the past 5 years I've been a software developer at Red Gate.</p>\n\n<p>There have been lots of mistakes and learning along the way, but that’s what makes it fun: I now know that “Minimally Viable” includes writing the clean-up code, because otherwise you’ll spend nearly a grand on Amazon S3 before anybody notices; luckily my boss was forgiving.</p>\n\n<p>In my spare time I try to convince my train-obsessed friends to give up their obsession, and despite claiming not to be able to cook, I “product manage” my partner's Fair Trade Cook Book website.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://www.davidsimner.me.uk/"
         }
      ],
      "Sessions":[  
         {  
            "Id":4124,
            "Title":"OWIN, Katana and ASP.NET vNext: eliminating the pain of IIS"
         }
      ]
   },
   {  
      "Id":303,
      "Name":"Forbes Lindesay",
      "Bio":"<p>Node.js enthusiast, open source contributor and maintainer of the Jade templating language..</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://www.forbeslindesay.co.uk/"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/ForbesLindesay"
         }
      ],
      "Sessions":[  
         {  
            "Id":104,
            "Title":"GitHub Automation"
         }
      ]
   },
   {  
      "Id":30,
      "Name":"Gary Short",
      "Bio":"<p>Gary Short is the Head of Gibraltar Labs, a skunk works division of Gibraltar software. He is a Microsoft MVP in C# as well as being a Node.js and Python hacker. Gary is a popular speaker giving presentations at conferences and user groups throughout the UK, Europe and the US, mainly on his pet subjects of Social Network Analysis, Big Data and Data Science</p>\n",
      "Links":[  
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/garyshort"
         }
      ],
      "Sessions":[  
         {  
            "Id":3127,
            "Title":"Data Science for Fun and Profit"
         }
      ]
   },
   {  
      "Id":2311,
      "Name":"Ian Cooper",
      "Bio":"<p>Ian Cooper has over 20 years of experience delivering Microsoft platform solutions in government, healthcare, and finance. During that time he has worked for the DTI, Reuters, Sungard, Misys, Beazley, and Huddle delivering everything from bespoke enterprise solutions, 'shrink-wrapped' products, and cloud services to thousands of customers. Ian is a passionate exponent of Software Craftsmanship and Agile Architecture. When he is not writing code he is also the and founder of the London .NET user group and speaks at events throughout the UK.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/ICooper"
         }
      ],
      "Sessions":[  
         {  
            "Id":1107,
            "Title":"Decoupling from ASP.NET - Hexagonal Architectures in .NET"
         }
      ]
   },
   {  
      "Id":53,
      "Name":"Ian Russell",
      "Bio":"<p>Experienced provider of simplicity, order and common-sense to complex OLTP solutions. Passionate about learning from others and giving back to the community. Paid to write C# and SQL, lover of F#, node.js and NoSql.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://ijrussell.tumblr.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/ijrussell"
         }
      ],
      "Sessions":[  
         {  
            "Id":108,
            "Title":"Using F# for Line of Business Applications"
         }
      ]
   },
   {  
      "Id":23,
      "Name":"Joel Hammond-Turner",
      "Bio":"<p>Joel works as a Technical Lead for Landmark, and is currently bringing his 20 years of experience of software development and a passion for both technology and elegance to designing a world-class applications for the property information and risk management sectors.</p>\n\n<p>He has presented sessions on using NuGet for enterprise software development at <a href=\"http://dddsouthwest.com/Agenda/tabid/55/Default.aspx\">DDDSW 4.0</a> and <a href=\"http://developerdeveloperdeveloper.com/north2/ViewSession.aspx?SessionID=1038\">DDDNorth 2</a>, and is responsible for the the open source <a href=\"http://visualstudiogallery.msdn.microsoft.com/f0145bdf-3bd8-46e6-b1ef-1a685d373ae8\">NuGet.PackageNPublish</a> tooling project.</p>\n\n<p>Outside of work he referees life with his wife and three young children in a home with more computers than is probably wise, but is really looking forward to teaching his boys Python now they've mastered Scratch on their Raspberry Pi.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://www.hammond-turner.org.uk"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/Rammesses"
         }
      ],
      "Sessions":[  
         {  
            "Id":3139,
            "Title":"So you want to be a Tech Lead? 10 things you need to do to succeed."
         }
      ]
   },
   {  
      "Id":4331,
      "Name":"Kendall Miller",
      "Bio":"<p>Kendall Miller is one of the founding partners of Gibraltar Software, an Independent Software Vendor (ISV) that develops &amp; markets commercial applications for .NET developers.  Introduced commercially in 2009, Loupe is an application logging &amp; monitoring platform that is currently used by customers around the world from individual consultants through Fortune 100 companies and governments. </p>\n\n<p>Before starting Gibraltar Software, Kendall worked for multiple startups leading their technology development from beginning through profitability.  In each case he's focused on translating enterprise-level performance and capabilities down to smaller companies. Kendall has a B.S in Computer Engineering from the University of Illinois, Urbana-Champaign.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://rocksolid.gibraltarsoftware.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/kendallmiller"
         }
      ],
      "Sessions":[  
         {  
            "Id":3129,
            "Title":"Build Great Software for the Enterprise and Love it"
         }
      ]
   },
   {  
      "Id":62,
      "Name":"Liam Westley",
      "Bio":"<p>Liam Westley is an Application Architect at Huddle where he works with some of the best .Net developers and UX designers to deliver world class collaboration software.  He quite likes working just off Old Street as there is some fantastic food and coffee to be had within a few minutes walk.</p>\n\n<p>Previous to Huddle Liam worked at Criteria MX, a digital media startup and has worked as a consultant via his own company Tiger Computer Services Ltd, specialising in software for Broadcast Television.  His Niagara SMS moderation system was used by QVC UK for eight years to display SMS messages from viewers, live, on screen.  Liam is also responsible for the ticketing system for Hat Trick Productions which provides e-tickets to shows such as Have I Got New For You and Room 101.</p>\n\n<p>Liam has worked for chellomedia, GMTV, BSkyB, SmashedAtom and Original Thinking Group. In his time he created the first in house weather system for Sky News using Visual Basic 1.0, acted as architect for two general election systems, project managed the launch of the GMTV web site, was key to delivering the first interactive television chat service in the UK for BSkyB and helped launch the first live shopping channels in the Netherlands.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://geekswithblogs.net/twickers"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/westleyl"
         }
      ],
      "Sessions":[  
         {  
            "Id":1109,
            "Title":"An Actor&#39;s Life for Me – An introduction to the TPL Dataflow Library and asynchronous programming blocks"
         }
      ]
   },
   {  
      "Id":48,
      "Name":"Mark Rendle",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":3125,
            "Title":"The vNext Big Thing"
         }
      ]
   },
   {  
      "Id":2316,
      "Name":"Matt Warren",
      "Bio":"<p>I'm a C# dev who loves nothing better than finding and fixing performance issues. I also contribute to <a href=\"https://github.com/ayende/ravendb\">RavenDB</a> and wrote the .NET port of <a href=\"https://github.com/HdrHistogram/HdrHistogram\">HdrHistogram</a>.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://www.mattwarren.org"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/matthewwarren"
         }
      ],
      "Sessions":[  
         {  
            "Id":3140,
            "Title":"Performance is a Feature!"
         }
      ]
   },
   {  
      "Id":309,
      "Name":"Mauro Servienti",
      "Bio":"<p>CTO and Architect @ Mastreeno Ltd, Dublin, Long time Microsoft MVP for Visual C#, really passionated about DDD, CQRS and Event Sourcing. NServiceBus Champ and official trainer, RavendDB trainer.</p>\n\n<p>Has been working with the .net platform since the first Alpha in 1999.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://milestone.topics.it"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/mauroservienti"
         }
      ],
      "Sessions":[  
         {  
            "Id":107,
            "Title":"NServiceBus: introduction to a message based distributed architecture"
         }
      ]
   },
   {  
      "Id":3320,
      "Name":"Melinda Seckington",
      "Bio":"<p>Melinda Seckington is a developer at FutureLearn, a social learning platform, backed by the Open University, offering free courses from a wide range of university partners, and cultural institutions like the British Council, British Library and British Museum. </p>\n\n<p>She loves attending and hacking at Hackdays, BarCamps and other tech meet ups, and since 2009 has been organising them at Geeks of London, including HACKED at the O2 last year. She also runs MissGeeky.com, a blog about all things geeky and girly.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://missgeeky.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/mseckington"
         }
      ],
      "Sessions":[  
         {  
            "Id":2113,
            "Title":"DDD: Disney Driven Development"
         }
      ]
   },
   {  
      "Id":1313,
      "Name":"Pete Smith",
      "Bio":"<p>Pete is a software consultant based in London with almost 10 years of experience making web applications with Asp.Net, specialising in API design and Javascript browser-based applications. He is the author of Superscribe - a graph based routing framework, and the OData library Linq to Querystring.</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://roysvork.wordpress.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/roysvork"
         }
      ],
      "Sessions":[  
         {  
            "Id":1106,
            "Title":"Beyond responsive design - UI for the modern web application"
         }
      ]
   },
   {  
      "Id":3323,
      "Name":"Peter Mounce",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":2115,
            "Title":"Embracing DevOps at JUST EAT, within a Microsoft platform"
         }
      ]
   },
   {  
      "Id":34,
      "Name":"Phillip Trelford",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":1114,
            "Title":"All your types are belong to us!"
         }
      ]
   },
   {  
      "Id":2314,
      "Name":"Sam Hogarth",
      "Bio":"<p>Sam works with .NET at Nonlinear Dynamics, creating software to analyse proteomics and metabolomics experiments. Previously he has built desktop and web-based trading applications for some of the world's largest financial institutions, developed for two charting products (Visiblox and ShinobiControls) and contributed to the PropertyCross open-source project.</p>\n\n<p>In his spare time he runs, plays a ridiculous amount of board games, co-organises Newcastle Skeptics in the Pub and builds Android apps - including a scheduling app for DDD East Anglia! ;)</p>\n",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://samhogy.co.uk"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/samhogy"
         }
      ],
      "Sessions":[  
         {  
            "Id":2109,
            "Title":"Keeping it responsive - cross-platform MVVM with ReactiveUI"
         }
      ]
   },
   {  
      "Id":4328,
      "Name":"Stephen Harrison",
      "Bio":"",
      "Links":[  
         {  
            "Icon":"icon-globe",
            "Url":"http://Tinamous.com"
         },
         {  
            "Icon":"icon-twitter",
            "Url":"http://twitter.com/TinamousSteve"
         }
      ],
      "Sessions":[  
         {  
            "Id":3119,
            "Title":"A Brief Introduction to Making your own (Internet of Things) Thing."
         }
      ]
   },
   {  
      "Id":4332,
      "Name":"Tomas Petricek",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":3132,
            "Title":"Taking your craft seriously with F#"
         }
      ]
   }
]