[  
   {  
      "Id":3324,
      "Name":" Adam Kosinski",
      "Bio":"<p>Journeyman, developer, craftsman, currently coding C# in London. Interested in just about anything, excelling at discussions over code, beer and pizza.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/adk0s"
         }
      ],
      "Sessions":[  
         {  
            "Id":2117,
            "Title":"A Unit Testing Swiss Army Knife",
            "Abstract":"\r\n    <p>Putting all of <em>#IsTddDeadOrNotQuiteYet</em> discussion aside, there are a lot of things to be said about more technical side of writing tests. Instead of big important questions like \"How\" or \"Why\", I would like to present you a couple of tricks, patterns and libraries that help in what is usually of secondary interest - readability, maintainability.</p>\n\n<p>The leading motive for this talk will be approaching our tests like living documentation - and what we can possibly do to make it better.</p>\n\n<p>So, have you ever wondered what is Bulider Pattern about? What is all the fuss in being \"fluent\"? Or maybe you wondered if you can effectively integration test you MVC app? I hope you will find useful learning this, and some more. </p>\n\r\n"
         }
      ]
   },
   {  
      "Id":2312,
      "Name":" Alessandro Melchiori",
      "Bio":"<p>Software craftsman, husband, father, ex-sportsman and inquiring reader. Since I was young I have loved taking apart and reassembling things to understand how they work. Now, this passion has become my job: the step from Lego to software development was small.</p>\n\n<p>Finding the best possible solution so that a complex system can work at its best and making it run smoothly are the goals of my work. C#, WCF, ESB, MongoDb and Azure make up my survival toolkit and help me cruise through distributed systems and enterprise solutions, with ease.</p>\n\n<p>Be it a command or an event, I try to do my best in contributing to the life of the communities that have adopted me (ugidotnet and webdebs), trying to “give back” at least a part of what I have received over these years.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://codiceplastico.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/amelchiori"
         }
      ],
      "Sessions":[  
         {  
            "Id":1108,
            "Title":"Functional DDD",
            "Abstract":"\r\n    <p>Very often we approach, more or less unconsciously, DDD's principles only with object-oriented paradigm, without exploring if other \"style\" can live better with aggregates, value objects, commands and domain events. Well, yes: there is 'other' out there... \nIn this session we will see how a functional language as F# can lead to a more intuitive and compact implementation of our domains.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":293,
      "Name":" Anthony Brown",
      "Bio":"",
      "Links":[  
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/bruinbrown93"
         }
      ],
      "Sessions":[  
         {  
            "Id":2107,
            "Title":"Building Skynet: Machine learning for software developers",
            "Abstract":"\r\n    <p>How does Netflix know that I'd like that new movie which just released? How does Google know which ads to serve to me? How do games like Halo and Titanfall put me in game lobbies to create even matches? All these questions are answered with machine learning algorithms. Machine learning can sometimes look difficult. This session aims to break down the barrier to entry for machine learning and show how powerful even the most simple algorithms can be. Expect plenty of sample code to show just how quick and easy these basic algorithms can be.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":3322,
      "Name":" Barbara Fusinska",
      "Bio":"<p>Developer, architect, problem solver. \nStrongly believes in team work and providing the best environment to help people reach their potential to the fullest.\nEnjoys designing beautiful system architectures using good practices, patterns and a great deal of common sense.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://barbarafusinska.com/"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/basiafusinska"
         }
      ],
      "Sessions":[  
         {  
            "Id":4133,
            "Title":"Architecture - why so serious?",
            "Abstract":"\r\n    <p>What comes to developer's mind when he hears the phrase 'software architecture'? Is it clean design or rather heavy and unusable overhead? Nowadays there are many approaches to follow while building the software, but they often sound to pompous and lead to overcomplicating things. Programmers refuse to consider them, when all they need is making some simple functionalities work. They hear the word architecture and they get uptight in seconds. And that's not how it's supposed to be. Good practices should help, not introduce unnecessary problems and disturbance.</p>\n\n<p>What if thinking about architecture doesn't make the software too heavy and introduces actual value? What if some of its concepts could be used easily, even in non complex projects, simplifying the process of creation at the same time?</p>\n\n<p>The talk is to illustrate how architecture is not about ivory towers, but actual coding, and on what those coding architects should do. It will center on showing some habits developed through years of building different kinds of software systems. Using them can help reducing work, while focusing on what's most important - getting the job done that brings concrete value to the client. It will be demonstrated by real (but simple in the same time) code and fully functional web application. One that can be used as an outline for further usage, as patterns to apply. Presented examples will highlight power of more abstract approach, but in the same time will consider hands on code.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":5333,
      "Name":" Bart Read",
      "Bio":"",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://www.bartread.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/bart_read"
         }
      ],
      "Sessions":[  
         {  
            "Id":4135,
            "Title":"Scream if you want to go faster: speed up .NET and SQL Server web apps",
            "Abstract":"\r\n    <p>We all know that websites need to be fast. But how do you juice up creaking web apps that have been around for a while without deploying the thermonuclear option (i.e., the costly and much-maligned ground-up rewrite)?</p>\n\n<p>Unfortunately this can still prove tricky, especially when the issues lie in the database layer. Help is at hand though: I’ll show you the techniques that will help you hunt down performance problems in your database, and relate them back to your .NET code. But that's only half the story: we'll also talk about the strategies you can use to fix them from the relatively simple, to the much more involved.</p>\n\n<p>You should leave with an arsenal of optimisation tricks for every occasion!</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":3319,
      "Name":" Ben Hall",
      "Bio":"<p>Performed the rounds as a tester, developer, speaker, freelancer &amp; startup entrepreneur. Currently working on the next venture</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://www.ocelotuproar.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/ben_hall"
         }
      ],
      "Sessions":[  
         {  
            "Id":2111,
            "Title":"What Developers Need To Know About Visual Design ",
            "Abstract":"\r\n    <p>The world has become a very design sensitive meaning it’s now even more critical that developers build products that look amazing. Sadly frameworks like twitter’s bootstrap can only take us so far and even with designers on the team developers need to understand the key principals of good design to make effective decisions.</p>\n\n<p>In this session Ben will explore the five key topics around design that can make or break an application and website. The key topics are Layout and the golden ratio, Typography, Imaginary, Colours and User Feedback. With these topics attendees will come away with a deeper understanding about why certain elements look good while others don’t and what developers really should know about design. It will explore the cognitive science and research to move beyond personal options about design to data and research driven insights.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":302,
      "Name":" Chris Canal",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":102,
            "Title":"Super charging your JavaScript development experience",
            "Abstract":"\r\n    <p>With the release of V8 and subsequently NodeJs, JavaScript has started to grow up.  In this session we will look at how you can super charge your JavaScript development lifecycle and deliver better written, cleaner and more coherent JavaScript with and without VisualStudio</p>\n\n<p>We will look at the many awesome frameworks for infrastructural support when developing JavaScript applications like Yeoman, Gulp, grunt, Browserfy and a few other handy libraries</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":11,
      "Name":" David Simner",
      "Bio":"<p>I started playing with computers when I stuffed sweets into my parents' floppy disk drive when I was 5.  They weren't happy.  When I was 10, I progressed onto something much more fun: coding!</p>\n\n<p>After a brief stint pretending to be an academic, I returned to what I love.  For the past 5 years I've been a software developer at Red Gate.</p>\n\n<p>There have been lots of mistakes and learning along the way, but that’s what makes it fun: I now know that “Minimally Viable” includes writing the clean-up code, because otherwise you’ll spend nearly a grand on Amazon S3 before anybody notices; luckily my boss was forgiving.</p>\n\n<p>In my spare time I try to convince my train-obsessed friends to give up their obsession, and despite claiming not to be able to cook, I “product manage” my partner's Fair Trade Cook Book website.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://www.davidsimner.me.uk/"
         }
      ],
      "Sessions":[  
         {  
            "Id":4124,
            "Title":"OWIN, Katana and ASP.NET vNext: eliminating the pain of IIS",
            "Abstract":"\r\n    <p>I first encountered OWIN when I added SignalR to a legacy ASP.NET MVC app, and had to write a piece of OWIN middleware to get SignalR to play nicely with our legacy authentication.</p>\n\n<p>It was a thoroughly impressive experience, so I built my next greenfield project on OWIN &amp; Katana as a single-page app using static files &amp; Web API, finally ditching IIS for good.  The glad tidings continue for Microsoft web developers, with ASP.NET vNext promising even more goodness on the horizon.</p>\n\n<p>There’s a lot of changes coming for those of us working on the .NET web stack, so this talk will show you what things look like today:</p>\n\n<ul>\n<li>What are OWIN &amp; Katana, and why you should care</li>\n<li>What middleware is, as well as why and how you write it</li>\n<li>The advantages this brings for testing</li>\n<li>How Helios lets you host on IIS (if you really <em>really really</em> want to)</li>\n</ul>\n\n<p>As well as what's changing in ASP.NET vNext:</p>\n\n<ul>\n<li>How Roslyn comes into play</li>\n<li>The what and the why of the K runtime</li>\n<li>Why you should care about the Core CLR</li>\n<li>What’s shiny about ASP.NET MVC 6</li>\n</ul>\n\n<p>There’s a lot to cover, so we’ll move fast. You'll come away knowing why and how you should start using this on your own projects.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":303,
      "Name":" Forbes Lindesay",
      "Bio":"<p>Node.js enthusiast, open source contributor and maintainer of the Jade templating language..</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://www.forbeslindesay.co.uk/"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/ForbesLindesay"
         }
      ],
      "Sessions":[  
         {  
            "Id":104,
            "Title":"GitHub Automation",
            "Abstract":"\r\n    <p>GitHub has one of the best REST APIs you'll ever see. Pretty much any task in GitHub can be automated. Tired of updating code after a feature gets deprecated? Write a bot for that. Need to add the repository field to all your package.json files? Script it. You can even use GitHub as the backend for an entire application to take advantage of its built in collaboration features.  This talk will take you through how to write you own GitHub automation code in JavaScript and give you some ideas on how to use your new-found powers for good.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":30,
      "Name":" Gary Short",
      "Bio":"<p>Gary Short is the Head of Gibraltar Labs, a skunk works division of Gibraltar software. He is a Microsoft MVP in C# as well as being a Node.js and Python hacker. Gary is a popular speaker giving presentations at conferences and user groups throughout the UK, Europe and the US, mainly on his pet subjects of Social Network Analysis, Big Data and Data Science</p>\n",
      "Links":[  
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/garyshort"
         }
      ],
      "Sessions":[  
         {  
            "Id":3127,
            "Title":"Data Science for Fun and Profit",
            "Abstract":"\r\n    <p>Make no mistake, data science can be hard, but it can also be fun. In this session I'll introduce you to Classic and Bayesian Statistics and Machine Learning, all through the medium of predicting horse racing results. We'll explore a number of techniques for making such predictions and we'll finish by combining them into a powerful \"mixed model\" prediction engine, that's sure to pick the next big winner. This session won't only improve your knowledge, it'll improve your bank balance too! Note: probably won't do the latter though. :-)</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":2311,
      "Name":" Ian Cooper",
      "Bio":"<p>Ian Cooper has over 20 years of experience delivering Microsoft platform solutions in government, healthcare, and finance. During that time he has worked for the DTI, Reuters, Sungard, Misys, Beazley, and Huddle delivering everything from bespoke enterprise solutions, 'shrink-wrapped' products, and cloud services to thousands of customers. Ian is a passionate exponent of Software Craftsmanship and Agile Architecture. When he is not writing code he is also the and founder of the London .NET user group and speaks at events throughout the UK.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/ICooper"
         }
      ],
      "Sessions":[  
         {  
            "Id":1107,
            "Title":"Decoupling from ASP.NET - Hexagonal Architectures in .NET",
            "Abstract":"\r\n    <p>The term 'hexagonal architecture' has come back and forth in popularity since Alistair Cockburn first mooted it, with the Rails community's recent soul searching over its importance or threat just the latest. So what is a hexagonal architecture, why might you want to use one, and why is the 'Rails just falls away' (https://www.youtube.com/watch?v=tg5RFeSfBM4) threat so discomforting to web framework builders. How can we make 'ASP.NET just fall away'.</p>\n\n<p>In this presentation we will look at the Layered Architectural style - when we would want to use one (as opposed to the alternatives) and when it is appropriate how to implement one. We will look at how to implement the Ports &amp; Adapters (Hexagonal's 'proper' name) style, explaining what the different layers are. </p>\n\n<p>We will look at the value the command pattern for implementing our ports , explain why Netflix uses it in Hystrix for reliability. On the way we will discuss Retry, Timeout and Circuit Breaker and explain how we can do better than Hystrix with a Command Dispatcher and Command Processor.</p>\n\n<p>We'll show code throughout, including a look at the Paramore. Brighter framework, an OSS version of the platform we use at Huddle to build this kind of architecture.</p>\n\n<p>As a bonus we will round off showing you how easy it is go from sync to async with this approach.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":53,
      "Name":" Ian Russell",
      "Bio":"<p>Experienced provider of simplicity, order and common-sense to complex OLTP solutions. Passionate about learning from others and giving back to the community. Paid to write C# and SQL, lover of F#, node.js and NoSql.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://ijrussell.tumblr.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/ijrussell"
         }
      ],
      "Sessions":[  
         {  
            "Id":108,
            "Title":"Using F# for Line of Business Applications",
            "Abstract":"\r\n    <p>C# is a great language for developing Line of Business applications but F# is even better! If you want to write code that expresses your requirements clearly, ensures correctness and supports rapid, and fun, development then guess what, F# does all that and more!</p>\n\n<p>No prior experience of F# is necessary for this session but be warned, once you've seen what F# can do, you won't want to go back to C#!</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":23,
      "Name":" Joel Hammond-Turner",
      "Bio":"<p>Joel works as a Technical Lead for Landmark, and is currently bringing his 20 years of experience of software development and a passion for both technology and elegance to designing a world-class applications for the property information and risk management sectors.</p>\n\n<p>He has presented sessions on using NuGet for enterprise software development at <a href=\"http://dddsouthwest.com/Agenda/tabid/55/Default.aspx\">DDDSW 4.0</a> and <a href=\"http://developerdeveloperdeveloper.com/north2/ViewSession.aspx?SessionID=1038\">DDDNorth 2</a>, and is responsible for the the open source <a href=\"http://visualstudiogallery.msdn.microsoft.com/f0145bdf-3bd8-46e6-b1ef-1a685d373ae8\">NuGet.PackageNPublish</a> tooling project.</p>\n\n<p>Outside of work he referees life with his wife and three young children in a home with more computers than is probably wise, but is really looking forward to teaching his boys Python now they've mastered Scratch on their Raspberry Pi.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://www.hammond-turner.org.uk"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/Rammesses"
         }
      ],
      "Sessions":[  
         {  
            "Id":3139,
            "Title":"So you want to be a Tech Lead? 10 things you need to do to succeed.",
            "Abstract":"\r\n    <p>\"Tech Lead\" is an amorphous job title - is it all about the technology, or all about leadership? What should the balance really be?</p>\n\n<p>And it can also be a complex and thankless role too - particularly if you find yourself becoming the go-to guy (or gal) for everyone from the intern to the product manager.</p>\n\n<p>In this talk I'll cover (at least) 10 things that I think are essential to success in both areas, including how to address technical debt, herd your PMs and make sure your development team has a steady flow of work (and beer, pizza or other \"motivationals\").</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":4331,
      "Name":" Kendall Miller",
      "Bio":"<p>Kendall Miller is one of the founding partners of Gibraltar Software, an Independent Software Vendor (ISV) that develops &amp; markets commercial applications for .NET developers.  Introduced commercially in 2009, Loupe is an application logging &amp; monitoring platform that is currently used by customers around the world from individual consultants through Fortune 100 companies and governments. </p>\n\n<p>Before starting Gibraltar Software, Kendall worked for multiple startups leading their technology development from beginning through profitability.  In each case he's focused on translating enterprise-level performance and capabilities down to smaller companies. Kendall has a B.S in Computer Engineering from the University of Illinois, Urbana-Champaign.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://rocksolid.gibraltarsoftware.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/kendallmiller"
         }
      ],
      "Sessions":[  
         {  
            "Id":3129,
            "Title":"Build Great Software for the Enterprise and Love it",
            "Abstract":"\r\n    <p>You want to write great code - taking the time to create an application that is cleanly written, easy to test, performs well, and delights users.  Your company wants it done yesterday.  <strong>How do you get the time and budget you need to build it right instead of just pounding out the next feature</strong>?</p>\n\n<p>In this talk, we'll cover how to:</p>\n\n<ol>\n<li>Never skip coded tests again.</li>\n<li>Communicate security risks effectively so your business isn't the next Target.</li>\n<li>Pay down technical debt while delivering the features your users are waiting for.</li>\n</ol>\n\n<p>Sound incredible? Come to the talk to find out how you can go home happy with the work you've done each day, even in an enterprise.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":62,
      "Name":" Liam Westley",
      "Bio":"<p>Liam Westley is an Application Architect at Huddle where he works with some of the best .Net developers and UX designers to deliver world class collaboration software.  He quite likes working just off Old Street as there is some fantastic food and coffee to be had within a few minutes walk.</p>\n\n<p>Previous to Huddle Liam worked at Criteria MX, a digital media startup and has worked as a consultant via his own company Tiger Computer Services Ltd, specialising in software for Broadcast Television.  His Niagara SMS moderation system was used by QVC UK for eight years to display SMS messages from viewers, live, on screen.  Liam is also responsible for the ticketing system for Hat Trick Productions which provides e-tickets to shows such as Have I Got New For You and Room 101.</p>\n\n<p>Liam has worked for chellomedia, GMTV, BSkyB, SmashedAtom and Original Thinking Group. In his time he created the first in house weather system for Sky News using Visual Basic 1.0, acted as architect for two general election systems, project managed the launch of the GMTV web site, was key to delivering the first interactive television chat service in the UK for BSkyB and helped launch the first live shopping channels in the Netherlands.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://geekswithblogs.net/twickers"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/westleyl"
         }
      ],
      "Sessions":[  
         {  
            "Id":1109,
            "Title":"An Actor&#39;s Life for Me – An introduction to the TPL Dataflow Library and asynchronous programming blocks",
            "Abstract":"\r\n    <p>Every version of the .NET Framework has brought improvements to asynchronous and concurrent programming. While .NET 4.0 brought the async/await model which is useful for improving UI responses and server applications, it can sometimes still be tricky to marshal multiple threads within longer processing pipelines.</p>\n\n<p>The Dataflow Library consists of a Nuget package built on top of the Task Parallel Library (TPL). It harnesses the actor-based programming model to provide a set of dataflow blocks data structures that buffer and process data, which you can connect together to form custom pipelines with messages passed between the blocks.</p>\n\n<p>By using the Dataflow Library you can concentrate on the messages and actions being performed, while the blocks marshal the messages, provide concurrent message processing and buffering as well as supporting cancellation and exception handling.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":48,
      "Name":" Mark Rendle",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":3125,
            "Title":"The vNext Big Thing",
            "Abstract":"\r\n    <p>At TechEd this year, various Scotts and a David announced ASP.NET vNext, the biggest thing to happen to the Microsoft web developers story since ASP.NET 1.0.</p>\n\n<p>It's a moving target, so I can't say exactly what the talk will include, but I can guarantee it will cover:</p>\n\n<ul>\n<li>The Core CLR, the K Runtime, and the project.json file</li>\n<li>How Roslyn fits into the story</li>\n<li>What (and why) OWIN is, and how to write middleware for it</li>\n<li>The merging of MVC and Web API into a single, streamlined, uber-framework</li>\n<li>Why I'm never going to finish Simple.Web</li>\n</ul>\n\n<p>Look, it's all awesome. Just come and see.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":2316,
      "Name":" Matt Warren",
      "Bio":"<p>I'm a C# dev who loves nothing better than finding and fixing performance issues. I also contribute to <a href=\"https://github.com/ayende/ravendb\">RavenDB</a> and wrote the .NET port of <a href=\"https://github.com/HdrHistogram/HdrHistogram\">HdrHistogram</a>.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://www.mattwarren.org"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/matthewwarren"
         }
      ],
      "Sessions":[  
         {  
            "Id":3140,
            "Title":"Performance is a Feature!",
            "Abstract":"\r\n    <p>Starting with the premise that <em>\"Performance is a Feature\"</em>, this session will look at how to measure, what to measure and how get the best performance from your .NET code. We will look at real-world examples from the Roslyn code-base, StackOverflow and my personal experience of trying (but ultimately failing) to break a world record.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":309,
      "Name":" Mauro Servienti",
      "Bio":"<p>CTO and Architect @ Mastreeno Ltd, Dublin, Long time Microsoft MVP for Visual C#, really passionated about DDD, CQRS and Event Sourcing. NServiceBus Champ and official trainer, RavendDB trainer.</p>\n\n<p>Has been working with the .net platform since the first Alpha in 1999.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://milestone.topics.it"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/mauroservienti"
         }
      ],
      "Sessions":[  
         {  
            "Id":107,
            "Title":"NServiceBus: introduction to a message based distributed architecture",
            "Abstract":"\r\n    <p>SOA and distributed had been buzzwords for a long time, a message based architecture that embrace the SOA principles is the real solution to a scalable and distributed environment where HA or/and temporal decoupling are a must.\nIn this session we will introduce messaging concepts and see how NServiceBus, a powerfull toolkit to rule all the aspects of a messaging transport, can dramatically simplify the development process.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":3320,
      "Name":" Melinda Seckington",
      "Bio":"<p>Melinda Seckington is a developer at FutureLearn, a social learning platform, backed by the Open University, offering free courses from a wide range of university partners, and cultural institutions like the British Council, British Library and British Museum. </p>\n\n<p>She loves attending and hacking at Hackdays, BarCamps and other tech meet ups, and since 2009 has been organising them at Geeks of London, including HACKED at the O2 last year. She also runs MissGeeky.com, a blog about all things geeky and girly.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://missgeeky.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/mseckington"
         }
      ],
      "Sessions":[  
         {  
            "Id":2113,
            "Title":"DDD: Disney Driven Development",
            "Abstract":"\r\n    <p>Disney parks are built using their Four Keys of The Kingdom: Safety, Courtesy, Show and Efficiency. This talk will show examples of how Disney have applied these four keys everywhere in their parks and how we can extend those principles to our work as web developers.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":1313,
      "Name":" Pete Smith",
      "Bio":"<p>Pete is a software consultant based in London with almost 10 years of experience making web applications with Asp.Net, specialising in API design and Javascript browser-based applications. He is the author of Superscribe - a graph based routing framework, and the OData library Linq to Querystring.</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://roysvork.wordpress.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/roysvork"
         }
      ],
      "Sessions":[  
         {  
            "Id":1106,
            "Title":"Beyond responsive design - UI for the modern web application",
            "Abstract":"\r\n    <p>Applications written for the modern web are being consumed not just on desktop browsers, but also on a myriad of other devices... even watches and glasses. If you design your application with a pc screen in mind, at worst you're either cutting your userbase in half or setting yourself up for an expensive redesign.</p>\n\n<p>In this talk I'll introduce you to some modern web design constructs, and the technologies that bring them to life. Learn how to create apps that work just as well on phone, mobile and desktop with no extra effort, and without restrictive layout frameworks. Who knows... you may even even see things that begin to rival native apps!</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":3323,
      "Name":" Peter Mounce",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":2115,
            "Title":"Embracing DevOps at JUST EAT, within a Microsoft platform",
            "Abstract":"\r\n    <p>JUST EAT changed its culture towards embracing DevOps principles, and heavily leveraged AWS to achieve it.</p>\n\n<p>We're a successful online takeaway ecommerce website running on a Microsoft-based platform.</p>\n\n<p>Come learn how we:</p>\n\n<ul>\n<li>re-organised our teams and our platform to loosely couple them</li>\n<li>re-organised our architecture to be more modular</li>\n<li>made it possible for developers to operate their code in production directly, starting with shoot-it-in-the-head debugging</li>\n<li>made it possible for developers to continuously ship changes</li>\n<li>eliminated most differences between production and qa environments</li>\n<li>became more resilient as a happy by-product</li>\n</ul>\n\r\n"
         }
      ]
   },
   {  
      "Id":34,
      "Name":" Phillip Trelford",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":1114,
            "Title":"All your types are belong to us!",
            "Abstract":"\r\n    <p>Big Data tasks typically require acquiring and analysing data from a wide variety of data sources, visualizing the data and applying a barrage of statistical algorithms. This talk will show how this can be accomplished in Visual Studio on Windows or Xamarin Studio on Mac and Linux using F#'s REPL and Type Providers. \nType Providers give typed access to a wide range of data sources from CSV, JSON and XML to SQL, OData and Web Services, instantly without a code generation step. The Type Provider mechanism can also be used to analyse data with direct access to statistical packages like R and MATLAB as well as all the existing .Net libraries.\nFinally visualizations can be generated using F#'s desktop charting libraries, or with ASP.Net and even JavaScript libraries like HighCharts.\nExpect a sprinkling of anecdotes drawn from experiences working on large machine learning systems at Microsoft, and plenty of live demos.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":2314,
      "Name":" Sam Hogarth",
      "Bio":"<p>Sam works with .NET at Nonlinear Dynamics, creating software to analyse proteomics and metabolomics experiments. Previously he has built desktop and web-based trading applications for some of the world's largest financial institutions, developed for two charting products (Visiblox and ShinobiControls) and contributed to the PropertyCross open-source project.</p>\n\n<p>In his spare time he runs, plays a ridiculous amount of board games, co-organises Newcastle Skeptics in the Pub and builds Android apps - including a scheduling app for DDD East Anglia! ;)</p>\n",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://samhogy.co.uk"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/samhogy"
         }
      ],
      "Sessions":[  
         {  
            "Id":2109,
            "Title":"Keeping it responsive - cross-platform MVVM with ReactiveUI",
            "Abstract":"\r\n    <p>Building an awesome user interface is hard work. You've got the complexities of real life to deal with - handling user inputs, dealing with slow network connections and managing background workers. There's also this testing thing that people keep going on about!</p>\n\n<p>We need a way of handling the real world, whilst behaving in a predictable and responsive manner. Enter ReactiveUI, a fusion of MVVM and the Reactive Extensions (Rx) for .NET applications.</p>\n\n<p>In this session I'll introduce ReactiveUI, show you some tips and tricks, discuss the benefits and tradeoffs of the framework and show how it can be used as a solid foundation for building cross-platform .NET applications.</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":4328,
      "Name":" Stephen Harrison",
      "Bio":"",
      "Links":[  
         {  
            "Icon":"fa-globe",
            "Url":"http://Tinamous.com"
         },
         {  
            "Icon":"fa-twitter",
            "Url":"http://twitter.com/TinamousSteve"
         }
      ],
      "Sessions":[  
         {  
            "Id":3119,
            "Title":"A Brief Introduction to Making your own (Internet of Things) Thing.",
            "Abstract":"\r\n    <p>The Internet of Things is exploding and it's a great time to join in: more and more devices like the Arduino, Netduino and Gadgeteer are becoming available. The question is, how do I get started?</p>\n\n<p>We will look at what is available in terms of popular hardware for building your Thing, and a demo of how to develop for the Arduino, followed by an introduction to the Gadgeteer and .Net Micro Framework, hopefully finishing up with a fairly simple but connected Gadgeteer based Thing (Wifi Allowing!).</p>\n\r\n"
         }
      ]
   },
   {  
      "Id":4332,
      "Name":" Tomas Petricek",
      "Bio":"",
      "Links":[  

      ],
      "Sessions":[  
         {  
            "Id":3132,
            "Title":"Taking your craft seriously with F#",
            "Abstract":"\r\n    <p>Many standard F# libraries and tools, including the compiler itself, are developed as open-source and have a large number of contributors. To successfully build such projects, you need to be serious about your craft. This includes comprehensive testing, using automated build tools, continuous integration, as well as creating great documentation and tutorials. In this talk, I'll talk about what I learned as an open-source F# contributor.</p>\n\n<p>Along the way, we'll look a number of risk-free ways of introducing F# into your workflow:</p>\n\n<ul>\n<li>How to use F# Interactive for explorative programming and writing code that works on the first try</li>\n<li>Using FAKE - an F# build tool - to automate everything in your build process</li>\n<li>Writing readable unit tests with F# and using FsCheck for property-based testing</li>\n<li>Generating great documentation using F# Formatting tools</li>\n</ul>\n\n<p>In summary, this talk is a walkthrough covering some of the software engineering aspects of programming that have been working extremely well for the F# open-source ecosystem. After the talk, you'll have a good idea how to use some of the techniques in your daily job - but you may as well become an F# contributor! </p>\n\r\n"
         }
      ]
   }
]