[{"Id":"adam-bien","Name":"Adam Bien","Bio":"Consultant and author Adam Bien is an Expert Group member for the Java EE 6 and 7, EJB 3.X, JAX-RS, and JPA 2.X JSRs. He has worked with Java technology since JDK 1.0 and with Servlets/EJB 1.0 and is now an architect and developer for Java SE and Java EE projects. He has edited several books about JavaFX, J2EE, and Java EE, and he is the author of Real World Java EE Patterns—Rethinking Best Practices and Real World Java EE Night Hacks—Dissecting the Business Tier. Adam is also a Java Champion, Top Java Ambassador 2012, and JavaOne 2009, 2011, 2012 and 2013 Rock Star. Adam occasionally organizes Java EE workshops at Munich’s airport (http://airhacks.com).","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/AdamBien"},{"Icon":"webpage","Url":"http://adam-bien.com"}],"Sessions":[{"Id":"ingredients-of-successful-java-ee-7-applications","Title":"Ingredients of Successful Java EE 7 Applications","Abstract":"","Level":"Level: Intermediate"}],"Company":"adam-bien.comg","Tags":["Java"]},{"Id":"adam-goucher","Name":"Adam Goucher","Bio":"Tester. Writer. Ironic Gatekeeper. Holder of Opinions. Automator of things that should be automated. Manual doer of things that should be done by hand. Reforming Consultant.\n\n","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/adamgoucher"},{"Icon":"webpage","Url":"http://adam.goucher.ca"}],"Sessions":[{"Id":"continuous-delivery-in-a-net-world","Title":"Continuous Delivery in a .NET world","Abstract":"","Level":"Level: Intermediate"},{"Id":"confessions-of-a-rookie-delivery-manager","Title":"Confessions Of A Rookie [Delivery] Manager","Abstract":"","Level":"Level: Intermediate"}],"Company":"360incentives","Tags":["Dev Ops","Test",".NET"]},{"Id":"alan-richardson","Name":"Alan Richardson","Bio":"Alan Richardson has more than twenty years of professional IT experience, working as a programmer and at every level of the testing hierarchy from tester through head of testing. Author of the books Selenium Simplified and Java For Testers, Alan also has created online training courses to help people learn technical web testing and Selenium WebDriver with Java. Alan posts his writing and training videos on SeleniumSimplified.com, EvilTester.com, JavaForTesters.com, and CompendiumDev.co.uk.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/eviltester"},{"Icon":"webpage","Url":"http://www.compendiumdev.co.uk"}],"Sessions":[{"Id":"automation-abstractions--page-objects-and-beyond","Title":"Automation Abstractions - Page Objects and Beyond","Abstract":"","Level":"Level: Intermediate"},{"Id":"confessions-of-an-accidental-security-tester--i-didnt-break-in-you-left-the-door-open","Title":"Confessions of an accidental Security Tester - \"I didn't break in, you left the door open\"","Abstract":"","Level":"Level: Intermediate"}],"Company":"Compendium Developments","Tags":["Test","Web"]},{"Id":"alasdair-allan","Name":"Alasdair Allan","Bio":"Alasdair Allan is a Scientist, Author, Hacker and Tinkerer. He is the author of a number of books, and a contributing editor for MAKE magazine. Last year he rolled out a mesh network of five hundred sensor motes which covered Moscone West during Google I/O. Before that he caused a privacy scandal by uncovering that your iPhone was recording your location, which caused several class action lawsuits and a U.S. Senate hearing. Several years on, he still isn't sure what to think about that.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/aallan"},{"Icon":"webpage","Url":"http://alasdairallan.com/"}],"Sessions":[{"Id":"open-source-protocols-and-architectures-to-fix-the-internet-of-things","Title":"Open source protocols and architectures to fix the Internet of Things","Abstract":"","Level":"Level: Intermediate"},{"Id":"the-inevitability-of-smart-dust","Title":"The inevitability of Smart Dust","Abstract":"","Level":"Level: Intermediate"}],"Company":"The Thing System","Tags":["Architecture","Internet of Things"]},{"Id":"anders-lowenborg","Name":"Anders Löwenborg","Bio":"Anders is a father of three, a sailor and an information junkie. He is a developer turned entrepreneur or vice versa depending on the viewers angle. Anders truly believes that trust and passion will take you all the way and can't understand the concept of not mixing business and pleasure.\n\nHe has started companies in Stockholm, New Dehli and Malta and if he were to adopt the agile manifesto to a business manifesto it would probably be something like this:\n\nTrust in people over ... Everything!","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/anderslowenborg"}],"Sessions":[{"Id":"trust--the-essence-of-agile","Title":"Trust - the essence of Agile","Abstract":"","Level":"Level: Intermediate"}],"Company":"Aptitud","Tags":["trust","team","collaborate"]},{"Id":"andrea-zuill","Name":"Andrea Zuill","Bio":"Andrea is a fine artist, as well as a children's book author and illustrator.  She has been drawing and painting for over 30 years. Her work is exhibited in galleries in California, Texas, and New York. She loves to create playful and fun artwork. She has illustrated educational materials and is the author and illustrator of a children's book being published in 2016 by Schwartz and Wade, an imprint of Random House.  Represented by Hen & Ink, A Literary Studio.\n","Links":[{"Icon":"webpage","Url":"http://zuill.us/andreablog/"}],"Sessions":[{"Id":"drawing-without-fear--give-yourself-permission-to-create","Title":"Drawing Without Fear - Give Yourself Permission to Create","Abstract":"","Level":"Level: Basic"}],"Company":"Andrea Zuill, Author and Illustrator","Tags":["Tools"]},{"Id":"andreas-hallberg","Name":"Andreas Hallberg","Bio":"Andreas Hallberg is a Security Software Engineer at TrueSec. When properly warmed up, Andreas can talk at length about secure development, Microsoft Windows, reverse engineering and, on rare occasions, practical applications of cryptography. He happily participates in large security-critical development projects and software security reviews. ","Links":[{"Icon":"webpage","Url":"http://www.truesec.se"}],"Sessions":[],"Company":"TrueSec","Tags":null},{"Id":"angela-harms","Name":"Angela Harms","Bio":"Angela Harms is an agile developer, coach, facilitator, and instigator. She loves beautiful code that emerges from collaboration, and learning new ways to make it work. When she’s not pairing on tests and the code they inspire, you can find her at conferences speaking about what she’s learned (so far), facilitating kick-ass retrospectives, or discussing the intersection of software and love in open space.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/angelaharms"},{"Icon":"webpage","Url":"http://maitria.com"}],"Sessions":[{"Id":"witness-tdd-with-real-live-refactoring-maniacs","Title":"Witness TDD with real, live REFACTORING MANIACS","Abstract":"","Level":"Level: Advanced"},{"Id":"careful-with-those-people-skills-youll-poke-somebodys-eye-out","Title":"Careful with those People Skills: You'll Poke Somebody's Eye Out!","Abstract":"","Level":"Level: Intermediate"}],"Company":"Maitria.com","Tags":["Tools","Team"]},{"Id":"angelina-fabbro","Name":"Angelina Fabbro","Bio":"Angelina Fabbro is a long time web developer on the Developer Tools team at Mozilla.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/hopefulcyborg"},{"Icon":"webpage","Url":"http://angelina.codes"}],"Sessions":[{"Id":"web-components-drunk-on-the-panacea","Title":"Web Components: Drunk on the Panacea","Abstract":"","Level":"Level: Intermediate"}],"Company":"Mozilla","Tags":["Web"]},{"Id":"ben-hall","Name":"Ben Hall","Bio":"Performed the rounds as a tester, developer, speaker, freelancer & startup entrepreneur. Currently working on the next venture.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/ben_hall"},{"Icon":"webpage","Url":"http://blog.benhall.me.uk"}],"Sessions":[{"Id":"real-world-lessons-on-the-anti-patterns-of-node-js-applications","Title":"Real World Lessons on the Anti-Patterns of Node.js Applications","Abstract":"","Level":"Level: Advanced"},{"Id":"what-developers-need-to-know-about-design","Title":"What Developers Need To Know About Design","Abstract":"","Level":"Level: Advanced"}],"Company":"Ocelot Uproar","Tags":["Javascript","Web","UX"]},{"Id":"ben-kelly","Name":"Ben Kelly","Bio":"Ben has been in the software testing industry for over a decade and is a regular speaker at conferences worldwide. He is currently based in London, but has spent time in various industries and companies in Australia and Japan. He works for eBay and is involved in both Agile testing and software testing workshops. He writes sporadically at http://testjutsu.com and is on twitter @benjaminkelly","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/benjaminkelly"},{"Icon":"webpage","Url":"http://testjutsu.com"}],"Sessions":[{"Id":"what-do-you-mean-agile-tester","Title":"What do you mean \"Agile Tester\"?","Abstract":"","Level":"Level: Intermediate"},{"Id":"waiter-theres-test-in-my-dev","Title":"Waiter, there's test in my dev","Abstract":"","Level":"Level: Intermediate"}],"Company":"eBay","Tags":["Test","Agile"]},{"Id":"bjorn-antonsson","Name":"Björn Antonsson","Bio":"Björn is a passionate software engineer whose experience ranges from the lowest levels of hardware memory models right through the operating system and the JVM as a founder and long time developer of JRockit, and straight up into high volume financial data systems and large traffic website. He is currently working in the team that is building the Akka toolkit, that powers many reactive systems.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/bantonsson"}],"Sessions":[{"Id":"reactive-streaming-restful-applications-with-akka-http","Title":"Reactive Streaming RESTful Applications with Akka HTTP","Abstract":"","Level":"Level: Intermediate"}],"Company":"Typesafe","Tags":["Architecture","Tools"]},{"Id":"bjorn-granvik","Name":"Björn Granvik","Bio":"Björn Granvik has more than two decades of experience as a developer, architect, project leader and manager to mention just a few roles. \n\nBorn in Pascal, fostered in C/C++ and reborn in Java, he still believes that \"code matters\" - second only to people and competence. \nBjörn is a recurring speaker and expert panel facilitator usually around subjects like programming and agile methodologies. \n\nHe can be found speaking in everything from user groups to conferences like JavaOne.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/bjorngranvik"},{"Icon":"webpage","Url":"bjorngranvik.wordpress.com"}],"Sessions":[{"Id":"how-to-predict-a-serial-arsonist--a-case-study-with-relationship-analysis-using-graph-based-data","Title":"How to predict a serial arsonist – a case study with relationship analysis using graph-based data","Abstract":"","Level":"Level: Basic"}],"Company":"Webstep","Tags":["X-Track","Database"]},{"Id":"brandon-jones","Name":"Brandon Jones","Bio":"Brandon currently runs the European technical field organization for WebSphere at IBM. Prior to helping clients optimize their enterprise IT outcomes he worked in development at Telelogic building tools to improve organizations ability to deliver software. He's worked on everything from real-time systems and protocols to high-scale enterprise banking and defense systems across the globe. He is also a huge fan of advancing the usage of software to solve today's challenges.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/randonjo"}],"Sessions":[{"Id":"crowd-developing-on-the-cloud-with-bluemix","Title":"Crowd-developing on the Cloud with Bluemix","Abstract":"","Level":"Level: Basic"}],"Company":"IBM","Tags":["Cloud"]},{"Id":"brian-christian","Name":"Brian Christian","Bio":"Brian Christian is the author of The Most Human Human, which was named a Wall Street Journal bestseller and a New Yorker favorite book of 2011, and has been translated into ten languages.\n\nHis writing has appeared in The New Yorker, The Atlantic, Wired, The Wall Street Journal, The Guardian, The Paris Review, and in scientific journals such as Cognitive Science. Christian has been featured on The Charlie Rose Show and The Daily Show with Jon Stewart and has lectured at Google, Microsoft, the Santa Fe Institute, and the London School of Economics. His work has won several awards, including fellowships at Yaddo and the MacDowell Colony, publication in Best American Science & Nature Writing, and an award from the Academy of American Poets.\n\nBorn in Wilmington, Delaware, Christian holds degrees in philosophy, computer science, and poetry from Brown University and the University of Washington. He lives in San Francisco.","Links":[{"Icon":"webpage","Url":"http://brchristian.com"}],"Sessions":[{"Id":"the-most-human-human","Title":"The most Human Human","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Keynote"]},{"Id":"caitie-mccaffrey","Name":"Caitie McCaffrey","Bio":"Caitie McCaffrey is a Backend Brat, Distributed Systems Diva, and Tech Lover.  She is currently a Software Engineer at HBO, and prior to that worked at 343 Industries.  Her focus is on Web Services, Distributed Systems, and Big Data.  She is passionate about creating fun, social, and collaborative entertainment experiences.  \n\nCaitie has a degree in Computer Science from Cornell University, and has worked on several video games including Gears of War 2, Gears of War 3, and most recently Halo 4.  She currently is working at HBO on the HBO Go services.  She maintains a blog at CaitieM.com and frequently discusses technology and entertainment on Twitter @CaitieM20","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/caitiem20"},{"Icon":"webpage","Url":"http://caitiem.com/"}],"Sessions":[{"Id":"building-the-halo-4-services-with-orleans","Title":"Building the Halo 4 Services with Orleans","Abstract":"","Level":"Level: Intermediate"},{"Id":"project-orleans","Title":"Project Orleans","Abstract":"","Level":"Level: Intermediate"}],"Company":"HBO","Tags":["Architecture","Cloud","Mastery",".NET"]},{"Id":"cate-huston","Name":"Cate Huston","Bio":"Cate escaped from graduate school to be a Software Engineer at Google, where she's focused on a variety of mobile experiences over the last 3 years including GMail, Google Docs, Maps and now Ads. She used to be an international hobo, teaching programming in the US and in Shanghai, training in martial arts in China, qualifying as a ski instructor in Canada, and aimlessly wandering around Europe. After nearly 7 years as an expat, she's now readjusting to life in London.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/catehstn"},{"Icon":"webpage","Url":"http://accidentallyincode.com"}],"Sessions":[{"Id":"distractedly-intimate--your-users-on-mobile","Title":"Distractedly Intimate - Your Users on Mobile","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Mobile","UX"]},{"Id":"charlie-marcus","Name":"Charlie Marcus","Bio":"Charlie Marcus is the Villum Kann Rasmussen Professor at the Niels Bohr Institute and Center Director of QDev. Before coming to Copenhagen in 2011, he also taught Physics at Stanford University (92-99) and Harvard University (00-10). His research interests include neural networks, quantum chaos, mesoscopic physics, fractional quantum Hall systems, quantum information, spin qubits and topological quantum states in condensed matter. ","Links":[],"Sessions":[{"Id":"quantum-computing-wip-","Title":"Quantum Computing (WIP)","Abstract":"","Level":"Level: Intermediate"}],"Company":"University of Copenhagen","Tags":["Quantum","Future"]},{"Id":"chiu-ki-chan","Name":"Chiu-Ki Chan","Bio":"Chiu-Ki is a mobile developer with a passion in speaking and teaching. Her mother tongue for mobile is Android, acquired while working on Android Maps at Google. Now she runs her own mobile development company, producing delightful apps such as \"Monkey Write\" for learning Chinese writing and \"Heart Collage\" for snapping photos to stitch into a heart.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/chiuki"},{"Icon":"webpage","Url":"http://blog.sqisland.com"}],"Sessions":[{"Id":"advanced-android-textview","Title":"Advanced Android TextView","Abstract":"","Level":"Level: Advanced"},{"Id":"fun-with-android-shaders-and-filters","Title":"Fun with Android Shaders and Filters","Abstract":"","Level":"Level: Advanced"}],"Company":"Square Island LLC","Tags":["Mobile"]},{"Id":"chris-chedgey","Name":"Chris Chedgey","Bio":"Chris cut his development teeth on monster military and aerospace projects in Europe and Canada (including 5 years on the International Space Station program). Smart developers cutting clean code is a given ingredient for success. But he noticed another factor that made all the difference.  Without an organised codebase, teams drowned in a sea of complexity. For over 10 years since he has developed and promoted techniques and technology to transform tangled codebases into beautiful architectures.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/chedgey"},{"Icon":"webpage","Url":"http://structure101.com"}],"Sessions":[{"Id":"you-really-should-organise-that-codebase-no-really","Title":"You really should organise that codebase. No, really!","Abstract":"","Level":"Level: Advanced"}],"Company":"Structure101","Tags":["Architecture","Cloud","Database","Dev Ops","Java","Methodology"]},{"Id":"chris-noessel","Name":"Chris Noessel","Bio":"In his day job as a Design Fellow at Cooper, Christopher designs products, services, and strategy for a variety of domains, including health, financial, and consumer. His spidey sense goes off about random topics, leading him to speak about a range of things including interactive narrative, ethnographic user research, interaction design, sex-related interactive technologies, randomness in semiotics, free-range learning, and, most recently, the relationship between sci-fi and interface design in the book Make It So: Interaction Design Lessons from Science Fiction.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/chrisnoessel"},{"Icon":"webpage","Url":"http://www.scifiinterfaces.com/"}],"Sessions":[{"Id":"make-it-so-sexy-","Title":"Make It So (Sexy)","Abstract":"","Level":"Level: Intermediate"},{"Id":"deconstructing-her","Title":"Deconstructing HER","Abstract":"","Level":"Level: Intermediate"}],"Company":"Cooper","Tags":["UX","Keynote"]},{"Id":"christian-heilmann","Name":"Christian Heilmann","Bio":"Chris Heilmann has dedicated a lot of his time making the web better. Originally coming from a radio journalism background, he built his first web site from scratch around 1997 and spent the following years working on lots of large, international web sites. He then spent a few years in Yahoo building products and explaining and training people and is now at Mozilla. Chris wrote and contributed to six books on web development and wrote many articles and hundreds of blog posts.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/codepo8"},{"Icon":"webpage","Url":"http://christianheilmann.com"}],"Sessions":[{"Id":"a-cold-hard-look-at-the-world-of-mobile-apps-and-where-they-may-go","Title":"A cold hard look at the world of Mobile Apps and where they may go","Abstract":"","Level":"Level: Basic"},{"Id":"yes-browsers-can-do-that--dont-be-shy-and-use-it","Title":"Yes, browsers can do that - don't be shy and use it","Abstract":"","Level":"Level: Basic"}],"Company":"Mozilla","Tags":["Mobile","Web"]},{"Id":"clemens-vasters","Name":"Clemens Vasters","Bio":"Clemens Vasters (@clemensv on Twitter) holds a Product Architect position in the Azure Engineering Group at Microsoft Corporation in Redmond, WA. In his role, he drives technical strategy around Microsoft’s cloud and on-premises messaging middleware platform „Service Bus“.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/clemensv"},{"Icon":"webpage","Url":"http://azure.com"}],"Sessions":[{"Id":"telemetry-and-data-flow-at-hyper-scale-azure-event-hub","Title":"Telemetry and Data Flow at Hyper-Scale: Azure Event Hub","Abstract":"","Level":"Level: Intermediate"}],"Company":"Microsoft Corporation","Tags":["Architecture","Cloud","IoT"]},{"Id":"dag-konig","Name":"Dag König","Bio":"I am a developer that have been writing code since 1986. Since 2006, I have been working for Microsoft Sweden as a technical evangelist. I still like to learn new stuff, and I feel that I still is a beginner in many ways. Today I Work mainly with Windows Azure and Open Source.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/buzzfrog"},{"Icon":"webpage","Url":"http://www.buzzfrog.se"}],"Sessions":[{"Id":"cloud-pattern","Title":"Cloud Pattern","Abstract":"","Level":"Level: Intermediate"}],"Company":"Microsoft","Tags":["Architecture","Cloud"]},{"Id":"dan-north","Name":"Dan North","Bio":"Dan North uses his deep technical and organisational knowledge to help CIOs, business and software teams to deliver quickly and successfully. He puts people first and finds simple, pragmatic solutions to business and technical problems, often using lean and agile techniques. With over twenty years of experience in IT, Dan is a frequent speaker at technology conferences worldwide. The originator of Behaviour-Driven Development (BDD) and Deliberate Discovery, Dan has published feature articles in numerous software and business publications, and contributed to The RSpec Book: Behaviour Driven Development with RSpec, Cucumber, and Friends and 97 Things Every Programmer Should Know: Collective Wisdom from the Experts. He occasionally blogs at http://dannorth.net/blog.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/tastapod"},{"Icon":"webpage","Url":"http://dannorth.net"}],"Sessions":[{"Id":"deliberate-advice-from-an-accidental-career","Title":"Deliberate Advice from an Accidental Career","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Keynote"]},{"Id":"danielle-sucher","Name":"Danielle Sucher","Bio":"Danielle Sucher loves to spend her free time contributing patches to open source projects in languages she doesn't even know. When she was a kid, Danielle wanted to grow up to live in a library in a lighthouse and spend all her time learning and solving puzzles and creating things. Except for the lighthouse (so far), that's pretty much what her grown-up life has become. She loves digging into the guts of software and building tools and toys, because it's way easier than sitting still.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/DanielleSucher"},{"Icon":"webpage","Url":"http://daniellesucher.com"}],"Sessions":[{"Id":"dont-take-it-for-granted-how-would-we-code-if-programming-was-worse-in-various-ways","Title":"Don't Take It For Granted: How would we code if programming was worse in various ways?","Abstract":"","Level":"Level: Intermediate"},{"Id":"debugging-the-science-of-deduction","Title":"Debugging: The Science of Deduction","Abstract":"","Level":"Level: Intermediate"}],"Company":"Stripe","Tags":["Mastery","Tools"]},{"Id":"david-montag","Name":"David Montag","Bio":"David Montag has been passionate about software ever since he was given his first Amiga 500 (with the RAM upgrade) at age seven. Now, many years later, he heads up pre-sales for Neo Technology, commercial backer of Neo4j, the most widely deployed graph database in the world.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/dmontag"},{"Icon":"webpage","Url":"http://www.neo4j.com"}],"Sessions":[{"Id":"neo4j--how-to-work-with-a-graph-database","Title":"Neo4j - How to work with a graph database","Abstract":"","Level":"Level: Basic"}],"Company":"Neo Technology","Tags":["Database"]},{"Id":"donna-malayeri","Name":"Donna Malayeri","Bio":"Donna Malayeri is a program manager on the Azure Mobile Services team. She previously worked on Reactive Extensions (Rx) and Visual F#. Before joining Microsoft, she was a member of the Scala team, working on projects such as the Scala Eclipse plugin. She holds a PhD in computer science from Carnegie Mellon University, where her focus was type systems for improving code reusability. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/lindydonna"},{"Icon":"webpage","Url":"http://channel9.msdn.com/events/speakers/Donna-Malayeri"}],"Sessions":[],"Company":"Microsoft","Tags":null},{"Id":"doug-sillars","Name":"Doug Sillars","Bio":"Doug Sillars, Ph.D., is an industry leader in mobile application performance, and is a member of the AT&T Developer Advocacy team. He and his team of outreach engineers work with mobile developers to help make mobile apps that are more efficient, faster, and use less battery. A veteran of many mobile projects over the last 10 years, Doug received his PhD in Inorganic Chemistry from the University of Wisconsin-Madison.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/dougsillars"},{"Icon":"webpage","Url":"http://developer.att.com"}],"Sessions":[{"Id":"testing-your-mobile-app-for-real-world-network-conditions","Title":"Testing Your Mobile App for Real-World Network Conditions","Abstract":"","Level":"Level: Intermediate"},{"Id":"what-makes-mobile-websites-tick-how-do-we-make-them-faster-insights-from-webpagetest-and-httparchive","Title":"What Makes Mobile Websites Tick? How Do We Make Them Faster? Insights from WebPagetest and HTTPArchive","Abstract":"","Level":"Level: Intermediate"}],"Company":"AT&T","Tags":null},{"Id":"emil-cardell","Name":"Emil Cardell","Bio":"Always looking for ways to find developer happiness, he looks outside the box and works actively to encourage developers to step out of their comfort zone to grow their love for creating amazing web applications. He is engaged in the developer community, speaking at conferences and contributing to multiple open source projects.\n\nEmil Cardell has been working on large public websites, communities and intranets for more than a decade, currently at Thomas Cook in Stockholm.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/emilcardell"},{"Icon":"webpage","Url":"http://unwillingcoder.tumblr.com/"}],"Sessions":[{"Id":"how-sons-of-anarchy-can-teach-your-organisation-to-be-more-effective","Title":"How Sons of Anarchy can teach your organisation to be more effective","Abstract":"","Level":"Level: Basic"},{"Id":"amazing-log-management-with-elasticsearch-and-kibana-in-net","Title":"Amazing log management with ElasticSearch and Kibana in .net","Abstract":"","Level":"Level: Basic"}],"Company":"Thomas Cook Northen Europe","Tags":["Agile","Team","Tools",".NET"]},{"Id":"emil-eifrem","Name":"Emil Eifrem","Bio":"Emil is the founder of Neo4j, the most widely deployed graph database on the planet, CEO of its commercial sponsor Neo Technology and a co-author of the O'Reilly book Graph Databases. He plans to save the world with graphs and own Larry's yacht by the end of the decade.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/emileifrem"},{"Icon":"webpage","Url":"www.neo4j.com"}],"Sessions":[{"Id":"personal-reflection-on-neo4js-journey-from-launch-at-oredev-2007-to-today","Title":"Personal Reflection on Neo4j's Journey from Launch at Öredev 2007 to Today","Abstract":"","Level":"Level: Basic"}],"Company":"Neo Technology","Tags":null},{"Id":"emil-kvarnhammar","Name":"Emil Kvarnhammar","Bio":"Emil is a Security Software Engineer at TrueSec, a leading-edge company in IT security and development. He's been involved in several security-critical projects, developing applications and components that are used by millions of users on a regular basis. His areas of interest include secure design patterns, secure communications, security in mobile platforms, cryptography and smart cards.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/emilkvarnhammar"},{"Icon":"webpage","Url":"https://www.truesec.se"}],"Sessions":[{"Id":"security-for-developers","Title":"Security for developers","Abstract":"","Level":"Level: Intermediate"}],"Company":"TrueSec","Tags":["Architecture","Security"]},{"Id":"eva-ljungkvist","Name":"Eva Ljungkvist","Bio":"Eva Ljungkvist has more than two decades of experience as a fire protection engineer, arson investigator and Senior Fire Officer at Swedish Fire Service. She has assignments for several Fire Services and for the Police. Over the years Eva has responded to many fires set by arsonists. One of them was Sweden's worst serial arsonist. Eva is a recurring speaker and exercise leader both in Sweden and internationally - and a writer with many reports, articles and blogs.","Links":[{"Icon":"webpage","Url":"http://evasbrandblogg.se/author/evalju/"}],"Sessions":[{"Id":"how-to-predict-a-serial-arsonist--a-case-study-with-relationship-analysis-using-graph-based-data","Title":"How to predict a serial arsonist – a case study with relationship analysis using graph-based data","Abstract":"","Level":"Level: Basic"}],"Company":"Oceanus","Tags":["X-Track"]},{"Id":"evan-czaplicki","Name":"Evan Czaplicki","Bio":"I am a functional programmer at heart, and my broad goal is to provide the tools and learning resources to make functional languages common in industry. At Prezi, my focus is developing Elm’s compiler, tools, and community to make it a great for web programming, both within Prezi and in industry in general.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/czaplic"},{"Icon":"webpage","Url":"http://elm-lang.org"}],"Sessions":[],"Company":"Prezi","Tags":null},{"Id":"fabio-viggiani","Name":"Fabio Viggiani","Bio":"Fabio Viggiani is a leading web application and penetration testing expert at the security power house TrueSec. Fabio has a broad experience from penetration tests of banks, agencies and all sorts of enterprise customers around the globe.\nFabio has a unique capability when it comes to getting an overview of an entire target environment and identify its vulnerabilities down to every detail. ","Links":[{"Icon":"webpage","Url":"http://www.truesec.se"}],"Sessions":[],"Company":"TrueSec AB","Tags":null},{"Id":"fred-george","Name":"Fred George","Bio":"Fred George is a developer and co­founder at Outpace Systems, and has been writing code for over 45 years in (by his count) over 70 languages. He has worked in the US, India, China, and the UK. An early adopter of OO and Agile, Fred continues to impact the industry with his leading ­edge ideas, most recently advocating Micro­Service Architectures and flat team structures (under the moniker of Programmer Anarchy). Oh, and he still writes code!","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/fgeorge52"},{"Icon":"webpage","Url":"http://outpace.com"}],"Sessions":[{"Id":"microservices-lessons-from-3-companies","Title":"MicroServices: Lessons from 3 Companies","Abstract":"","Level":"Level: Intermediate"},{"Id":"enabling-emergent-technologies","Title":"Enabling Emergent Technologies","Abstract":"","Level":"Level: Basic"}],"Company":"Outpace Systems","Tags":["Architecture","Cloud","Mastery","Agile","Javascript","Languages"]},{"Id":"fredrik-mork","Name":"Fredrik Mörk","Bio":"Fredrik works as a software development consultant for Webstep in Sweden. His assignments often contain a mix of being a developer, an architect and a mentor. He often works through all of the stack from the user experience down to the backend. He is also passionate about sharing his knowledge within as well as outside of his team and has spoken at both internal and external conferences.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/fmork"},{"Icon":"webpage","Url":"http://about.me/fmork"}],"Sessions":[{"Id":"api--the-hidden-ui","Title":"API - The hidden UI","Abstract":"","Level":"Level: Basic"}],"Company":"Webstep","Tags":null},{"Id":"fredrika-gullfot","Name":"Fredrika Gullfot","Bio":"Fredrika Gullfot is passionate about bio-based solutions as key technologies for a sustainable future. She is the CEO and founder of Simris Alg, a pioneering agribusiness growing algae in Southern Sweden. Fredrika holds a PhD in Biotechnology from the Royal Institute of Technology, and is the first female awarded with the Swedish Chemical Engineering Prize. Her professional history spans over a variety of industries, including investment banking, national security, entertainment and telecom.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/gullfot"},{"Icon":"webpage","Url":"http://www.simrisalg.se"}],"Sessions":[{"Id":"the-story-of-simris-how-we-wanted-to-fuel-the-world-and-ended-up-saving-the-oceans","Title":"The story of Simris: How we wanted to fuel the world and ended up saving the oceans","Abstract":"","Level":"Level: Basic"}],"Company":"Simris Alg","Tags":["X-Track"]},{"Id":"gary-bernhardt","Name":"Gary Bernhardt","Bio":"Gary Bernhardt is a creator and destroyer of software compelled to understand both sides of heated software debates: Vim and Emacs; Python and Ruby; Git and Mercurial. He runs Destroy All Software, which publishes advanced screencasts for serious developers covering Unix, OO design, TDD, and dynamic languages.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/garybernhardt"},{"Icon":"webpage","Url":"http://destroyallsoftware.com"}],"Sessions":[{"Id":"turning-the-design-clock-back","Title":"Turning The Design Clock Back","Abstract":"","Level":"Level: Basic"}],"Company":"Destroy All Software LLC","Tags":["Keynote"]},{"Id":"gitte-klitgaard","Name":"Gitte Klitgaard","Bio":"Gitte Klitgaard is an Agile Coach, Pirate, Dragon Lady, Hugger, friend, and much more. She is agile; live it and love it. She has taken the oath of non-allegiance. Gitte has more than 10 years experience in different aspects of software development and is currently working with Agile and people. She wants to change the world by helping people in their work life. She is a geek and very passionate about a lot of stuff :)","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/nativewired"}],"Sessions":[{"Id":"retrospectives-are-boring-and-useless--or-are-they","Title":"Retrospectives are boring and useless – or are they?","Abstract":"","Level":"Level: Intermediate"},{"Id":"be-brave-and-vulnerable","Title":"Be brave and vulnerable","Abstract":"","Level":"Level: Intermediate"}],"Company":"Native Wired","Tags":["Agile","Team","Tools"]},{"Id":"glenn-block","Name":"Glenn Block","Bio":"Glenn is a product manager for Splunk’s developer experience. In his spare time he is also the author and a maintainer of scriptcs, an OSS tool for C# scripting. A hardcore coder professionally for almost 20 years, he cares deeply about making developers’ lives easier.\n\nPreviously Glenn worked at Microsoft where he kickstarted ASP.NET Web API and spearheaded Microsoft’s node.js story on Azure. Glenn is an active contributor to Node.js and .NET OSS projects, a supporter of the community, and a frequent speaker internationally on software development.\n\nHe is also a bit of a Web API fanatic and author of a new OReilly book on the subject. He lives with his wife and daughter in Seattle where rain and caffeine are a plenty.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/gblock"},{"Icon":"webpage","Url":"http://blogs.splunk.com/author/gblock"}],"Sessions":[{"Id":"using-scriptcs-as-part-of-your-api-development-workflow","Title":"Using scriptcs as part of your API development workflow","Abstract":"","Level":"Level: Advanced"},{"Id":"splunk-a-smorgasbord-for-developing-big-data-solutions","Title":"Splunk, a smorgasbord for developing big data solutions","Abstract":"","Level":"Level: Intermediate"}],"Company":"Splunk","Tags":["Languages","Tools","Web",".NET","Cloud","Dev Ops","IoT","Javascript","Mobile"]},{"Id":"hadi-hariri","Name":"Hadi Hariri","Bio":"I’m a Software Developer, currently working at JetBrains. My passions include Web Development and Software Architecture. I’ve written a few books and have been speaking at conferences for over a decade, on things I’m passionate about.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/hhariri"}],"Sessions":[{"Id":"refactoring-to-functional","Title":"Refactoring to Functional","Abstract":"","Level":"Level: Basic"}],"Company":"JetBrains","Tags":["Architecture"]},{"Id":"hakan-jonson","Name":"Håkan Jonson","Bio":"Håkan Jonson is a software consultant at Citerus and works primarily with agile design and development. With experience from the financial and gaming industry Håkan is a strong proponent of domain driven design. Over the last 8 years he has been working with the Java platform specializing in high availability transaction systems and is currently involved in several projects which aims to leverage some of the benefits of the latest years emerging cloud platforms.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/hakanjonson"},{"Icon":"webpage","Url":"http://www.citerus.se"}],"Sessions":[],"Company":"Citerus","Tags":null},{"Id":"hannes-gruber","Name":"Hannes Gruber","Bio":"Hannes is a Jayway android consultant with a big interest in beer. But not just drinking it. Homebrewing beer has been his major hobby since 2010 and his brews has won a fair share of medals at the Swedish homebrewing championships and other homebrewing competitions.","Links":[{"Icon":"webpage","Url":"http://nerdbrewing.wordpress.com"}],"Sessions":[{"Id":"homebrewing-beer","Title":"Homebrewing beer","Abstract":"","Level":"Level: Basic"}],"Company":"Jayway","Tags":null},{"Id":"hannes-sjoblad","Name":"Hannes Sjöblad","Bio":"* Ambassador for Singularity University in Sweden (singularityu.org)\n* Founder of the Swedish biohackercommunity BioNyfiken (bionyfiken.se)\n* Chairman of Människa+, the Swedish transhumanist association (manniskaplus.nu)\n* Distinguished international business career across media, finance and agribusiness in the UK, Russia and the Nordics\n* MSc in Business and Economics from the Stockholm School of Economics (2003)","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/hsjob"},{"Icon":"webpage","Url":"http://singularityu.org"}],"Sessions":[{"Id":"exponential-technological-development-and-the-singularity","Title":"Exponential technological development and the Singularity","Abstract":"","Level":"Level: Intermediate"},{"Id":"biohacking-and-bodyhacking","Title":"Biohacking and bodyhacking","Abstract":"","Level":"Level: Basic"}],"Company":"Singularity University","Tags":["X-Track"]},{"Id":"hardy-ferentschik","Name":"Hardy Ferentschik","Bio":"Hardy Ferentschik is Senior Developer at JBoss and member of the Hibernate development team. He is the project lead of Hibernate Validator, core developer for Hibernate ORM and Search and Bean Validation expert group member. Hardy is a frequent speaker at JUGs and leading software development conferences.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/fere0010"},{"Icon":"webpage","Url":"http://in.relation.to/Bloggers/Hardy"}],"Sessions":[{"Id":"using-the-right-tools-to-get-back-into-the-drivers-seat-of-your-jvm","Title":"Using the right tools to get back into the driver's seat of your JVM","Abstract":"","Level":"Level: Intermediate"}],"Company":"Red Hat","Tags":["Java","Tools"]},{"Id":"helen-sharp","Name":"Helen Sharp","Bio":"Helen Sharp is Professor of Software Engineering at the Open University, UK. Her research focuses on the study of professional software practice, specifically human and social aspects of software development. She is very active in both the software engineering and interaction design (HCI) communities, and has had a long association with practitioner-related conferences. She is on the Board of IEEE Software, and Transactions of Software Engineering, and reviews for many journals and conferences. ","Links":[{"Icon":"webpage","Url":"http://mcs.open.ac.uk/hcs2"}],"Sessions":[{"Id":"your-agile-challenges","Title":"Your Agile challenges","Abstract":"","Level":"Level: Intermediate"},{"Id":"ux-design-in-an-agile-world-challenges-and-mitigations","Title":"UX Design in an Agile world: challenges and mitigations","Abstract":"","Level":"Level: Intermediate"}],"Company":"The Open University","Tags":["Agile","UX"]},{"Id":"helena-kubicek-boye","Name":"Helena Kubicek Boye","Bio":"lic psychologist, CBT-therapeut, priced Newthinker 2010, nominated Psychology Awards 2010, author, projectleader in a research study on inosomnia treatment, content provider \"Sov Bättre\" e-learning for internetbased insomnia ","Links":[{"Icon":"webpage","Url":"http://www.psykologic.se"}],"Sessions":[{"Id":"stress-and-insomnia--the-increasing-public-health-diseases","Title":"Stress and insomnia - the increasing Public Health Diseases","Abstract":"","Level":"Level: Basic"},{"Id":"cope-with-changes-in-everyday-life","Title":"Cope with changes in everyday life","Abstract":"","Level":"Level: Basic"}],"Company":"Psykologic","Tags":["X-Track"]},{"Id":"henrik-stahl","Name":"Henrik Ståhl","Bio":"Henrik Stahl is VP of Product Management for Java and Internet of Things for Oracle, responsible for product vision and strategy for these areas. He joined Oracle as part of the BEA Systems acquisition, where he served in a similar capacity for the JRockit family of products, which sums up to over 10 years working with JVM and Java strategy and development. During his time at Oracle, Henrik lead the effort getting the Exalogic engineered system out of the door, and for the past three years he has been driving Internet of Things strategy across Oracle focused on intelligent devices and value from business processes and data analytics. Mr. Stahl holds a Master of Science in Engineering Physics from the Royal Institute of Technology in Sweden. He lives with his family in Sweden and spends his spare time doing random sports, gardening and playing flamenco guitar.","Links":[{"Icon":"webpage","Url":"https://blogs.oracle.com/henrik/"}],"Sessions":[{"Id":"java-update-and-roadmap","Title":"Java update and roadmap","Abstract":"","Level":"Level: Basic"}],"Company":"Oracle","Tags":["Java"]},{"Id":"holly-cummins","Name":"Holly Cummins","Bio":"Holly Cummins is a senior software engineer developing enterprise middleware with the IBM WebSphere, and a committer on the Apache Aries project. She is a co-author of Enterprise OSGi in Action and has spoken at Devoxx, JavaZone, The ServerSide Java Symposium, JAX London, GeeCon, and the Great Indian Developer Summit, as well as a number of user groups.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/holly_cummins"},{"Icon":"webpage","Url":"http://hollycummins.blogspot.co.uk"}],"Sessions":[{"Id":"do-more-of-what-you-love-less-of-what-you-dont-love-with-cloud-foundry","Title":"Do more of what you love, less of what you don't love with Cloud Foundry","Abstract":"","Level":"Level: Basic"},{"Id":"the-wearable-application-server-and-other-adventures-in-software-engineering","Title":"The Wearable Application Server and Other Adventures in Software Engineering","Abstract":"","Level":"Level: Basic"}],"Company":"IBM","Tags":["Cloud","Dev Ops","Web","Mobile"]},{"Id":"honza-kral","Name":"Honza Kral","Bio":"Honza is a Python programmer and Django core developer – since he is scared of the bright and shiny world of browsers, designers, and users he prefers to stay buried deep in the infrastructure code and just provides others with tools to do the actual site-building.\n\nSince 2008 Honza has been building content web sites for fun and profit. During this time he discovered Elasticsearch which lead to him joining the company behind it in 2013 to work on the Python drivers.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/HonzaKral"},{"Icon":"webpage","Url":"http://www.elasticsearch.org/"}],"Sessions":[{"Id":"analyzing-and-searching-data-using-elasticsearch","Title":"Analyzing and searching data using Elasticsearch","Abstract":"","Level":"Level: Basic"}],"Company":"Elasticsearch","Tags":["Architecture","Database"]},{"Id":"ivar-grimstad","Name":"Ivar Grimstad","Bio":"Ivar Grimstad is an experienced software architect with a strong focus on Enterprise Java.\n\nHe has been working with Java since the beginning and has over the years tried out everything from lightweight mobile applications to large scale enterprise applications. His experience covers all aspects of designing architectures based on a variety of technologies including standard Java EE as well as more lightweight frameworks such as Spring and a variety of open source products.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/ivar_grimstad"},{"Icon":"webpage","Url":"http://www.agilejava.eu"}],"Sessions":[{"Id":"spring4-java-ee-7-or-both","Title":"Spring4, Java EE 7 or Both?","Abstract":"","Level":"Level: Intermediate"}],"Company":"Cybercom Sweden","Tags":["Java"]},{"Id":"jack-nutting","Name":"Jack Nutting","Bio":"Jack Nutting has been using Cocoa since the olden days (long before it was even called Cocoa) to develop software for a wide range of industries and applications, including gaming, graphic design, online digital distribution, telecommunications, finance, publishing, and travel. Jack has written several books on iOS and OS X development, and currently works as a consultant on various iOS and OS X projects.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jacknutting"},{"Icon":"webpage","Url":"http://nuthole.com"}],"Sessions":[{"Id":"the-lost-art-of-assembly-programming-unraveling-a-childhood-mystery","Title":"The Lost Art of Assembly Programming: Unraveling a Childhood Mystery","Abstract":"","Level":"Level: Intermediate"},{"Id":"swift-swiftly","Title":"Swift, swiftly","Abstract":"","Level":"Level: Intermediate"}],"Company":"thoughtbot","Tags":null},{"Id":"jakub-wieczorek","Name":"Jakub Wieczorek","Bio":"Jakub Wieczorek is an engineer at Neo Technology working on Neo4j, an open source graph database project, with a focus on its query language and making sure queries run fast.\n\nAside from databases, his areas of interest include distributed systems of all kinds, compilers and functional programming. He's also interested in the socio-economic impact of technology.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/JAW_dropping"},{"Icon":"webpage","Url":"http://jakub.cc"}],"Sessions":[{"Id":"rust-programming-language","Title":"Rust programming language","Abstract":"","Level":"Level: Intermediate"}],"Company":"Neo Technology","Tags":["Languages"]},{"Id":"james-bach","Name":"James Bach","Bio":"James Bach is the co-author of Lessons Learned in Software Testing and the author of Secrets of a Buccaneer-Scholar. He has been in testing for 25 years, teaches Rapid Software Testing methodology, and published his first heuristics of testability in 1995.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jamesmarcusbach"},{"Icon":"webpage","Url":"http://www.satisfice.com"}],"Sessions":[{"Id":"integrating-skilled-testing-with-agile-development","Title":"Integrating Skilled Testing with Agile Development","Abstract":"","Level":"Level: Intermediate"}],"Company":"Satisfice, Inc.","Tags":["Agile","Methodology","Test"]},{"Id":"james-mickens","Name":"James Mickens","Bio":"James Mickens is a researcher in the Distributed Systems group at Microsoft Research. Often described as The Hardest Working Man In Computer Science, his research spans genres, fields, and verb tenses. His seminal paper on byzantine fault tolerant proofreading has been mistakenly cited over 3000 times, and his 1987 paper “We Need More and Better Computers” provided the foundation for cloud computing, mobile computing, and any type of computing that benefits from more and/or better computers.","Links":[{"Icon":"webpage","Url":"http://research.microsoft.com/en-us/people/mickens/"}],"Sessions":[{"Id":"life-is-terrible-lets-talk-about-the-web","Title":"Life is Terrible: Let's Talk About the Web","Abstract":"","Level":"Level: Intermediate"}],"Company":"Microsoft Research","Tags":["Javascript","Web"]},{"Id":"james-turnbull","Name":"James Turnbull","Bio":"James Turnbull is the author of six technical books about open source software, including a book on Docker. James works for Docker as VP of Services and Support. He was previously at Puppet Labs running Operations and Professional Services. James speaks regularly at conferences including OSCON, Velocity, Linux.conf.au, FOSDEM and a number of others. He is a past president of Linux Australia, a former committee member of Linux Victoria, was Treasurer for LCA 2008, and serves on the program committee of LCA and OSCON.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/kartar"},{"Icon":"webpage","Url":"http://www.kartar.net"}],"Sessions":[{"Id":"introduction-to-docker-containerization-is-the-new-virtualization","Title":"Introduction to Docker: Containerization is the new Virtualization","Abstract":"","Level":"Level: Intermediate"}],"Company":"Docker","Tags":["Dev Ops","Tools"]},{"Id":"jan-erik-solem","Name":"Jan Erik Solem","Bio":"Computer vision guy, researcher and startuper, python enthusiast, author. Co-founder Mapillary, previous founder Polar Rose.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jesolem"},{"Icon":"webpage","Url":"http://mapillary.com"}],"Sessions":[{"Id":"starting-up-building-great-products-with-small-teams","Title":"Starting up: building great products with small teams","Abstract":"","Level":"Level: Basic"}],"Company":"Mapillary","Tags":null},{"Id":"jasper-potts","Name":"Jasper Potts","Bio":"Jasper Potts is a IoT & Client Architect at Oracle. Working on upcoming Oracle IoT products and responsible for making Java Client Cool. Formally a lead engineer on the JavaFX & Swing teams working on the new JavaFX UI Controls and Graphics frameworks. Also responsible for designing, developing and presenting demos during the keynotes at JavaOne and Devoxx. A JavaOne Rockstar presenter having presented many sessions on JavaFX and Swing at many conferences. Prior to Sun he founded Xerto a desktop applications company developing Imagery a Java professional photo management application.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jasperpotts"},{"Icon":"webpage","Url":"http://jasperpotts.com"}],"Sessions":[{"Id":"rapid-iot-ui-with-javafx-and-scenebuilder","Title":"Rapid IoT UI with JavaFX and SceneBuilder","Abstract":"","Level":"Level: Intermediate"},{"Id":"javafx-on-your-wall-in-your-car-or-on-a-plane","Title":"JavaFX on your wall, in your car, or on a plane!","Abstract":"","Level":"Level: Intermediate"}],"Company":"Oracle","Tags":["Java","UX"]},{"Id":"jeff-garzik","Name":"Jeff Garzik","Bio":"Jeff Garzik is a software engineer, blogger, futurist and entrepreneur. \n\nIn July 2010, while reading slashdot.org, Jeff stumbled across a post describing bitcoin. Immediately recognizing the potential of a concept previously thought impossible -- decentralized digital money -- Jeff did what came naturally: developed bitcoin open source software, and started micro-businesses with bitcoin at their foundation. Almost by accident, Jeff found himself square in the middle of the global, disruptive, amazing hurricane of a technological phenomenon known as bitcoin.\n\nJeff now works as a bitcoin core developer and open source evangelist at BitPay. Jeff is also the CEO of Dunvegan Space Systems and Sleepy Dragon Properties, both one-man micro-businesses. Dunvegan Space Systems is the manager of the BitSat project. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jgarzik"},{"Icon":"webpage","Url":"https://bitpay.com/"}],"Sessions":[{"Id":"bitcoin","Title":"Bitcoin","Abstract":"","Level":"Level: Basic"}],"Company":"BitPay","Tags":null},{"Id":"jeff-handley","Name":"Jeff Handley","Bio":"Jeff Handley works at Microsoft and is the Development Lead for NuGet. Jeff has been building and maturing software projects for over 15 years. Prior to working on NuGet, his largest projects covered education, healthcare waste management, fantasy football, credit/mortgage, and point of sale. Jeff loves that NuGet is an open-source project and is trying to enable more ecosystem growth around the project while improving the core product's features and reliability.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jeffhandley"},{"Icon":"webpage","Url":"http://jeffhandley.com"}],"Sessions":[{"Id":"nuget-3-0--transitioning-from-odata-to-json-ld","Title":"NuGet 3.0 – Transitioning from OData to JSON-LD","Abstract":"","Level":"Level: Basic"},{"Id":"evolving-the-nuget-org-architecture","Title":"Evolving the NuGet.org Architecture","Abstract":"","Level":"Level: Basic"}],"Company":"Microsoft","Tags":["Architecture","Tools",".NET","Cloud"]},{"Id":"jen-myers","Name":"Jen Myers","Bio":"Jen Myers is a web designer/developer, teacher and speaker in Chicago. In 2011, she founded the Columbus, Ohio chapter of Girl Develop It, an organization that provides introductory coding classes aimed at women, and currently works with Girl Develop It Chicago as a teacher and an advisor. She speaks regularly about design, development and diversity, and focuses on finding new ways to make both technology and technology education accessible to everyone.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/antiheroine"},{"Icon":"webpage","Url":"http://jenmyers.net"}],"Sessions":[{"Id":"teaching-our-css-to-play-nice","Title":"Teaching Our CSS To Play Nice","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Web"]},{"Id":"jens-hoffman","Name":"Jens Hoffman","Bio":"As a certified LEGO SERIOUS PLAY™ facilitator and certified Management Coach he works with managers from the executive to the department level in company and team transformation efforts and is a specialist in designing and facilitating large-scale interventions with LEGO SERIOUS PLAY™, World Café, Open Space, Real-Time Strategic Change and Future Conference.","Links":[],"Sessions":[{"Id":"lego-serious-play","Title":"Lego serious play","Abstract":"","Level":"Level: Intermediate"},{"Id":"lego-serious-play-continued","Title":"Lego serious play continued","Abstract":"","Level":"Level: Intermediate"}],"Company":"StrategicPlay","Tags":["Agile","Team"]},{"Id":"jimmy-bogard","Name":"Jimmy Bogard","Bio":"Jimmy is an active member in the .NET community, leading open source projects, giving technical presentations, and facilitating technical book clubs. Jimmy is a member of the ASPInsiders group, the C# Insiders group, and received the \"Microsoft Most Valuable Professional\" (MVP) award for ASP.NET in 2009-2013. Jimmy is also the creator and lead developer of the popular OSS library AutoMapper.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jbogard"},{"Icon":"webpage","Url":"http://jimmybogard.lostechies.com"}],"Sessions":[{"Id":"orms--youre-doing-it-wrong","Title":"ORMs - you're doing it wrong","Abstract":"","Level":"Level: Intermediate"},{"Id":"8-simple-tdd-rules","Title":"8 Simple TDD Rules","Abstract":"","Level":"Level: Intermediate"}],"Company":"Headspring","Tags":["Database","Test",".NET"]},{"Id":"jimmy-wilhelmsson","Name":"Jimmy Wilhelmsson","Bio":"Editor of Spelpappan.se - a retro blog that compares the present with the past. Author of \"Generation 64: Commodore 64 Made Me Who I Am\" - a coffee table book about the young Swedes who grew up with the Commodore 64 and laid the foundation of a successful IT and Gaming nation.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/spelpappan"},{"Icon":"webpage","Url":"http://www.spelpappan.se"}],"Sessions":[{"Id":"generation-64--the-shaping-of-a-successful-it-and-gaming-nation","Title":"Generation 64 - the Shaping of a Successful IT and Gaming Nation","Abstract":"","Level":"Level: Basic"}],"Company":"Spelpappan.se","Tags":null},{"Id":"joakim-sunden","Name":"Joakim Sundén","Bio":"Joakim is an Agile Coach at Spotify, making music available and accessible to the world. He helps people improve through mentoring and coaching at individual, team and organizational levels, often using Agile and Lean thinking and methods such as Kanban, Scrum and XP. He is an organizer of, and active participant in, conferences, networks and user groups in the Agile and Lean communities. Joakim is also the author of “Kanban in Action” (Manning, 2014).","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/joakimsunden"},{"Icon":"webpage","Url":"http://joakimsunden.com"}],"Sessions":[{"Id":"scaled-agile--spotify","Title":"Scaled Agile @ Spotify","Abstract":"","Level":"Level: Basic"}],"Company":"Spotify","Tags":["Agile","Team"]},{"Id":"joel-borggren-franck","Name":"Joel Borggrén-Franck","Bio":"Language hacker/compiler engineer working on Java 9 and 10 at the Java Platform Group, Oracle","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/joelbf"}],"Sessions":[{"Id":"writing-software-using-java-8","Title":"Writing software using Java 8","Abstract":"","Level":"Level: Basic"}],"Company":"Oracle","Tags":["Java"]},{"Id":"joel-hooks","Name":"Joel Hooks","Bio":"Joel is a front end web developer that enjoys tackling the problems of the enterprise. He's passionate about teaching and is a co-founder of egghead.io, a website devoted to delivering bite-sized developer training videos. When he's not enjoying JavaScript (at least the Good Parts), he's home educating his 4 children deep in the heart of Texas.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jhooks"},{"Icon":"webpage","Url":"http://joelhooks.com"}],"Sessions":[{"Id":"angularjs-bootcamp","Title":"AngularJS Bootcamp","Abstract":"","Level":"Level: Basic"}],"Company":"egghead.io","Tags":["Web"]},{"Id":"john-k-paul","Name":"John K. Paul","Bio":"John K. Paul is the VP of engineering at Penton Media and former lead technical architect of Condé Nast's platform engineering team.  He is a contributor to numerous open source projects including promethify, requireify, jquery-ajax-retry, and js-beautify.  He is also the organizer of the NYC HTML5 meetup group. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/johnkpaul"},{"Icon":"webpage","Url":"http://johnkpaul.com"}],"Sessions":[{"Id":"bridging-the-gap-of-the-module-wars","Title":"Bridging the Gap of the Module Wars","Abstract":"","Level":"Level: Advanced"},{"Id":"ember-components-make-my-heart-sing","Title":"Ember Components Make My Heart Sing","Abstract":"","Level":"Level: Basic"}],"Company":"Penton Media","Tags":["Architecture","Javascript","Web"]},{"Id":"john-sonmez","Name":"John Sonmez","Bio":"John Sonmez is the founder of Simple Programmer, where he pursues his vision of transforming complex issues into simple solutions. John has published over 50 courses on topics such as iOS, Android, .NET, Java, and game development for the online developer training resource, Pluralsight. John helps software engineers, programmers and other technical professionals boost their careers and live a more fulfilled life. He empowers them to accomplish their goals by making the complex simple.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/jsonmez"},{"Icon":"webpage","Url":"http://simpleprogrammer.com"}],"Sessions":[{"Id":"how-to-create-an-test-automation-framework-architecture-with-selenium","Title":"How To Create An Test Automation Framework Architecture With Selenium","Abstract":"","Level":"Level: Basic"},{"Id":"how-to-market-yourself-to-boost-your-career","Title":"How To Market Yourself To Boost Your Career","Abstract":"","Level":"Level: Basic"}],"Company":"Simple Programmer LLC","Tags":["Test","Tools","Mastery","Methodology"]},{"Id":"jon-brisbin","Name":"Jon Brisbin","Bio":"Jon is a Senior Software Engineer at Pivotal, where he leads the Reactor Project. Jon started his career with Sun and DEC workstations in an air-conditioned trailer in the deserts of Saudi Arabia as an Intelligence Analyst. From mainframes to AS/400's to UNIX and now in the cloud, Jon has helped to architect and develop next-generation libraries to assist developers in solving the big and fast data problems of today's agile businesses.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/j_brisbin"},{"Icon":"webpage","Url":"http://jbrisbin.com"}],"Sessions":[{"Id":"building-fast-data-applications-with-project-reactor","Title":"Building Fast Data Applications with Project Reactor","Abstract":"","Level":"Level: Intermediate"},{"Id":"reactive-programming--why-the-hype","Title":"Reactive Programming - Why the Hype?","Abstract":"","Level":"Level: Intermediate"}],"Company":"Pivotal","Tags":["Architecture"]},{"Id":"josh-long","Name":"Josh Long","Bio":"Josh Long is the Spring Developer Advocate for the Spring team at Pivotal. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O'Reilly \"Pro Spring Roo\" book, the Pearson \"Livelessons for Spring\" and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh's interests include big-data, mobile, REST, NoSQL and integration. He blogs on the Spring blog and [on his personal blog](http://joshlong.com).\n","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/starbuxman"},{"Icon":"webpage","Url":"http://spring.io/"}],"Sessions":[],"Company":"the Spring team at Pivotal","Tags":null},{"Id":"joshua-corman","Name":"Joshua Corman","Bio":"Joshua Corman is the CTO for Sonatype. Previously he served in strategy & executive roles at Akamai Technologies, The 451 Group, and IBM Internet Security Systems. He co-founded Rugged Software & IamTheCavalry to encourage new security approaches in response to the world’s increasing dependence on digital infrastructure. Josh's unique approach to security in the context of human factors, adversary motivations, and social impact has positioned him as one of the most trusted names in security.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/joshcorman"},{"Icon":"webpage","Url":"http://blog.cognitivedissidents.com/"}],"Sessions":[{"Id":"openseason-on-opensource-why-its-time-for-a-sw-supply-chain","Title":"OpenSeason on OpenSource? Why it's time for a SW Supply Chain","Abstract":"","Level":"Level: Intermediate"}],"Company":"Sonatype || I am The Cavalry","Tags":["Architecture","Security"]},{"Id":"juha-paananen","Name":"Juha Paananen","Bio":"Software craftsman since the late 90s. Ex-javasaur turned into cool FRP guru and Monad enthusiast. Author of the Bacon.js FRP library. Teaches programming to kids with varying success.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/raimohanska"},{"Icon":"webpage","Url":"https://github.com/raimohanska"}],"Sessions":[{"Id":"frp-in-javascript-with-bacon-js","Title":"FRP in JavaScript with Bacon.js","Abstract":"","Level":"Level: Intermediate"}],"Company":"reaktor.fi","Tags":["Architecture","Javascript","Web"]},{"Id":"justin-beckwith","Name":"Justin Beckwith","Bio":"Justin is a Program Manager, web developer, and geek dad working on tooling and the developer experience for Microsoft Azure.  He writes code, speaks at events, and stirs up trouble.  Before joining Microsoft, he filled various developer and architect roles with startups, healthcare companies, and universities.   He blogs at http://jbeckwith.com and twitters as @justinbeckwith.\n","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/JustinBeckwith"},{"Icon":"webpage","Url":"http://jbeckwith.com"}],"Sessions":[{"Id":"es6-getting-ready-for-javascript-vnext","Title":"ES6:  Getting ready for JavaScript vNext","Abstract":"","Level":"Level: Intermediate"},{"Id":"building-web-applications-with-asp-net-vnext","Title":"Building web applications with ASP.NET vNext","Abstract":"","Level":"Level: Intermediate"}],"Company":"Microsoft","Tags":["ES6","Javascript","Languages","Cloud","Web",".NET"]},{"Id":"karen-johnson","Name":"Karen Johnson","Bio":"Karen N. Johnson is a software test consultant. She is frequent speaker at conferences. Karen is a contributing author to the book, Beautiful Testing by O’Reilly publishers. She has published numerous articles and blogs about her experiences with software testing. She is the co-founder of the WREST workshop, more information on WREST can be found at: http://www.wrestworkshop.com/Home.html  Visit her website at: http://www.karennjohnson.com ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/karennjohnson"},{"Icon":"webpage","Url":"http://www.karennjohnson.com"}],"Sessions":[{"Id":"tester-love-developer","Title":"Tester Love Developer","Abstract":"","Level":"Level: Intermediate"},{"Id":"a-venn-diagram-of-ux-and-software-testing","Title":"A Venn Diagram of UX & Software Testing","Abstract":"","Level":"Level: Intermediate"}],"Company":"Software Test Management Inc.","Tags":["Agile","Test","UX"]},{"Id":"keavy-mcminn","Name":"Keavy McMinn","Bio":"Keavy works developing software at Github.\n\nAs an independent consultant, over the previous decade, she has enjoyed pairing up with some of the top development shops across Europe and the U.S.\n\nLike many of her fellow Irishmen, Keavy enjoys telling a good story. Unlike many, she trains for Ironman triathlons and is not a fan of whiskey. Cosmo, anyone?","Links":[],"Sessions":[{"Id":"getting-comfortable-being-uncomfortable","Title":"Getting comfortable being uncomfortable","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Keynote"]},{"Id":"kevin-grant","Name":"Kevin Grant","Bio":"KEVIN GRANT is an Android Engineer at tumblr, a creative blogging platform in New York City, where he focuses on application design, implementing the latest design and user interaction paradigms and pushing the boundaries of the Android framework. \n\nHe began developing for Android in 2009, performing research at the University of Nevada, Reno. After graduating he moved to Malmö, Sweden where he took part in the Scandinavian startup scene.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/kevingrant5"},{"Icon":"webpage","Url":"http://kevinthebigapple.tumblr.com"}],"Sessions":[{"Id":"advanced-animation-in-android","Title":"Advanced animation in Android","Abstract":"","Level":"Level: Intermediate"},{"Id":"wearable-apps-that-people-want","Title":"Wearable apps that people want","Abstract":"","Level":"Level: Basic"}],"Company":"Tumblr","Tags":null},{"Id":"kevin-moore","Name":"Kevin Moore","Bio":"Kevin is a Product Manager at Google working on the Dart language, libraries, and tools. Before joining Google, he was a contributor to the Dart project and a consultant specializing in open source web technologies.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/kevmoo"},{"Icon":"webpage","Url":"http://j832.com"}],"Sessions":[{"Id":"an-introduction-to-the-dart-language-libraries-and-tools","Title":"An Introduction to the Dart Language, Libraries, and Tools","Abstract":"","Level":"Level: Basic"},{"Id":"zero-to-a-beautiful-web-app-with-dart-and-polymer","Title":"Zero to a Beautiful Web App with Dart and Polymer","Abstract":"","Level":"Level: Basic"}],"Company":"Google","Tags":["Tools","Web","Javascript","Languages"]},{"Id":"kimberly-blessing","Name":"Kimberly Blessing","Bio":"Kimberly Blessing is a web developer, technical manager, and open web advocate from Philadelphia, USA. She has evangelized design, code, and accessibility best practices while holding senior roles at Comcast, PayPal, and AOL. She served on the W3C HTML and CSS Working Groups and was a co-lead and member of the Web Standards Project. Currently, Kimberly is the director of technology at Think Brownstone, an experience design consultancy.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/obiwankimberly"},{"Icon":"webpage","Url":"http://www.kimberlyblessing.com/"}],"Sessions":[{"Id":"what-development-teams-can-learn-from-experience-designers","Title":"What Development Teams Can Learn From Experience Designers","Abstract":"","Level":"Level: Basic"}],"Company":"Think Brownstone","Tags":["Methodology","Team","UX"]},{"Id":"klara-ward","Name":"Klara Ward","Bio":"Klara is a senior developer in the Java Mission Control team at Oracle, coding GUIs and hacking the build system. She has been working with Java/JRockit Mission Control and the JRockit JVM since 2002. If you ask a question on the Mission Control forum, chances are Klara will give you an answer. You can also get hold of her on twitter to get the crochet pattern for the JDuchess mascot. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/klaraward"}],"Sessions":[{"Id":"writing-software-using-java-8","Title":"Writing software using Java 8","Abstract":"","Level":"Level: Basic"}],"Company":"Oracle","Tags":["Java"]},{"Id":"kristian-karl","Name":"Kristian Karl","Bio":"Kristian Karl has 20 years of experience in the testing business, and has during that time been given the chance to work in Telecom, Finance, Government and start-ups. Even though Kristian has done White Box Testing, Functional Testing, System and Integration Testing, Acceptance Testing, his heart beats strongest for Test Automation using Model-based Testing and Performance Testing.\nFounder of graphwalker.org\nTest manager at Spotify since 2010.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/kristiankarl"},{"Icon":"webpage","Url":"http://spotify.com"}],"Sessions":[{"Id":"testing-in-continuous-deployment","Title":"Testing in Continuous Deployment","Abstract":"","Level":"Level: Intermediate"}],"Company":"Spotify","Tags":["Dev Ops","Test","Tools"]},{"Id":"krysta-svore","Name":"Krysta Svore","Bio":"Dr. Krysta Svore co-founded and manages the Quantum Architectures and Computation Group (QuArC) at Microsoft Research. She has deep expertise in machine learning and quantum computing, one of the hottest fields in science today. Dr. Svore received her Ph.D. in Computer Science with highest distinction from Columbia University in 2006. She received the ACM Best of 2013 Notable Article award and won the Yahoo! Learning to Rank Challenge in 2010. She is a member of NCWIT, the APS, and the ACM.","Links":[{"Icon":"webpage","Url":"http://research.microsoft.com/en-us/people/ksvore/"}],"Sessions":[{"Id":"liqui--a-software-architecture-for-quantum-computing","Title":"LIQUi|>: A Software Architecture for Quantum Computing","Abstract":"","Level":"Level: Intermediate"}],"Company":"Microsoft","Tags":["Future"]},{"Id":"lukas-van-driel","Name":"Lukas van Driel","Bio":"In the 9 years Lukas has been working at Q42 he's gathered lots of titles: Chief Happiness Officer, Google Cloud developer, \"Yes I will fix your computer\", and Captain Healthy.\n\nFor the past two years he's been the core developer of the Internet of Things platform that the Philips Hue lightbulbs run on. And he loves to talk about it :)","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/q42"},{"Icon":"webpage","Url":"http://q42.nl"}],"Sessions":[{"Id":"lighting-the-way-for-the-internet-of-things","Title":"Lighting the way for the Internet of Things","Abstract":"","Level":"Level: Intermediate"}],"Company":"Q42","Tags":["Architecture","IoT"]},{"Id":"lynn-langit","Name":"Lynn Langit","Bio":"Lynn Langit is a Big Data and Cloud architect. She's built solutions for customers in education, manufacturing and bio-tech and other verticals.  Lynn's published three books on SQL Server Business Intelligence.  Read her blog at www.LynnLangit.com. She also creates technical screencasts on YouTube at https://www.youtube.com/user/SoCalDevGal.  She is also the co-founder of the non-profit 'Teaching Kids Programming' which is part of the MONA Foundation.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/lynnlangit"},{"Icon":"webpage","Url":"http://www.lynnlangit.com"}],"Sessions":[{"Id":"teaching-kids-programming-using-the-intentional-method","Title":"Teaching Kids Programming using the Intentional Method","Abstract":"","Level":"Level: Basic"},{"Id":"machine-learning-smackdown","Title":"Machine Learning Smackdown","Abstract":"","Level":"Level: Intermediate"}],"Company":"Lynn Langit Consulting","Tags":["Cloud"]},{"Id":"mads-hensel","Name":"Mads Hensel","Bio":"Mads Hensel is the Head of Design at Copenhagen-based Falcon Social. He leads a small team of graphic and product designers to develop the UI/UX of Falcon's enterprise software. Before joining the technology world Mads worked as an art director at several Danish advertising agencies. He enjoys working at the messy intersection of hardcore dev, fuzzy design, and stubborn UX — but it's all a playground to him.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/madshensel"},{"Icon":"webpage","Url":"http://falconsocial.com"}],"Sessions":[{"Id":"framework-and-smoke-machines--true-story","Title":"Framework and smoke machines - true story","Abstract":"","Level":"Level: Basic"}],"Company":"Falcon Social","Tags":["Tools","UX","Web"]},{"Id":"magnus-bergman","Name":"Magnus Bergman","Bio":"","Links":[{"Icon":"webpage","Url":"http://www.vmware.com"}],"Sessions":[{"Id":"bridging-the-gap-between-developers-and-operations-creating-multi-tier-application-blueprints-for-easy-consumption","Title":"Bridging the gap between developers and operations creating multi tier application blueprints for easy consumption","Abstract":"","Level":"Level: Basic"}],"Company":"VMware","Tags":null},{"Id":"manfred-steyer","Name":"Manfred Steyer","Bio":"Manfred Steyer is a free-lance trainer, consultant and author at IT-Visions (www.it-visions.de) as well as responsible for the specialist division \"Software-Engineering\" at the university of applied science Campus 02 (www.campus02.at) in Graz (Austria). Manfred writes for O'Reilly, Microsoft Press, Hanser Presss, the german windows.developer and Heise Developer. Furthermore, he regularly speaks at conferences about software development.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/ManfredSteyer"},{"Icon":"webpage","Url":"http://www.softwarearchitekt.at"}],"Sessions":[{"Id":"oauth-2-0-for-javascript-applications","Title":"OAuth 2.0 for JavaScript-Applications","Abstract":"","Level":"Level: Intermediate"}],"Company":"IT Visions | CAMPUS 02","Tags":["Cloud","Javascript","Web"]},{"Id":"marco-cecconi","Name":"Marco Cecconi","Bio":"Marco Cecconi is a core team software developer at Stack Overflow and a public speaker focused on architecture and development. \n\nAs a speaker he has participated to, or is scheduled at, DevDay  (Poland), Webtech.de and Developer Conference (Germany), Hacker News London, How To Web (Romania), Community Days (keynote, Italy), QCon China (keynote), QCon Japan.\n\nHe goes by Sklivvz on the Stack Exchange network, where he has been a proud contributor since the beginning and moderator on Skeptics.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/sklivvz"},{"Icon":"webpage","Url":"http://stackoverflow.com"}],"Sessions":[{"Id":"the-architecture-of-stack-overflow","Title":"The Architecture of Stack Overflow","Abstract":"","Level":"Level: Intermediate"}],"Company":"Stack Exchange","Tags":["Architecture"]},{"Id":"marcus-murray","Name":"Marcus Murray","Bio":"Marcus Murray is the Cyber Security Manager at Truesec. He is the leader of the Truesec Security Team, an independent elite-team of security consultants operating all over the world. Besides designing secure infrastructure and implementing security into various applications, his team performs incident response, security assessments and penetration testing for a variety of clients, including banks, military organizations, and other large corporations.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/MarcusSwede"},{"Icon":"webpage","Url":"http://www.truesec.se"}],"Sessions":[],"Company":"TrueSec","Tags":null},{"Id":"mark-rendle","Name":"Mark Rendle","Bio":"Mark is the Founder and CEO of Zudio, a startup providing tools for managing your data in public clouds. Zudio launched in April 2013, and provides an in-browser suite of tools for working with Windows Azure Storage. Before starting Zudio, Mark worked for a variety of companies from start-ups to large ISVs and consultancies, and has written applications from character-based UNIX tools to desktop GUI applications to modern web and mobile apps. He likes web app development best these days.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/markrendle"},{"Icon":"webpage","Url":"http://blog.markrendle.net"}],"Sessions":[{"Id":"building-web-apps-for-the-cloud","Title":"Building Web Apps for the Cloud","Abstract":"","Level":"Level: Intermediate"},{"Id":"dude-wheres-my-data","Title":"Dude, Where's My Data?","Abstract":"","Level":"Level: Basic"}],"Company":"Zudio","Tags":["Cloud","Web",".NET","Architecture"]},{"Id":"mattias-ask","Name":"Mattias Ask","Bio":"In everything Mattias does he believes in the power of people and ideas. He believes that engaging people with the right ideas is what creates real business value and development joy. Mattias has a wide range of experiences from lean startups, innovation and online marketing solutions and combine these with decent coding skills. Simply put; Mattias develop products.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/mattiasask"},{"Icon":"webpage","Url":"http://www.jayway.com"}],"Sessions":[{"Id":"virtual-reality-overview-with-oculus-rift","Title":"Virtual reality overview with oculus rift","Abstract":"","Level":"Level: Basic"}],"Company":"Jayway","Tags":["IoT","Mobile","UX"]},{"Id":"michael-heinrichs","Name":"Michael Heinrichs","Bio":"Michael works at Canoo as a software engineer on next generation user interfaces. Before that, he was responsible for performance optimizations in JavaFX Mobile at Sun Microsystems and later became the technical lead of the JavaFX core components at Oracle. He then worked on a low-latency trading platform at Barclays Capital.\n\nMichael loves to spend time with his family and cooking. You can find him on Twitter @net0pyr and occasionally he blogs at http://blog.netopyr.com.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/net0pyr"},{"Icon":"webpage","Url":"http://blog.netopyr.com"}],"Sessions":[{"Id":"do-it-yourself-usability-design-for-developers","Title":"Do-it-yourself Usability Design for Developers","Abstract":"","Level":"Level: Intermediate"},{"Id":"the-quantum-physics-of-java","Title":"The Quantum Physics of Java","Abstract":"","Level":"Level: Intermediate"}],"Company":"Canoo Engineering AG","Tags":["UX","Java"]},{"Id":"michiel-borkent","Name":"Michiel Borkent","Bio":"Michiel Borkent is a software developer with an interest in functional\nprogramming, especially Clojure. He has a master’s degree in\nInformatics from the University of Twente. Michiel currently works at Finalist as a Clojure and Java developer. In his former job as a lecturer he enjoyed developing and teaching programming courses (C#, Clojure and others). Michiel's hobbies include vegan cooking, drinking coffee and listening to progressive rock and metal.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/borkdude"},{"Icon":"webpage","Url":"http://michielborkent.nl"}],"Sessions":[{"Id":"clojurescript-for-the-web","Title":"ClojureScript for the web","Abstract":"","Level":"Level: Intermediate"},{"Id":"clojurescript-interfaces-to-react","Title":"ClojureScript interfaces to React","Abstract":"","Level":"Level: Intermediate"}],"Company":"Finalist","Tags":["Javascript","Languages","Web"]},{"Id":"natalie-yadrentseva","Name":"Natalie Yadrentseva","Bio":"Natalie is a product specialist with Targetprocess and a passionate researcher in information visualisation. Previously she was involved in projects of various domains and was lucky to have an inner view being a developer, a business analyst and a project manager. Then she joined Targetprocess - a software innovator in visual project management, and now consulting more than 150 companies around the world on the questions of work with the system, process optimization and agile transformation. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/natalieyadren"}],"Sessions":[{"Id":"see-and-change-introduction-to-visual-management","Title":"See and Change: introduction to visual management","Abstract":"","Level":"Level: Basic"}],"Company":"Targetprocess","Tags":null},{"Id":"neal-ford","Name":"Neal Ford","Bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/neal4d"},{"Icon":"webpage","Url":"http://nealford.com"}],"Sessions":[{"Id":"functional-thinking","Title":"Functional Thinking","Abstract":"","Level":"Level: Intermediate"},{"Id":"continuous-delivery-for-architects","Title":"Continuous Delivery for Architects","Abstract":"","Level":"Level: Advanced"},{"Id":"continuous-delivery-workshop","Title":"Continuous Delivery Workshop","Abstract":"","Level":"Level: Intermediate"}],"Company":"ThoughtWorks, Inc","Tags":["Architecture","Java"]},{"Id":"nile-rodgers","Name":"Nile Rodgers","Bio":"Nile Rodgers is one of the most influential producers in the history of popular music. He co-founded the band CHIC, scored numerous smashes including Atlantic Records’ only triple platinum selling single “Le Freak.” He’s produced, written and/or played on the albums We Are Family, Like A Virgin, Let’s Dance, Diana, Notorious, Cosmic Thing, and in 2014 was awarded three Grammy awards for his work on Daft Punk's \"Random Access Memories,\" and song of the year, \"Get Lucky.\"","Links":[{"Icon":"webpage","Url":"http://www.nilerodgers.com/"}],"Sessions":[{"Id":"about-passion-and-collaboration","Title":"About Passion and Collaboration","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Keynote","Team"]},{"Id":"ola-karlsson","Name":"Ola Karlsson","Bio":"After spending the majority of the last decade on the big continent down under, Ola is now back in Sweden, his chilly homeland in the north. Ola is a senior developer focusing primarily on front end development in XAML and for the web. \nOla is also passionate about UX. \"We need to move away from the idea that, if things don't behave like the user expects them to, then its a \"user error\"! Developers need to think about the users and how the products we build will be used!\"","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/o_k"},{"Icon":"webpage","Url":"http://www.usersandcode.com"}],"Sessions":[{"Id":"do-you-want-to-be-a-superhero","Title":"Do YOU want to be a superhero?","Abstract":"","Level":"Level: Basic"}],"Company":"users & code","Tags":null},{"Id":"oliver-pehnke","Name":"Oliver Pehnke","Bio":"Oliver Pehnke is a project leader and a passionate developer working for a swabian company in Ulm - crafting \"exxcellent solutions\" for various clients in the German industry. \nAlthough the toolbox contains usually Java solutions he is in love with JavaScript and its \"vital\" web community since 2008 and accepts Douglas Crockford as one true prophet.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/oliverpehnke"},{"Icon":"webpage","Url":"http://www.exxcellent.de"}],"Sessions":[{"Id":"bring-out-your-dead","Title":"Bring out your dead","Abstract":"","Level":"Level: Basic"}],"Company":"eXXcellent Solutions GmbH","Tags":null},{"Id":"oren-eini--ayende-rahien","Name":"Oren Eini / Ayende Rahien","Bio":"Oren Eini is the founder of Hibernating Rhinos, creator of RavenDB and a major Open Source aficionado in the .NET space. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/ayende"},{"Icon":"webpage","Url":"http://ayende.com/blog"}],"Sessions":[{"Id":"ravendb-wow-features--the-things-that-you-didnt-know-that-your-database-can-do-for-you","Title":"RavenDB: Wow! features - the things that you didn't know that your database can do for you","Abstract":"","Level":"Level: Intermediate"}],"Company":"Hibernating Rhinos","Tags":["Database"]},{"Id":"patrik-fredriksson","Name":"Patrik Fredriksson","Bio":"As a co-founder and consultant with Citerus I have been doing professional software development and mentoring for more than ten years. I have a particular passion for agile software design and architecture, software development productivity and developer craftsmanship. I am highly motivated to improve the way software is produced and maintained; good software is fun to use and fun to create, bad software and lost projects make me sad.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/weakreference"},{"Icon":"webpage","Url":"http://citer.us/patrik"}],"Sessions":[{"Id":"internet-of-things-an-entertaining-and-mostly-correct-reflection-on-where-we-are-and-how-we-got-here-","Title":"Internet of Things: An entertaining and mostly correct reflection on where we are, and how we got here.","Abstract":"","Level":"Level: Basic"}],"Company":"Citerus AB","Tags":null},{"Id":"paul-cronholm","Name":"Paul Cronholm","Bio":"Founder and CTO at Crunchfish","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/crunchfish"},{"Icon":"webpage","Url":"http://www.crunchfish.com"}],"Sessions":[{"Id":"imagining-the-touchless-generation-move-beyond-glass","Title":"Imagining the touchless generation move beyond glass","Abstract":"","Level":"Level: Basic"}],"Company":"Crunchfish","Tags":["Mobile","UX"]},{"Id":"paul-smith","Name":"Paul Smith","Bio":"Paul is an IT Architect working with IBM Clients in Europe on WebSphere. Paul's expertise is in the development of applications and proofs of concept for customer engagements encompassing multiple parts of the WebSphere brand with the Smarter Process suite, IBM Integration Bus, IBM messaging technologies and emerging platforms such as Bluemix. Paul is based at IBM Hursley and previously worked in the development organization within the strategy team for IBM's integration products.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/pavsmith"}],"Sessions":[{"Id":"make-applications-responsive-and-easier-to-scale-with-light-weight-messaging","Title":"Make applications responsive and easier to scale with light weight messaging","Abstract":"","Level":"Level: Intermediate"}],"Company":"IBM","Tags":["Architecture","Cloud"]},{"Id":"paul-stack","Name":"Paul Stack","Bio":"Paul Stack is a London infrastructure coder working for OpenTable. Paul is passionate about continuous integration and continuous delivery and why they should be part of what developers do on a day to day basis. Paul’s newest passion is the DevOps movement and how this helps not just development and operations but the entire business and it’s customers.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/stack72"},{"Icon":"webpage","Url":"http://www.paulstack.co.uk"}],"Sessions":[{"Id":"building-a-monitoring-infrastructure-with-puppet","Title":"Building a Monitoring Infrastructure with Puppet","Abstract":"","Level":"Level: Advanced"},{"Id":"vagrant--the-essence-of-devops-in-a-tool","Title":"Vagrant - the essence of DevOps in a tool","Abstract":"","Level":"Level: Intermediate"}],"Company":"OpenTable","Tags":["Dev Ops","Tools"]},{"Id":"petar-mataic","Name":"Petar Mataic","Bio":"Petar is an ambitious young developer who hungers for new technology. Because new technology often means that his work becomes easier and allow him to do things faster, better, cooler.\n\nExperienced in .NET, he is currently focused on the iOS platform.\n\nBorn in a country that doesn't exist anymore, he aspires to make the whole world his home, sharing his passion with other software developers attending and speaking at international conferences.\n\nWhen Petar is not pranking his colleagues, he uses his insatiable motivation and determination to improve his programming, skydiving and longboarding skills. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/naw"}],"Sessions":[{"Id":"virtual-reality-overview-with-oculus-rift","Title":"Virtual reality overview with oculus rift","Abstract":"","Level":"Level: Basic"}],"Company":"Jayway","Tags":["IoT","Mobile","UX"]},{"Id":"peter-neubauer","Name":"Peter Neubauer","Bio":"Peter is co-founder of Mapillary, Neo Technology and a number of popular Open Source projects such as Neo4j, OPS4J and Qi4j. He loves connecting things, writing novel prototypes and throwing together new ideas and projects around graphs and society-scale innovation. \nRight now, Peter is concentrating on starting up Mapillary.com - a project to provide a crowd sourced, public (street) view of the planet powered mostly by just smartphones. \nPeter is a Mentor helping startups at Startupbootcamp Copenhagen, Berlin and at Mozilla WebFD.  He likes teaching programming to kids at CoderDojo Malmö and organizing events like http://www.thoughtmade.com and TEDx Öresund and LAN-parties for kids like kidscraft.se.\n\nIf you want brainstorming - feed him a latte and you are in business.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/peterneubauer"},{"Icon":"webpage","Url":"http://mapillary.com"}],"Sessions":[],"Company":"Mapillary","Tags":null},{"Id":"peter-niederwieser","Name":"Peter Niederwieser","Bio":"Peter is a Principal Engineer at Gradleware, and the creator of the Spock Testing Framework. When not in front of his computer, he can often be found speaking at a conference, playing a game of chess, or eating chocolate.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/pniederw"}],"Sessions":[{"Id":"the-gradle-build-system-in-depth","Title":"The Gradle Build System In Depth","Abstract":"","Level":"Level: Intermediate"}],"Company":"Gradleware","Tags":null},{"Id":"peter-smith","Name":"Peter Smith","Bio":"Pete is a software consultant based in London with almost 10 years of experience making web applications with Asp.Net, specialising in API design and Javascript browser-based applications. He is the author of Superscribe - a graph based routing framework, and the OData library Linq to Querystring.\n\nHis favourite C# keyword is 'explicit'.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/roysvork"},{"Icon":"webpage","Url":"http://roysvork.wordpress.com"}],"Sessions":[{"Id":"it-doesnt-work-that-way-in-enterprise","Title":"\"It doesn't work that way in enterprise\"","Abstract":"","Level":"Level: Intermediate"},{"Id":"beyond-responsive-design--ui-for-the-modern-web-application","Title":"Beyond responsive design - UI for the modern web application","Abstract":"","Level":"Level: Intermediate"}],"Company":"One and Three Consulting","Tags":["UX","Web"]},{"Id":"philip-akesson","Name":"Philip Åkesson","Bio":"Philip is a Security Software Engineer at TrueSec, a leading-edge company in IT security and development. With a background in embedded systems, Philip is an experienced low-level developer with interests ranging from mobile security to computer vision. He has worked as a developer on several security-critical projects for multiple platforms, with millions of everyday end users.","Links":[{"Icon":"webpage","Url":"http://www.truesec.se"}],"Sessions":[],"Company":"TrueSec","Tags":null},{"Id":"pradeep-soundararajan","Name":"Pradeep Soundararajan","Bio":"Pradeep Soundararajan co-founded Moolya, a company that specializes in exploratory testing and context driven test approaches whilst doing automation the way it best can be. He facilitates his colleagues to do awesome testing and is working towards creative solutions that can change the way people test software. He writes two testing blogs: www.moolya.com/blog and http://testertested.blogspot.com and speaks around the world on changing the testing space.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/testertested"},{"Icon":"webpage","Url":"http://moolya.com"}],"Sessions":[{"Id":"testing-to-improve-app-store-ratings-for-mobile-apps","Title":"Testing to improve app store ratings for mobile apps","Abstract":"","Level":"Level: Intermediate"},{"Id":"the-tool-that-helps-to-be-powerful-influencers-on-projects","Title":"The tool that helps to be powerful influencers on projects","Abstract":"","Level":"Level: Intermediate"}],"Company":"Moolya Software Testing","Tags":["Mobile","Test"]},{"Id":"pramod-sadalage","Name":"Pramod Sadalage","Bio":"Pramod Sadalage enjoys the rare role of bridging the divide between database professionals and application developers. In the early 00’s he developed techniques to allow relational databases to be designed in an evolutionary manner based on version-controlled schema migrations. He is the co-author of Refactoring Databases, co-author of NoSQL Distilled, author of Recipes for Continuous Database Integration and continues to speak and write about the insights he and his clients learn.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/pramodsadalage"},{"Icon":"webpage","Url":"http://sadalage.com"}],"Sessions":[{"Id":"enabling-continuous-delivery-with-database-practices","Title":"Enabling Continuous Delivery with Database Practices","Abstract":"","Level":"Level: Intermediate"},{"Id":"nosql-an-introduction-to-polyglot-persistence","Title":"NoSQL: An introduction to polyglot persistence","Abstract":"","Level":"Level: Basic"}],"Company":"ThoughtWorks","Tags":["Architecture","Database"]},{"Id":"richard-bair","Name":"Richard Bair","Bio":"Richard Bair is the architect for the client Java platform at Oracle. He was an influential lead in the development of JavaFX UI controls and associated APIs. Prior to that he was the lead of the SwingLabs project, which was an open source community supported by Sun with a focus on enhancing and extending Swing. Before working at Sun, Blair was an application developer with a focus on data-oriented rich client applications backed by databases. He has a passion for graphics, performance, and developer productivity.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/richardbair"},{"Icon":"webpage","Url":"http://fxexperience.com"}],"Sessions":[{"Id":"rapid-iot-ui-with-javafx-and-scenebuilder","Title":"Rapid IoT UI with JavaFX and SceneBuilder","Abstract":"","Level":"Level: Intermediate"},{"Id":"javafx-on-your-wall-in-your-car-or-on-a-plane","Title":"JavaFX on your wall, in your car, or on a plane!","Abstract":"","Level":"Level: Intermediate"}],"Company":"Oracle","Tags":["Java","Tools","UX","Internet of Things"]},{"Id":"richard-warburton","Name":"Richard Warburton","Bio":"Software Engineer, Conference Speaker and Author, interested in deep dive performance issues and Static Analysis, Adopt-A-JSR and Adopt-OpenJDK , PhD, Londoner.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/richardwarburto"},{"Icon":"webpage","Url":"http://insightfullogic.com"}],"Sessions":[{"Id":"a-sign-of-the-times-dates-and-times-in-java-8","Title":"A sign of the Times: Dates and Times in Java 8","Abstract":"","Level":"Level: Basic"},{"Id":"twins-fp-and-oop","Title":"Twins: FP and OOP","Abstract":"","Level":"Level: Intermediate"}],"Company":"Me","Tags":["Java","Languages"]},{"Id":"rob-ashton","Name":"Rob Ashton","Bio":"No longer a part of the system, Rob left his last enterprise development two years ago and spent a year doing two-week contracts for a combination of food, shelter and occasionally money in any technology at hand.\n\nHe is an aficionado of Clojure, in a love/hate relationship with JS and now works as an Erlang developer on a 100% remote basis.\n\nRob can be found coding in coffee shops across Europe.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/robashton"},{"Icon":"webpage","Url":"http://codeofrob.com"}],"Sessions":[{"Id":"lessons-learned-writing-a-database-in-clojure","Title":"Lessons learned writing a database in Clojure","Abstract":"","Level":"Level: Intermediate"}],"Company":"freelance","Tags":["Database","Languages"]},{"Id":"rob-eisenberg","Name":"Rob Eisenberg","Bio":"Rob Eisenberg is a JavaScript expert working out of Tallahassee, FL and is the President of Blue Spire. He is the founder of the Durandal and Caliburn.Micro projects. Rob currently works as a member of both the AngularJS 2.0 Core Team and the AngularJS Material Design team, helping to develop the next generation of web application frameworks and tooling.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/EisenbergEffect"},{"Icon":"webpage","Url":"http://eisenbergeffect.bluespire.com/"}],"Sessions":[{"Id":"angularjs-2-0","Title":"AngularJS 2.0","Abstract":"","Level":"Level: Intermediate"},{"Id":"owning-browser-standards","Title":"Owning Browser Standards","Abstract":"","Level":"Level: Basic"}],"Company":"Blue Spire","Tags":null},{"Id":"rune-funch-soltoft","Name":"Rune Funch Søltoft","Bio":"I was born in 1975 an raised without computers. I did my first programming at the age of ten in a youth club and my first program for a \"client\" at my high school when I accidentally discovered a security loop hole and was asked if I could kindly fix it. I have for the past 10 years worked as an architect primarily of safety critical or at least mission critical systems.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/soltoft"},{"Icon":"webpage","Url":"http://runefs.com"}],"Sessions":[{"Id":"creating-great-systems-with-the-help-of-olympic-athletes-agile-and-pretotypes","Title":"Creating great systems with the help of Olympic athletes, agile and pretotypes","Abstract":"","Level":"Level: Intermediate"}],"Company":"Asseco Danmark","Tags":null},{"Id":"ryan-neufeld","Name":"Ryan Neufeld","Bio":"Ryan is a polyglot software developer and budding architect. Whether it's a tough technical issue or one of the softer elements of software engineering, Ryan relishes the opportunity to deliver results for clients.\n\nRyan is also an author, having recently finished co-writing and editing the crowd-sourced Clojure Cookbook.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/rkneufeld"},{"Icon":"webpage","Url":"http://www.rkn.io"}],"Sessions":[{"Id":"developing-web-applications-with-clojure","Title":"Developing Web Applications with Clojure","Abstract":"","Level":"Level: Intermediate"},{"Id":"datomic-for-the-96-percent","Title":"Datomic for the 96 Percent","Abstract":"","Level":"Level: Intermediate"}],"Company":"Independent","Tags":["Languages","Web","Database"]},{"Id":"sean-wolcott","Name":"Sean Wolcott","Bio":"Sean Wolcott is a Seattle-based graphic designer, currently working as Senior Art Director at Microsoft. Besides creating user interfaces and experiences for products used by millions, Mr. Wolcott runs his own practice, Rationale, where he designs identities, packaging, signage, publications, websites, and user interfaces for a wide array of clients.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/RationaleDesign"},{"Icon":"webpage","Url":"http://rationale-design.com"}],"Sessions":[{"Id":"good-design-is-a-language","Title":"Good Design Is a Language","Abstract":"","Level":"Level: Basic"},{"Id":"classical-typography-and-digital-interfaces","Title":"Classical Typography and Digital Interfaces","Abstract":"","Level":"Level: Basic"}],"Company":"Microsoft","Tags":["UX"]},{"Id":"sebastian-olsson","Name":"Sebastian Olsson","Bio":"Sebastian is a Security Software Engineer at TrueSec, a leading-edge company in IT security and development. He spends most of his time at work developing and auditing security critical code. Sebastian loves working on projects where security is a core requirement and especially if that includes working on cryptography and secure communications. He believes that security is an important aspect that must be considered throughout the whole development process and that developers must start paying more attention to security in their design choices.","Links":[{"Icon":"webpage","Url":"https://www.truesec.se"}],"Sessions":[{"Id":"security-for-developers","Title":"Security for developers","Abstract":"","Level":"Level: Intermediate"}],"Company":"TrueSec","Tags":["Architecture","Security"]},{"Id":"sebastien-deleuze","Name":"Sébastien Deleuze","Bio":"Sébastien is a Spring Framework commiter at Pivotal and also a Dart Google Developer Expert.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/sdeleuze"},{"Icon":"webpage","Url":"https://github.com/sdeleuze"}],"Sessions":[{"Id":"microservices-with-dart-polymer-and-hypermedia","Title":"Microservices with Dart, Polymer and Hypermedia","Abstract":"","Level":"Level: Intermediate"}],"Company":"Pivotal","Tags":["Languages","Tools","Web"]},{"Id":"siamak-sadeghianfar","Name":"Siamak Sadeghianfar","Bio":"Siamak Sadeghianfar is a Solution Architect at Red Hat working across the Nordics and helping customers adapting open source and Red Hat technologies. He has deep experience and knowledge in the middleware area and has been working with Java, Java EE and related technologies for his entire professional life.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/siamaks"},{"Icon":"webpage","Url":"http://redhat.com"}],"Sessions":[{"Id":"continuous-delivery-with-openshift","Title":"Continuous Delivery with OpenShift","Abstract":"","Level":"Level: Intermediate"}],"Company":"Red Hat AB","Tags":["Architecture","Methodology","Team","Tools"]},{"Id":"stefan-ivarsson","Name":"Stefan Ivarsson","Bio":"Employed as a security consultant at TrueSec, Stefan works primarily with trying to break things apart, analyze and help customers improving their security. The analyses often include security tests, code review and consultation. Stefan enjoys development of security scripts and tools both for work and recreational purposes.","Links":[{"Icon":"webpage","Url":"http://www.truesec.se"}],"Sessions":[],"Company":"TrueSec SYD AB","Tags":null},{"Id":"stefan-karpinski","Name":"Stefan Karpinski","Bio":"Stefan Karpinski is one of the co-creators and core developers of the Julia language. He is an applied mathematician and data scientist by trade, having worked at Akamai, Citrix Online, and Etsy, but currently is employed as a researcher at MIT, focused on advancing Julia’s design, implementation, documentation, and community.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/StefanKarpinski"},{"Icon":"webpage","Url":"http://karpinski.org/"}],"Sessions":[{"Id":"julia--a-fast-dynamic-language-for-technical-computing","Title":"Julia – a fast dynamic language for technical computing","Abstract":"","Level":"Level: Intermediate"}],"Company":"MIT / Julia","Tags":["Languages"]},{"Id":"steffen-kramer-valsted","Name":"Steffen Kramer Valsted","Bio":"Steffen has been a UX professional since year 2000, designing for mobile phones, websites and most recently for cars. He joined Volvo Cars in 2012 to bring UX practices into the automotive business.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/STEFFENKRAMER"}],"Sessions":[{"Id":"ux-behind-the-steering-wheel","Title":"UX behind the steering wheel","Abstract":"","Level":"Level: Basic"}],"Company":"Volvo Cars","Tags":["UX"]},{"Id":"stephen-chin","Name":"Stephen Chin","Bio":"Stephen Chin is a Java Ambassador at Oracle specializing in embedded and UI technology, co-author of the Pro JavaFX Platform 2 title, and the JavaOne Content Chair. He has been featured at Java conferences around the world including Devoxx, JFokus, OSCON, JFall, GeeCON, JustJava, and JavaOne, where he thrice received a Rock Star Award. Stephen can be followed on twitter @steveonjava, reached via his blog: http://steveonjava.com/, and his hacking adventures can be seen on http://nighthacking.com/","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/steveonjava"},{"Icon":"webpage","Url":"http://steveonjava.com/"}],"Sessions":[{"Id":"iot-magic-show","Title":"IoT Magic Show","Abstract":"","Level":"Level: Intermediate"}],"Company":"Oracle","Tags":["IoT"]},{"Id":"steve-bennett","Name":"Steve Bennett","Bio":"I'm a full stack web developer leading a product development team for eBay Inc Europe in Richmond, London.\n\nI started my career as a graduate software engineer at British Telecom before moving on to hibu (formally known a Yell Group) to lead agile development teams building products for Yell.com. \n\nI have an interest in agile development and how the way we work influence the products we build.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/sb_io"},{"Icon":"webpage","Url":"http://www.tekhlog.com"}],"Sessions":[{"Id":"waiter-theres-test-in-my-dev","Title":"Waiter, there's test in my dev","Abstract":"","Level":"Level: Intermediate"}],"Company":"eBay","Tags":["Agile","Test"]},{"Id":"steve-jennings","Name":"Steve Jennings","Bio":"Steve was the founder of Maxim, europe’s leading sports nutrition brand.\n\nHe's a member of the founder team of the Canadian open-source non profit organisation Bicycles for Humanity.\n\nHe was one of the founding members of PepsiCo’s global good-for-you nutrition innovation team,\n\nHe was the co-founder and CEO of GoodCred a Swedish company focused on complementary currency innovation.\n\nSteve is one of the founding partners of the Nordic Data Empowerment Initiative (NordicDEi)","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/stevejennings1"},{"Icon":"webpage","Url":"http://nordicdei.org"}],"Sessions":[{"Id":"democratize-data-by-igniting-a-crowd-powered-global-movement-","Title":"Democratize data by igniting a crowd powered global movement.","Abstract":"","Level":"Level: Basic"}],"Company":"NordicDEi","Tags":null},{"Id":"sune-lehmann","Name":"Sune Lehmann","Bio":"I’m an Associate Professor at DTU Compute. I’ve worked as a postdoc at the Institute for Quantitative Social Science at Harvard University and before that, I was at the Center for Complex Network Research at Northeastern University.\n\nMy current research is about dynamic social networks. Currently we've handed out free cell phones to 1000 students at DTU and we're studying their interactions face-to-face, via telecommunications, and social networks. The most detailed social dataset in the world.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/suneman"},{"Icon":"webpage","Url":"http://sunelehmann.com"}],"Sessions":[{"Id":"measuring-social-networks-building-a-living-lab-to-study-human-social-interactions-on-a-massive-scale-","Title":"Measuring Social Networks. Building a living lab to study human social interactions on a massive scale.","Abstract":"","Level":"Level: Basic"}],"Company":"Technical University of Denmark","Tags":null},{"Id":"sven-peters","Name":"Sven Peters","Bio":"Sven Peters is a software geek working as an Ambassador for Atlassian. He started with Java development in 1998 and has been programming for longer that he'd like to admit. Besides coding his passion is effective software development, keeping developers motivated, and helping them kick-ass. Sven has extensive speaking experience in 20+ countries on myriad topics.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/svenpet"},{"Icon":"webpage","Url":"http://svenpet.com"}],"Sessions":[{"Id":"coding-culture","Title":"Coding Culture","Abstract":"","Level":"Level: Basic"}],"Company":"Atlassian","Tags":["Mastery","Team"]},{"Id":"thomas-q-brady","Name":"Thomas Q Brady","Bio":"Thomas Q Brady started, as so many did, with a Commodore computer as a child(Vic 20, though, not 64), teaching himself BASIC from the book that came with it. It became a life-long-hobby-turned-career, when his degrees in Psychology and Philosophy turned out to be the real hobbies. He's a hardware hacker, interaction designer and developer, currently working as Technology Director at Reaction, Inc., makers of the Exo short-term housing system.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/thomasqbrady"},{"Icon":"webpage","Url":"http://reactionhousing.com"}],"Sessions":[{"Id":"dont-chase-innovation-chase-forgotten-people","Title":"Don't Chase Innovation—Chase Forgotten People","Abstract":"","Level":"Level: Basic"},{"Id":"the-three-kinds-of-code-rs-","Title":"The Three Kinds of Code(rs)","Abstract":"","Level":"Level: Basic"}],"Company":"Reaction, Inc.","Tags":["Agile","Mastery","Methodology"]},{"Id":"thomas-raneland","Name":"Thomas Raneland","Bio":"Thomas is the CTO at Apptus, the company that helps online retailers such as CDON.COM, Bygghemma, Adlibris, Kjell & Co, and Nelly to increase relevance on their site by learning from user behavior. A devoted programmer since 1993 with a M.Sc in Computer Science & Engineering from LTH, Thomas joined Apptus in 2004. Ten years later, with experience from more than 50 customer projects, Thomas has become and expert on performance and relevance in the online retail business.","Links":[{"Icon":"webpage","Url":"http://www.apptus.com"}],"Sessions":[{"Id":"behind-the-smiling-face-of-a-sales-droid","Title":"Behind the smiling face of a sales droid","Abstract":"","Level":"Level: Intermediate"}],"Company":"Apptus Technologies","Tags":["Architecture","Database"]},{"Id":"tim-g-thomas","Name":"Tim G. Thomas","Bio":"Tim G. Thomas is a Software Engineer at frog in Austin, Texas, where he applies holistic design principles to make the web both usable and beautiful. He speaks on various topics at technology user groups, conferences, and meet-ups, blogs about Web, game, and mobile design at http://timgthomas.com, and shares his thoughts via Twitter at @timgthomas.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/timgthomas"},{"Icon":"webpage","Url":"http://timgthomas.com"}],"Sessions":[{"Id":"web-usability-on-a-budget","Title":"Web Usability on a Budget","Abstract":"","Level":"Level: Basic"},{"Id":"build-a-better-bootstrap","Title":"Build a Better Bootstrap","Abstract":"","Level":"Level: Intermediate"}],"Company":"frog","Tags":["UX","Web","Tools"]},{"Id":"tim-johnsen","Name":"Tim Johnsen","Bio":"I've been developing software for iOS since 2009 and for Android since early 2014. I've been working hard on advancing digital reading products at Flipboard since January 2012 on both platforms. I also maintain a set of independent hobby apps on the App Store which I love updating regularly.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/timonus"}],"Sessions":[{"Id":"queueing-network-tasks-when-offline","Title":"Queueing Network Tasks When Offline","Abstract":"","Level":"Level: Intermediate"},{"Id":"approaches-to-developing-cross-platform-software","Title":"Approaches to Developing Cross-Platform Software","Abstract":"","Level":"Level: Intermediate"}],"Company":"Flipboard, Inc.","Tags":["Architecture","Mobile"]},{"Id":"tomas-petricek","Name":"Tomas Petricek","Bio":"Tomas is a long-term F# enthusiast, author of \"Real World Functional Programming\", frequent conference speaker and Microsoft MVP. He contributed to the development of F# as a contractor at Microsoft Research and helped to create explorative data manipulation library Deedle while at BlueMountain Capital in New York. He is finishing PhD in Cambridge, working on types for functional programming languages.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/tomaspetricek"},{"Icon":"webpage","Url":"http://tomasp.net"}],"Sessions":[{"Id":"fslab-doing-data-science-with-f-","Title":"FsLab: Doing data science with F#","Abstract":"","Level":"Level: Intermediate"},{"Id":"taking-your-craft-seriously-with-f-","Title":"Taking your craft seriously with F#","Abstract":"","Level":"Level: Intermediate"}],"Company":"F# Works","Tags":["Languages","Tools",".NET","Mastery"]},{"Id":"tony-ernst","Name":"Tony Ernst","Bio":"Born 1966 in Malmö. Music journalist, writer and editor. Started the first Swedish music magazine (in the 90's) solely about african-american music, called »Gidappa!« (yes, try shouting it like James Brown!) Has written about music for 20 years and met every one of his idols, bar Scarface and Aretha Franklin. ","Links":[],"Sessions":[{"Id":"about-passion-and-collaboration","Title":"About Passion and Collaboration","Abstract":"","Level":"Level: Basic"}],"Company":"","Tags":["Keynote","Team"]},{"Id":"troed-sangberg","Name":"Troed Sangberg","Bio":"Troed Sångberg is a developer advocate with Sony Developer Relations. With a core technical background in the home computer scene of the 80s he’s been a professional telecom developer since the late 90s. Most recently he has worked in research, with an interest in the intersection between disruptive technology and the culture of society. Troed considers decentralisation of creation - how anyone anywhere can invent, distribute and disrupt - to be the major game changer of our times.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/devtroed"},{"Icon":"webpage","Url":"http://sony.com/developer"}],"Sessions":[{"Id":"beyond-smartphones","Title":"Beyond Smartphones","Abstract":"","Level":"Level: Basic"}],"Company":"Sony","Tags":["IoT","Mobile"]},{"Id":"vasco-duarte","Name":"Vasco Duarte","Bio":"Product Manager, Scrum Master, Project Manager, Director, Agile Coach are only some of the roles that I've taken in software development organizations. Having worked in the software industry since 1997, and Agile practitioner since 2004. I've worked in small, medium and large software organizations as an Agile Coach or leader in agile adoption at those organizations.\nPrincipal Consultant and Managing partner at Oikosofy.com","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/duarte_vasco"},{"Icon":"webpage","Url":"http://softwaredevelopmenttoday.com"}],"Sessions":[{"Id":"-noestimates-unplugged--a-conversation-about-agile-as-if-you-meant-it","Title":"#NoEstimates Unplugged - A conversation about Agile as-if-you-meant-it","Abstract":"","Level":"Level: Intermediate"},{"Id":"how-to-improve-estimates-for-software-projects-the-noestimates-view","Title":"How to improve estimates for software projects, the #NoEstimates view","Abstract":"","Level":"Level: Intermediate"}],"Company":"Oikosofy","Tags":["Agile"]},{"Id":"woody-zuill","Name":"Woody Zuill","Bio":"Woody Zuill has been programming computers for 30 years, and works as an Agile Coach/Development Manager. Over the last 15 years he has worked as an Agile Coach, Trainer, and Extreme Programmer.  He believes code must be simple, clean, and maintainable to realize the Agile promise of Responding to Change. He spent many years as an artist/designer/manufacturer of graphics for televised sporting events where deadlines are for real. Loves Mob Programming. ","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/WoodyZuill"},{"Icon":"webpage","Url":"http://zuill.us/WoodyZuill/"}],"Sessions":[{"Id":"continuous-discovery-the-power-of-pure-agile","Title":"Continuous Discovery, The Power of Pure Agile","Abstract":"","Level":"Level: Intermediate"},{"Id":"-noestimates-unplugged--a-conversation-about-agile-as-if-you-meant-it","Title":"#NoEstimates Unplugged - A conversation about Agile as-if-you-meant-it","Abstract":"","Level":"Level: Intermediate"},{"Id":"mob-programming-hands-on-workshop--a-whole-team-approach","Title":"Mob Programming Hands-On Workshop - A Whole Team Approach","Abstract":"","Level":"Level: Intermediate"}],"Company":"Hunter Industries","Tags":["Agile"]},{"Id":"yavor-georgiev","Name":"Yavor Georgiev","Bio":"Yavor is a Program Manager on the Azure team at Microsoft, focusing on building connected mobile apps. He spent the last couple of years building open-source frameworks to make the cloud accessible from any device. You can find him at http://hashtagfail.com  and @theYavor on Twitter. In his spare time, Yavor is an avid outdoor enthusiast, mountaineer, and skier.","Links":[{"Icon":"twitter-link","Url":"http://www.twitter.com/theYavor"},{"Icon":"webpage","Url":"http://hashtagfail.com"}],"Sessions":[{"Id":"mobile-apps-that-work-even-when-your-network-doesnt","Title":"Mobile apps that work, even when your network doesn't","Abstract":"","Level":"Level: Intermediate"}],"Company":"Microsoft","Tags":["Cloud","Mobile",".NET"]}]