[{"Id":"470","Name":"Alessandro Cinelli","Role":"Head of Backend Engineering - Namshi","Bio":"Alessandro Cinelli (a.k.a. cirpo) is currently working at Namshi (http://namshi.com),  the fashion e-commerce in the Middle East located in Dubai. He has a keen attention for enterprise patterns, methodologies, clean code and everything related to performances. He loves to share and give back to the community, that’s why he actively contributes to open source projects and when he was in Italy he has been a board member of the Italian PHP, Javascript User Group and WEBdeBS.","Links":[{"Icon":"linkedin","Url":"https://www.linkedin.com/in/cinellialessandro","Text":"https://www.linkedin.com/in/cinellialessandro"},{"Icon":"twitter","Url":"","Text":"@cirpo"}],"Sessions":[{"Id":"1060","Title":"PHP is the king, nodejs is the prince and Python is the fool","TimeSlotId":"14:50/15:50","TrackId":"8","Abstract":"At Namshi, an e-commerce retailer based in Dubai serving the UAE and GCC, we are using different technologies to boost our architecture.\r\nWe started with a common architecture based on PHP Nginx, Mysql and Memcache: the usual suspects. \r\nDuring last year the architecture changed a lot, using an SOA paradigm to meet expectations and the huge increase of traffic from several millions users throughout the year. But there’s more…\r\nIn this talk we will show how funny, easy and rewarding is to integrate different technologies in your stack, with PHP always being the king of the whole system.","Speaker":"Alessandro Cinelli","SpeakerId":"470","Day":"Friday"},{"Id":"994","Title":"Apt-get no more let Vagrant, Puppet and Docker take the stage","TimeSlotId":"16:10/17:10","TrackId":"2","Abstract":"How frustrating is to configure your dev machine everytime to meet the production specs?\r\nHow frustrating is to be sure that all of your colleagues have the same setup?\r\nHow to avoid distributing a new 4 GB vm to your team devs everytime you change the specs?\r\nEnter Vagrant, Puppet and Docker, the easy way to distribute vm and integrate them in your project repo\r\nwith just few KB!","Speaker":"Alessandro Cinelli","SpeakerId":"470","Day":"Friday"}]},{"Id":"391","Name":"Alfredo Morresi","Role":"Developer Relations - Google","Bio":"79ers, nature and technology lover, supporter of open-source philosophy and footings along the beach. Maieutic and social oriented, passionate about evolutions of mobile world. Best dishes: community, code and Tiramisu’. Desires? A couple of additional hours of sleep every day.","Links":[{"Icon":"website","Url":"http://www.rainbowbreeze.it","Text":"http://www.rainbowbreeze.it"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/alfredomorresi","Text":"http://it.linkedin.com/in/alfredomorresi"},{"Icon":"twitter","Url":"","Text":"@rainbowbreeze"}],"Sessions":[{"Id":"983","Title":"The second screen world in the Google Cast era","TimeSlotId":"14:50/15:50","TrackId":"1","Abstract":"TVs are the biggest, most beautiful screen in people’s living rooms. Google Cast is a technology that enables true multi-screen experiences for the users.\r\n\r\nIntegrating Google Cast into existing applications is simple, and we’re going to cover the SDK and resources available to make your application Cast enabled really easily. Android, iOS and Web.\r\n\r\nPossibilities? Endless: not only casting video or audio, but also games where the TV becomes the new and high-tech game board or a variety of other apps to enjoy with friends, sitting together on the couch.","Speaker":"Alfredo Morresi","SpeakerId":"391","Day":"Friday"}]},{"Id":"287","Name":"Andrea Boschin","Role":"Owner, Consultant - Elite Agency","Bio":"Andrea si occupa di sviluppo di software da più di 15 anni, con particolare predilezione per le tecnologie web ma con esperienze molteplici anche in ambito desktop e web service. Dal 2007 è Microsoft MVP, dapprima nell&#039;ambito di ASP.NET e in seguito su Silverlight per il quale è stato il primo ad essere nominato in Italia. Scrive correntemente articoli tecnici per testate internazionali e per il proprio weblog, e conduce da più di 8 anni XeDotNet, il più attivo user group di Italia in termini di eventi organizzati.","Links":[{"Icon":"website","Url":"http://xamlplayground.org","Text":"http://xamlplayground.org"},{"Icon":"linkedin","Url":"http://www.linkedin.com/in/boschin","Text":"http://www.linkedin.com/in/boschin"},{"Icon":"twitter","Url":"","Text":"aboschin"}],"Sessions":[{"Id":"1113","Title":"Typescript, Angular e Bootstrap assieme per applicazioni real world","TimeSlotId":"09:00/10:00","TrackId":"5","Abstract":"La recente affermazione in ambito web delle applicazioni rich basate su HTML5 e Javascript è diventato sorgente di una serie di librerie innovative e di strumenti che, se usati correttamente, possono semplificare enormemente lo sviluppo. In questa sessione sarà illustrato come sfruttare Typescript, in concomitanza con Angular e Bootstrap per realizzare applicazioni che sfruttino al massimo le possibilità dei browser e diano un feedback il più possibile simile alle applicazioni desktop","Speaker":"Andrea Boschin","SpeakerId":"287","Day":"Saturday"}]},{"Id":"190","Name":"Andrea Pompili","Role":"Security Consuntant - Mine","Bio":"Andrea Pompili è un informatico che si occupa di sicurezza. Giovanissimo, è entrato nel mondo dei computer realizzando uno dei più celebri videogiochi italiani della vecchia informatica. Terminati gli studi, si è occupato prima di sviluppo software e quindi di sicurezza informatica. Attualmente consulente strategico in ambito sicurezza e networking per l&#039;integrazione di soluzioni innovative. Dal 2013 fa parte del core developement team del progetto OWASP ZAP.","Links":[{"Icon":"website","Url":"http://letigriditelecom.blogspot.it/","Text":"http://letigriditelecom.blogspot.it/"},{"Icon":"linkedin","Url":"http://www.linkedin.com/in/andreapompili","Text":"http://www.linkedin.com/in/andreapompili"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1021","Title":"The Dark Side of Malware Analysis","TimeSlotId":"10:00/11:00","TrackId":"5","Abstract":"Storicamente il reversing di eseguibili è sempre stata una pratica oscura associata alla pirateria o allo spionaggio industriale, ma oggi, con l&#039;aumentare di malware targettizzati, quest&#039;arte sta diventando un argomento molto discusso perchè necessita \r\nuna forte capacità di analisi, intuizione ed inventiva. Ma perchè è così importante analizzare un malware? Quali strumenti utlizzare, ma soprattutto come approcciare il problema?  Come gestire i meccanismi di protezione adottati? Niente di meglio \r\nper addentrarci nel mondo della malware analysis partendo proprio da alcuni casi reali","Speaker":"Andrea Pompili","SpeakerId":"190","Day":"Friday"}]},{"Id":"926","Name":"Arun Gupta","Role":"Director, Developer Advocacy - Red Hat","Bio":"Arun Gupta is Director of Developer Advocacy at Red Hat and focuses on JBoss Middleware. As a founding member of the Java EE team at Sun Microsystems, he spread the love for technology all around the world. At Oracle, he led a cross-functional team to drive the global launch of the Java EE 7 platform through strategy, planning, and execution of content, marketing campaigns, and program. He is a prolific blogger since 2005 and have authored 1500+ blogs on technology. Arun has extensive speaking experience in ~40 countries on myriad topics and is a JavaOne Rockstar. He also founded the Devoxx4Ki","Links":[{"Icon":"website","Url":"http://blog.arungupta.me","Text":"http://blog.arungupta.me"},{"Icon":"twitter","Url":"","Text":"@arungupta"}],"Sessions":[{"Id":"1085","Title":"Refactor your Java EE application using Microservices and Containers","TimeSlotId":"16:20/17:20","TrackId":"2","Abstract":"This talk will provide a quick introduction to Docker images (build time), containers (run time), and registry (distribution). It shows how to take an existing Java EE application and package it as a monolithic application as a single Docker image. The application will then be refactored in to multiple microservices and assembled together using orchestration. Unit and integration testing of such applications will be discussed and shown as well. Design patterns and anti-patterns that show how to create cluster of such applications will be demonstrated and discussed.","Speaker":"Arun Gupta","SpeakerId":"926","Day":"Saturday"}]},{"Id":"192","Name":"Bermon Painter","Role":"Experience Design, Practice Manager - Cardinal Solutions","Bio":"Bermon is the organizer of various community groups for user experience designers and front-end developers, and the organizer of Blend Conference, a 3-day multi-track event for user experience strategists, designers and developers. He also leads the user experience team for Cardinal Solutions&#039; Charlotte office where he consults with large enterprise clients on interesting problems across user experience, design and front-end development. \r\n\r\nIn his free time he contributes to http://sass-lang.com/ and is the father of the Sass logo.","Links":[{"Icon":"website","Url":"http://bermonpainter.com","Text":"http://bermonpainter.com"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/bermonpainter","Text":"https://www.linkedin.com/in/bermonpainter"},{"Icon":"twitter","Url":"","Text":"bermonpainter"}],"Sessions":[{"Id":"1089","Title":"Integrating User Experience and Agile","TimeSlotId":"09:00/10:00","TrackId":"3","Abstract":"The web is no longer in it&#039;s infancy. We&#039;re growing up. The age old model of creating time consuming deliverables just to appease a client is over. Disciplines must now collaborate, reduce waste and learn to be truly agile in order to create high quality products. In this presentation attendees will discover: \r\n\r\n• a quick review of user experience\r\n• methodology tools in the toolbox (Agile, Scrum, Kanban, Lean)\r\n• the difference between a deliverable and an artifact \r\n• integrating user experience into agile processes\r\n• ways to reduce waste and get to market quickly","Speaker":"Bermon Painter","SpeakerId":"192","Day":"Saturday"}]},{"Id":"1091","Name":"Boyan Mihaylov","Role":"Software architect and developer - Ebita","Bio":"I am interested in software architectures and using IT as a tool to solve everyday problems. I have been working in the consultancy sector the last couple of years where I have been part of a team to deliver IT solutions to different branches: insurance, pension funds, on-line commodities trading, ferry transport. I have been mainly working on .NET platform for back-end development and JavaScript at the client, specializing on techniques on separating these two and building the necessary layers.","Links":[{"Icon":"website","Url":"http://boyan.in","Text":"http://boyan.in"},{"Icon":"linkedin","Url":"http://www.linkedin.com/in/bmihaylov","Text":"http://www.linkedin.com/in/bmihaylov"},{"Icon":"twitter","Url":"","Text":"@bmihaylov"}],"Sessions":[{"Id":"1120","Title":"AngularJS 2.0: A natural evolvement or a new beginning","TimeSlotId":"15:00/16:00","TrackId":"5","Abstract":"For only a couple of years AngularJS has become a standard when talking about single-page applications. Its modularity, testability and structure gives developers a well-defined scope and certain confidence in their projects. As Web changes, so a natural change is expected to happen in the project itself. Version 2.0 however brings a far new world. Although it builds on the existing foundation and governing principles behind the project, it reveals some aspects that have already provoked discussions in the community. In this talk I will go through the new components in AngularJS 2.0: ECMAScrip","Speaker":"Boyan Mihaylov","SpeakerId":"1091","Day":"Saturday"}]},{"Id":"724","Name":"Bruno Bellissimo","Role":"CTO - Qurami","Bio":"Full stack mobile developer, CTO@Qurami.\r\nI speak about software management and mobile development.","Links":[{"Icon":"twitter","Url":"","Text":"@brbellissimo"}],"Sessions":[{"Id":"1064","Title":"Una Startup asincrona e distribuita","TimeSlotId":"09:00/10:00","TrackId":"1","Abstract":"Costruire una startup con un team tecnico completamente remoto non è un modo per evitare il traffico mattutino, ma un&#039; opportunità per costruire una squadra migliore e più produttiva. Il lavoro remoto richiede un diverso approccio alla comunicazione ed ai processi, ma se gestito in modo corretto, può essere un arma capace di fare la differenza.","Speaker":"Bruno Bellissimo","SpeakerId":"724","Day":"Saturday"}]},{"Id":"583","Name":"Carlo Beschi","Role":"co-founder - devsum","Bio":"I&#039;ve been on the web since the late 90&#039;s - studying it, using it, loving it, co-creating it. \r\n\r\nI&#039;ve done some software development, some project management, some program management, some consultancy, some training.\r\n\r\nMy current job and sincere interest is focused on  the organization of work (\"methods\", \"processes\") in technology companies. \r\n\r\nI try and help reduce human suffering, while increasing ROI.","Links":[{"Icon":"linkedin","Url":"http://www.linkedin.com/in/beschi","Text":"http://www.linkedin.com/in/beschi"},{"Icon":"twitter","Url":"","Text":"@carloz"}],"Sessions":[{"Id":"1038","Title":"E&#039; meglio Kanban o Scrum? (Prossima domanda, prego)","TimeSlotId":"14:50/15:50","TrackId":"6","Abstract":"Metto a confronto - con l&#039;aiuto del pubblico -  i due &quot;metodi agili&quot; più di moda - Scrum, al top delle classifiche da qualche anno, e Kanban, stabile al secondo posto. Riassumo la loro storia ed evoluzione.  Riepilogo le loro &quot;regole&quot; (cosa prescrivono, in termini di ruoli, eventi. processi). Mostro un po&#039; di dati sulla loro adozione, in Italia e all&#039;estero. E concludo con un piccolo ragionamento sui valori che ci stanno dietro (a loro e altri metodi &quot;agili&quot;), che spiega perchè la domanda &quot;E&#039; meglio x o y?&quot; è, in molti casi, poco significativa.","Speaker":"Carlo Beschi","SpeakerId":"583","Day":"Friday"}]},{"Id":"1099","Name":"Christian Heilmann","Role":"Enthusiast - The Open Web","Bio":"Chris Heilmann has dedicated a lot of his time making the web better. Originally coming from a radio journalism background, he built his first web site from scratch around 1997 and spent the following years working on lots of large, international web sites. He then spent a few years in Yahoo building products and explaining and training people including Yahoo Answers, Search, Local and Maps. He then worked at Mozilla moving HTML5 support forward and advocating Firefox OS as an open alternative to closed mobile systems. Chris wrote two and contributed to eight books on web development and wrote","Links":[{"Icon":"website","Url":"http://christianheilmann.com","Text":"http://christianheilmann.com"},{"Icon":"twitter","Url":"","Text":"@codepo8"}],"Sessions":[{"Id":"1109","Title":"No more excuses left - let&#039;s build great things","TimeSlotId":"16:20/17:20","TrackId":"4","Abstract":"As developers, we know things break. We also know how to fix them. What we don&#039;t do is do this efficiently. Instead we seem to have a perverse fascination telling one another and the world how broken things are. If you look, however, how cool technology is these days, what tools we have at our disposal and the latest changes in the last excuse we had: &quot;What about IE?&quot; it is time to stop complaining and get to work. Our job is to build things that people want to use. Not to complain about our tools. This is what people looking for excuses do. We&#039;re better than that.","Speaker":"Christian Heilmann","SpeakerId":"1099","Day":"Saturday"}]},{"Id":"1110","Name":"David Melendez","Role":"R&D Sofware Engineer - Albala Ingenieros S.A.","Bio":"David Melendez was born in 1983 in Zaragoza, Spain. He has a Bachellor Computer Degree by Wales University. Nowadays works as R&D software engineer for TV Studio manufacturer company, Albalá Ingenieros in Madrid. He has won several prices in robotic tournamens at Campus Party Spain 2010 and 2012, and has been a speaker in several conferences in Spain, RootedCON 2013, NavajaNegra 2013, OSWHCon 2014, 8.8 Security Conference in Chile 2014 and NoConName 2014 in Barcelona, Spain","Links":[{"Icon":"website","Url":"http://taiksonprojects.blogspot.com","Text":"http://taiksonprojects.blogspot.com"},{"Icon":"twitter","Url":"","Text":"@taiksontexas"}],"Sessions":[{"Id":"1018","Title":"Trash Robotic Router Platform","TimeSlotId":"17:20/18:00","TrackId":"4","Abstract":"Building a drone from scratch with spare parts is a challenging business. To accomplish this journey, a Linux embedded stability control system is developed entirely from 0.This is a journey starting from the hardware choosing (a home WIFI router), to a stable and real flight. Unconventional implementations are one of the main topic, like using WiFi as communication between drone and pilot, HTML5 and COMET to show telemetry from the router web server, and implementing a entirely new protocol based on 802.11 Beacon Frames to prevent deauthentication attacks.","Speaker":"David Melendez","SpeakerId":"1110","Day":"Friday"}]},{"Id":"116","Name":"David Pilato","Role":"developer - elasticsearch","Bio":"David Pilato is technical advocate at elasticsearch. He joined the company after spending the last two years to promote the project and spread the technology in France. He is leading the Elasticsearch French Community and give talks for Java User Groups and some conferences like Devoxx (BE, FR, UK), CodeMotion, Web5, Mix-IT and Open World Forum.\r\nHe implemented many plugins for the Elasticsearch ecosystem (Rivers: RSS, FileSystem and DropBox, Spring factories).","Links":[{"Icon":"website","Url":"http://dev.david.pilato.fr/","Text":"http://dev.david.pilato.fr/"},{"Icon":"linkedin","Url":"http://fr.linkedin.com/in/dadoonet/","Text":"http://fr.linkedin.com/in/dadoonet/"},{"Icon":"twitter","Url":"","Text":"@dadoonet"}],"Sessions":[{"Id":"1084","Title":"Advanced search for your legacy application","TimeSlotId":"15:00/16:00","TrackId":"2","Abstract":"How do you mix SQL and NoSQL worlds without starting a messy revolution?\r\n\r\nThis live coding talk will show you how to add Elasticsearch to your legacy application without changing all your current development habits. Your application will have suddenly have advanced search features, all without the need to write complex SQL code!\r\n\r\nDavid will start from a Spring, Hibernate and Postgresql based application and will add a complete integration of Elasticsearch, all live from the stage during his presentation.","Speaker":"David Pilato","SpeakerId":"116","Day":"Saturday"}]},{"Id":"1163","Name":"Emilia Ciardi","Role":"Head of Native Games - GTECH","Bio":"Emilia is a software engineer with a focus on mobile gaming technologies and a long time experience leading cross functional teams. Working on a wide range of projects, from aerospacial software to e-learning and multimedia applications, she specialized in user experience design, graphical user interface and usability. She has a passion for videogames and over the years has developed several mobile casual games, using almost any tool at hand.\r\nEmilia currently lives in Lugano and works at GTECH,  gathering an in-deep knowledge on math models for the design of gambling and casino games.","Links":[{"Icon":"website","Url":"http://www.gtech.com/","Text":"http://www.gtech.com/"},{"Icon":"linkedin","Url":"http://ch.linkedin.com/in/ekleptica","Text":"http://ch.linkedin.com/in/ekleptica"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1092","Title":"Mobile UX for user engagement and monetization","TimeSlotId":"11:40/12:20","TrackId":"3","Abstract":"The talk dives into the best practices for user engagement and monetization of mobile apps and games. Through examples and real-life scenarios, the key moments of the mobile user experience  will be examined to provide guidelines and hands-on practices to help monetize apps and turn average users into a marketing and revenue building resource.","Speaker":"Emilia Ciardi","SpeakerId":"1163","Day":"Saturday"}]},{"Id":"297","Name":"Enrico Risa","Role":"Developer - Freelance","Bio":"Software engineer, Hacker,open source enthusiast and music lover always looking for new technology.","Links":[{"Icon":"twitter","Url":"","Text":"@wolf4ood"}],"Sessions":[{"Id":"1147","Title":"Meteor + Polymer, the Holy Grail of Web Development.","TimeSlotId":"17:30/18:10","TrackId":"7","Abstract":"Meteor is an open-source Javascript platform for building modern web apps. Polymer is a library for creating Web Components, which are a set of W3C standards and upcoming browser APIs for defining your own custom HTML elements. Let&#039;s combine them to build modern, reactive and beautiful web apps.","Speaker":"Enrico Risa","SpeakerId":"297","Day":"Saturday"}]},{"Id":"982","Name":"Enrico Zimuel","Role":"Senior Software Engineer - Zend Technologies","Bio":"I&#039;m a Software Engineer since 1996. I work in the R&D department of Zend Technologies in Cupertino (California). I&#039;m an open source contributor of Zend Framework and Apigility. I&#039;m a TEDx and regular speaker of conferences about web programming. I did computer science research at the Informatics Institute of the University of Amsterdam. I&#039;m the co-author of the books PHP Best Practices and Javascript Best Pracitces published by FAG Milano.  I&#039;m the co-founder of PHP User Group in Turin (Italy), where I live and work remotely, most of my time.","Links":[{"Icon":"website","Url":"http://www.zimuel.it","Text":"http://www.zimuel.it"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/ezimuel","Text":"https://www.linkedin.com/in/ezimuel"},{"Icon":"twitter","Url":"","Text":"@ezimuel"}],"Sessions":[{"Id":"1156","Title":"Develop and design RESTful web API in PHP using Apigility","TimeSlotId":"15:00/16:00","TrackId":"8","Abstract":"Develop a robust RESTful web API is not a simple task. How to manage the error handling? Which format to use for the data exchange? How to manage the content negotiation? What about the versioning? How to build an authentication system? How to produce the API documentation? In this talk we will show how to design and implement a REST architecture using Apigility, the open source API builder for PHP (http://apigility.org).","Speaker":"Enrico Zimuel","SpeakerId":"982","Day":"Saturday"}]},{"Id":"1176","Name":"Erica Barone","Role":"Technical Evangelist - Microsoft","Bio":"Erica Barone is Technical Evangelist in Microsoft Italia since May 2014, mainly focused on Windows and Windows Phone platforms, but also involved in Internet of Things topic. After one year spent working as firmware designer in safety light curtains and vision sensors projects in Datalogic Automation s.r.l., she joined Microsoft as TE, following all the events involving Windows Phone developers.","Links":[{"Icon":"twitter","Url":"","Text":"@_ericabarone"}],"Sessions":[{"Id":"977","Title":"Windows 10 e il futuro delle Universal App","TimeSlotId":"10:00/11:00","TrackId":"1","Abstract":"Windows 10 è la piattaforma unificata per telefoni, tablet, desktop, Xbox, board, Hololens e Surface Hub. In questa sessione vedremo quali sono le novità principali della nuova piattaforma e come sfruttarle al meglio nelle nostre applicazioni.","Speaker":"Erica Barone","SpeakerId":"1176","Day":"Friday"}]},{"Id":"307","Name":"Fabio Fabbrucci","Role":"Frontend Developer - GNV & Partners","Bio":"Sviluppatore per passione, frontendista per casualità.\r\nMi piace condividere le cose che apprendo con le comunità di riferimento facendo da speaker in diverse conferenze, e credo fortemente che il miglioramento continuo sia la via per poter mantenere viva la passione per ciò che faccio.\r\nDa anni sono focalizzato sullo sviluppo di modalità di lavoro cross-funzionali, orientati a fornire valore al cliente ed a mantenere alta l’efficacia del team.\r\nCredo che il software sia un mezzo, un veicolo per distribuire interfacce che aiutino le persone a risolvere - in parte - i loro problemi.","Links":[{"Icon":"website","Url":"http://fabbrucci.me","Text":"http://fabbrucci.me"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/fabiofabbrucci","Text":"http://it.linkedin.com/in/fabiofabbrucci"},{"Icon":"twitter","Url":"","Text":"@Fabbrucci"}],"Sessions":[{"Id":"1087","Title":"Come creare e manutenere una Styleguide visiva per i tuoi clienti","TimeSlotId":"17:30/18:10","TrackId":"2","Abstract":"In base alla maturità, tipologia e dimensione di un progetto i workflow di design e sviluppo possono cambiare. \r\nUna delle tecniche più &#039;breakthrough&#039; dei workflow è quella delle styleguide.\r\nCosa sono (e cosa non sono)? Come si usano? Come si progettano? Quali sono i pro e i contro? Serve per forza BEM? arà un talk 20% metodo, 60% tecnica e 20% domande!","Speaker":"Fabio Fabbrucci","SpeakerId":"307","Day":"Saturday"}]},{"Id":"236","Name":"Fabio Mora","Role":"Software Engineer - eBay Inc.","Bio":"Fabio Mora, classe 1990, software engineer ad eBay Inc. e studente di economia. Scrivo software e aiuto le organizzazioni a farlo al meglio con i metodi agili.\r\n\r\nFin da giovane appassionato di informatica, nel 2002 fondo un Linux User Group con amici e cresco con la community. Inizio a lavorare da freelance, nel 2010 fondo la mia prima Srl, che venderò poco dopo. Percorsa un po’ di strada arrivo a Cocoon Projects, un&#039;azienda dove sperimento la cultura delle “open company” e nuovi modelli di governance.\r\n\r\nMi piace cantare e suonare la chitarra, leggere, la montagna, viaggiare per il mondo.","Links":[{"Icon":"website","Url":"http://fabiomora.com","Text":"http://fabiomora.com"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/fabiomora","Text":"http://it.linkedin.com/in/fabiomora"},{"Icon":"twitter","Url":"","Text":"@morafabio"}],"Sessions":[{"Id":"992","Title":"Continuous Delivery di una webapp by example","TimeSlotId":"14:00/14:40","TrackId":"2","Abstract":"Una feature non è completa finché non è nelle mani di chi la deve usare. Solo da lì inizia a produrre valore, sia economico o feedback. Che si tratti di master, preview o prod, con l’automazione delle build si possono evitare operazioni ripetitive, complesse, risparmiare tempo ed ottenere interessanti metriche. Tutto al fine di arrivare a poter rilasciare ogni poche ore (ogni volta che la build è verde!). Una overview di una delle 12 pratiche di Extreme Programming: continuous integration (e delivery) con gli strumenti al momento più interessanti. Esempio con una webapp in PHP.","Speaker":"Fabio Mora","SpeakerId":"236","Day":"Friday"}]},{"Id":"338","Name":"Felipe Hoffa","Role":"Developer Advocate - Google","Bio":"Google Developer Advocate, focused on big data and BigQuery.","Links":[{"Icon":"website","Url":"https://developers.google.com/bigquery/","Text":"https://developers.google.com/bigquery/"},{"Icon":"twitter","Url":"","Text":"felipehoffa"}],"Sessions":[{"Id":"1043","Title":"Hands-on with BigQuery JavaScript User-Defined Functions","TimeSlotId":"10:00/11:00","TrackId":"7","Abstract":"Performing ETL on big data can be slow, expensive and painful - but it doesn&#039;t have to be! In this session, we&#039;ll take an in-depth look at several real-world examples of computations that don&#039;t fit well with the SQL language model and how to solve them with user-defined functions in Google BigQuery.\r\n\r\nBigQuery is a fully-managed SQL analytical engine, also used internally in Google, capable of analyzing terabytes of data per second. BigQuery executes user-defined functions on the same server shards that handle data processing and analytics, allowing extremely efficient execution.","Speaker":"Felipe Hoffa","SpeakerId":"338","Day":"Friday"}]},{"Id":"663","Name":"Francesco Cirillo","Role":"Coach - Programming With Francesco","Bio":"Francesco is currently working on three new books, \"The Waaaaaah! Decision Making Model\", \"Recombining Relational Production\", and \"Managing Software Development with RRP\".\r\nIn the 1980s, Francesco created the Pomodoro Technique. In the 1990s, he became known as an expert mentor of Object-Oriented Software Engineering and established his reputation as one of the pioneers of XP and Agile Methods.\r\nOver the years, Francesco has successfully trained and mentored hundreds of managers and developers throughout Europe on issues of productivity and the evolution of software.","Links":[{"Icon":"website","Url":"http://www.programmingwithfrancesco.com","Text":"http://www.programmingwithfrancesco.com"},{"Icon":"linkedin","Url":"http://de.linkedin.com/in/cirillof/","Text":"http://de.linkedin.com/in/cirillof/"},{"Icon":"twitter","Url":"","Text":"@progwithfc"}],"Sessions":[{"Id":"1108","Title":"Waaaaaah! - Sviluppare Software con la Produzione Relazionale Ricombinante (RRP)","TimeSlotId":"15:00/16:00","TrackId":"4","Abstract":"Sviluppare il software richiede migliaia di piccole decisioni da parte di noi sviluppatori. Quale criterio usiamo per fare il nostro prossimo passo? La consapevolezza di questo criterio è la chiave per la nostra produttività. Francesco presenterà un nuovo approccio allo sviluppo del software basato su questa forma di consapevolezza. Essere consapevoli delle nostre decisioni può farci scoprire nuovi modi di fare design e di organizzare il nostro team in modo produrre più feature con meno costi e in modo sostenibile.","Speaker":"Francesco Cirillo","SpeakerId":"663","Day":"Saturday"}]},{"Id":"1173","Name":"Francesco Malatesta","Role":"Founder - Laravel-Italia","Bio":"Francesco is a web developer and enthusiast with a focus on PHP and the Laravel Framework.  He is the Founder of Laravel-Italia.it, the Laravel official italian community. Francesco also writes for Sitepoint as an Author and had many other writing experiences. From the 2012 to 2014 he translated Laravel Code Bright, Laravel Code Happy and Laravel Testing Decoded. Actually he is working on his own first english book. About Laravel, of course. Francesco actually lives in Rome and studies Computer Engineering at \"La Sapienza\" University of Rome.","Links":[{"Icon":"website","Url":"http://www.hellofrancesco.com","Text":"http://www.hellofrancesco.com"},{"Icon":"linkedin","Url":"http://it.linkedin.com/pub/francesco-malatesta/30/b69/3a5","Text":"http://it.linkedin.com/pub/francesco-malatesta/30/b69/3a5"},{"Icon":"twitter","Url":"","Text":"@malatestafra"}],"Sessions":[{"Id":"1056","Title":"Loving Beautiful Code - Alla Scoperta di Laravel 5","TimeSlotId":"11:30/12:10","TrackId":"8","Abstract":"Laravel 4 ha portato una ventata d&#039;aria fresca nel mondo PHP. Adesso, nel 2015, l&#039;uscita di Laravel 5 segna un ulteriore punto di svolta. In questo talk Francesco introdurrà l&#039;ultima versione del Framework e spiegherà quanto è semplice creare applicazioni, in pochissimo tempo e con una sintassi piacevole ed espressiva. Verranno coperte tutte le basi necessarie ad iniziare a lavorare, partendo dal MVC arrivando ad Eloquent, il potente ORM in dotazione. Come degna conclusione, quindi, una veloce sessione di live coding per rendere l&#039;idea del vero livello di flessibilità di Laravel.","Speaker":"Francesco Malatesta","SpeakerId":"1173","Day":"Friday"}]},{"Id":"1151","Name":"Garann Means","Role":"JavaScript developer - freelance","Bio":"Garann began doing web development in 1997 and was drawn from the beginning to front-end development. While working in various languages at various companies, she watched JavaScript mature and eventually focused on that language and a speciality, using it in both client-side and server-side web dev. She also founded and led technical meetups and trainings, contributed articles to publications such as A List Apart, and is the author of one book, Node.js for Front-End Developers.","Links":[{"Icon":"website","Url":"http://garann.com","Text":"http://garann.com"},{"Icon":"linkedin","Url":"http://www.linkedin.com/in/garann","Text":"http://www.linkedin.com/in/garann"},{"Icon":"twitter","Url":"","Text":"@garannm"}],"Sessions":[{"Id":"1123","Title":"Progressive Enhancement for JavaScript Apps","TimeSlotId":"17:30/18:10","TrackId":"5","Abstract":"When progressive enhancement was introduced as a concept, JavaScript applications seemed as relevant as flying cars. As JS became more powerful, it seemed we&#039;d reach a point where we could forget PE entirely. For its original meaning, we now have rock-solid libraries and polyfills to provide abstractions that make PE easy. But as JS has advanced, we&#039;ve started writing things that can&#039;t be polyfilled. We know now how to progressively enhance widgets and user interactions. We&#039;ll talk about how we progressively enhance entire applications, and why it&#039;s more important than ever that we do so.","Speaker":"Garann Means","SpeakerId":"1151","Day":"Saturday"}]},{"Id":"92","Name":"Gianfranco Fedele","Role":"Web architect - Insem S.p.A.","Bio":"Web Software Analyst and Developer, I can cover all layers of development from database to services and user interfaces. Expert in Analysis, design and programming of databases. I collaborated in the development banking software, editorial software, management software. Speaker\r\n\r\nSpecialties: Web solutions, software and database architecture, data analisys, software development, software refactoring, database refactoring, verticalization, training.","Links":[{"Icon":"linkedin","Url":"http://it.linkedin.com/in/gianfrasoft&lrm;","Text":"http://it.linkedin.com/in/gianfrasoft&lrm;"},{"Icon":"twitter","Url":"","Text":"@gianfrasoft"}],"Sessions":[]},{"Id":"266","Name":"Giovanni Laquidara","Role":"Technical leader - GDG-Rome","Bio":"Software Engineer working in Air Traffic Control and Command & Control System development field. Active member in GDG-Rome and CodeInvaders Communities having fun developing Android and Web Application. Startupper in love with new and life changing technologies.  Digital Champion Tivoli. Work Hard Dance Hard ;)","Links":[{"Icon":"website","Url":"www.laquysoft.com","Text":"www.laquysoft.com"},{"Icon":"linkedin","Url":"http://www.linkedin.com/profile/view?id=9774768","Text":"http://www.linkedin.com/profile/view?id=9774768"},{"Icon":"twitter","Url":"","Text":"@joaolaq"}],"Sessions":[{"Id":"1061","Title":"Join The Dart Side Of Web Development 2 ( Use The Force )","TimeSlotId":"16:10/17:10","TrackId":"8","Abstract":"Hai seguito il precedente Talk su Dart a Codemotion Roma e Milano 2014? Ti ha incuriosito questo nuovo e potente linguaggio  &quot;battery included&quot; by Google?\r\nAllora proseguiamo questo viaggio all&#039;interno del Dartiverse, visiteremo insieme Polymer.Dart, Dart Force, e StageXL alcune tra la più potenti librerie per realizzare Web App davvero potenti in maniera semplice.","Speaker":"Giovanni Laquidara","SpeakerId":"266","Day":"Friday"}]},{"Id":"168","Name":"Giulio De Donato","Role":"CTO - Chupamobile","Bio":"Liuggio aka Giulio De Donato is a passionate open source developer, he works as CTO at Chupamobile .\r\nExpert in e-commerce platforms and Service Oriented Architecture, he is actively involved in the PHP community and Golang ecosystem.\r\nLatest projects that he has created is used by all the PHP repositories http://poser.pugx.org\r\n\r\nHe is known as evangelist of good design, cache and the data monitoring.\r\n\r\nSpeaker also in: SymfonyDay2012, PHPday 2013, SymfonyDay2013, SymfonyPortugal ...","Links":[{"Icon":"website","Url":"http://welcometothebundle.com","Text":"http://welcometothebundle.com"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/giuliodedonato/","Text":"http://it.linkedin.com/in/giuliodedonato/"},{"Icon":"twitter","Url":"","Text":"@liuggio"}],"Sessions":[{"Id":"1143","Title":"import Golang; struct microservices","TimeSlotId":"14:10/14:50","TrackId":"7","Abstract":"Se anni fa abbiamo pensato applicazioni complesse con in mente l’omonogeneità,oggi facilmente ci ritroveremo un accumulo disordinato di codice lento e difficile da mantenere.\r\n\r\nIl talk ci porta violentemente nel 2015, nel mondo dei microservizi, dove \r\nil vero protagonista è GOlang, che fa della sua filosofia il punto di forza.\r\n\r\nIn questo viaggio nelle buone pratiche e negli esempi di come implementare applicazioni modulari e pronte a crescere verranno installati nella testa concetti come  Rest, Websocket, Json Web Token, Docker, httptest ...","Speaker":"Giulio De Donato","SpeakerId":"168","Day":"Saturday"}]},{"Id":"1172","Name":"Giuseppe Laddomada","Role":"Cofounder and CPO - Travelchat","Bio":"I am the founder of Travelchat, an app that lets you chat with locals in real-time. \r\nIn the last years, I have been working as product manager in several Berlin startups (including Rocket Internet, MONOQI & bonusbox). Beforehand, I studied innovation at Copenhagen Business School and Stockholm School of Economics and I have a double master degree from CEMS.","Links":[{"Icon":"website","Url":"www.travelchat.it","Text":"www.travelchat.it"},{"Icon":"linkedin","Url":"https://it.linkedin.com/pub/giuseppe-laddomada/1a/2b5/55b","Text":"https://it.linkedin.com/pub/giuseppe-laddomada/1a/2b5/55b"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1073","Title":"How to create a product (Practical Guide)","TimeSlotId":"16:20/17:20","TrackId":"1","Abstract":"When developing a new product, two problems often arise:\r\n- Which features should be developed?\r\n- How to work with developers avoiding frustration?\r\n\r\nThe aim of the talk is to present a practical process to manage the development of new features. \r\nSpecifically, it illustrates the tricks that product managers use to navigate through the complexity of product development.\r\n\r\nThe process is described with practical examples and it is composed by 3 steps:\r\n1) Choosing the features \r\n2) Managing the development   \r\n3) Measuring the results","Speaker":"Giuseppe Laddomada","SpeakerId":"1172","Day":"Saturday"}]},{"Id":"834","Name":"Karl-Henrik Nilsson","Role":"Senior developer / Software architect - Sogeti","Bio":"Karl-Henrik is an experienced developer that have written code for anything from cellular network base stations to websites. He runs the local Microsoft competence network at Sogeti and spend a somewhat obsessive amount of his free time building smarter devices.\r\n\r\n\"If you ever need to see a man about building a smarter toaster - I&#039;m that guy\"\r\n\r\nPrevious speaking engagements at DevDay, IT-Arena, IT-Weekend and dozens of meetups,work and university talks.","Links":[{"Icon":"website","Url":"http://karl-henrik.se","Text":"http://karl-henrik.se"},{"Icon":"linkedin","Url":"http://se.linkedin.com/pub/karl-henrik-nilsson/12/560/778","Text":"http://se.linkedin.com/pub/karl-henrik-nilsson/12/560/778"},{"Icon":"twitter","Url":"","Text":"@khnilsson"}],"Sessions":[{"Id":"1017","Title":"Hacking your doorbell","TimeSlotId":"16:10/17:10","TrackId":"4","Abstract":"Interested in getting started reverse engineering hardware? In this talk we will take a look at how I took a regular doorbell and made it computer controlled, and how extremely simple it was! This talk asserts the possible technology choices for hardware hacking such as Arduino, Netduino,Raspberry PI and more, how basic reverse engineering of existing hardware is done (analysis, tools for analysis etc) and how to get started hacking hardware in a Microsoft/C# .NET  (well mostly) environment TODAY!","Speaker":"Karl-Henrik Nilsson","SpeakerId":"834","Day":"Friday"}]},{"Id":"1011","Name":"Kevlin Henney","Role":"Director - Curbralan","Bio":"Kevlin is an independent consultant and trainer based in the UK. His development interests are in patterns, programming, practice and process. He has been a columnist for various magazines and web sites, including Better Software and The Register. Kevlin is co-author of A Pattern Language for Distributed Computing and On Patterns and Pattern Languages, two volumes in the Pattern-Oriented Software Architecture series. He is also editor of 97 Things Every Programmer Should Know.","Links":[{"Icon":"website","Url":"http://kevlin.tel","Text":"http://kevlin.tel"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/kevlin","Text":"https://www.linkedin.com/in/kevlin"},{"Icon":"twitter","Url":"","Text":"@KevlinHenney"}],"Sessions":[{"Id":"1140","Title":"Functional Programming You Already Know","TimeSlotId":"11:40/12:20","TrackId":"7","Abstract":"From JVM to .NET languages, from minor coding idioms to system-level architectures, functional programming is enjoying a long overdue surge in interest. Functional programming is certainly not a new idea and, although not apparently as mainstream as object-oriented and procedural programming, many of its concepts are also more familiar than many programmers believe.\r\n\r\nThis talk examines functional and declarative programming styles from the point of view of coding patterns, little languages and programming techniques already familiar to many programmers.","Speaker":"Kevlin Henney","SpeakerId":"1011","Day":"Saturday"}]},{"Id":"998","Name":"Krasimir Tsonev","Role":"Front-end developer - TrialReach","Bio":"Krasimir Tsonev is a front-end developer, blogger and speaker. He loves writing JavaScript and experimenting with the latest CSS and HTML features. Author of the \"Node.js blueprints\" book he is focused on delivering cutting edge applications. At the moment Krasimir is working for TrialReach - London based health startup.","Links":[{"Icon":"website","Url":"http://krasimirtsonev.com/","Text":"http://krasimirtsonev.com/"},{"Icon":"linkedin","Url":"https://www.linkedin.com/profile/view?id=20145983","Text":"https://www.linkedin.com/profile/view?id=20145983"},{"Icon":"twitter","Url":"","Text":"@KrasimirTsonev"}],"Sessions":[{"Id":"1117","Title":"AbsurdJS - Hacking the front-end","TimeSlotId":"12:30/13:10","TrackId":"5","Abstract":"It&#039;s a talk about AbsurdJS (http://absurdjs.com/). JavaScript library that acts as a CSS and HTML preprocessor. At the same time is a template engine and client-side framework. The presentation is made of two parts. The first one presents the library and the second one is a real life example of its usage.","Speaker":"Krasimir Tsonev","SpeakerId":"998","Day":"Saturday"}]},{"Id":"749","Name":"Kuba Waliński","Role":"Senior Software Engineer - ABB","Bio":"Kuba started coding VB6 in middle school. Then he learned Pascal, C, C++, Java, PHP, Prolog, C#, JavaScript & Python. Even though he spent most of his 7+ year career as an ASP.NET/C# developer, lately he&#039;s taken a deep dive in the (fascinating) world of JavaScript, discovering the joy of functional programming in the process, which resulted in experimenting with F# and Clojure. Having worked in a number of very different work environments (startup, small enterprise, big corporation), Kuba benefits from being able to approach programming challenges from different perspectives.","Links":[{"Icon":"website","Url":"http://blog.kubawalinski.com/","Text":"http://blog.kubawalinski.com/"},{"Icon":"twitter","Url":"","Text":"@kubawalinski"}],"Sessions":[{"Id":"1141","Title":"Fun with Functional JavaScript","TimeSlotId":"12:30/13:10","TrackId":"7","Abstract":"It might be a surprise for some of you, but JavaScript can be regarded as a functional programming language. Why don&#039;t we use more functional programming concepts in our JavaScript code, then? In this talk you will learn how to start including some of them in your applications and when they might be particularly beneficial. You will also get familiar with libraries that extend the functional capabilities of JavaScript (lodash and FunctionalJS) and the upcoming ES6 features that make JavaScript even more functional.","Speaker":"Kuba Waliński","SpeakerId":"749","Day":"Saturday"}]},{"Id":"967","Name":"Luca Lanziani","Role":"Software Engineer - nearForm","Bio":"Software engineer,  developer, linux addict, hacker as http://bit.ly/hacker_def , passionate traveler, InnovAction Lab alumnus","Links":[{"Icon":"website","Url":"https://lanziani.com","Text":"https://lanziani.com"},{"Icon":"linkedin","Url":"uk.linkedin.com/in/lucalanziani","Text":"uk.linkedin.com/in/lucalanziani"},{"Icon":"twitter","Url":"","Text":"@_Nss_"}],"Sessions":[{"Id":"1059","Title":"Una lista di cose che potresti non sapere su Python","TimeSlotId":"14:00/14:40","TrackId":"8","Abstract":"Dopo più di due anni di Python ho stilato una lista di librerie e trucchi che mi aiutano nella mia attività di sviluppo quotidiano, lista che penso valga la pena di essere condivisa. Non siate timidi e venite a seguire il talk, potreste scoprire qualcosa di nuovo (o insegnare qualcosa di nuovo a me).","Speaker":"Luca Lanziani","SpeakerId":"967","Day":"Friday"}]},{"Id":"329","Name":"Lucia Zappacosta","Role":"Presidente - Metro Olografix","Bio":"Nata in Abruzzo nel 1980 è dottore di ricerca in “Culture, linguaggi e politica della comunicazione”. Dal 2008 collabora con gallerie d’arte e nel 2011 diventa direttore artistico dell&#039;Alviani ArtSpace spazio di ricerca sulle nuove frontiere del contemporaneo. Consulente per la comunicazione per diversi studi e agenzie, organizza grandi eventi culturali e creativi. A partire dal 1998 si occupa di temi alle evoluzioni nel web e dal 2012 è Presidente dell’Associazione Culturale telematica Metro Olografix.","Links":[{"Icon":"website","Url":"http://www.luciazappacosta.it","Text":"http://www.luciazappacosta.it"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/luciazappacosta","Text":"http://it.linkedin.com/in/luciazappacosta"},{"Icon":"twitter","Url":"","Text":"https://twitter.com/luciazappacosta"}],"Sessions":[{"Id":"1107","Title":"The Wolf Method. Dall&#039;Epic Fail al Problem Solving Creativo.","TimeSlotId":"14:10/14:50","TrackId":"4","Abstract":"Ogni problema può diventare un&#039;opportunità se sai come trasformarlo a tuo vantaggio. \r\nPassando da McGyver al Signor Wolf l’intervento si propone di rispondere a una delle sfide più impegnative poste dalla programmazione così come dalla vita: la necessità di acquisire insieme ai linguaggi anche una nuova mentalità orientata alla risoluzione dei problemi. \r\nIl Problem Solving può aiutare a trovare soluzioni non convenzionali alle difficoltà quotidiane, purché si conoscano le strategie logiche che non sono frutto di un improvviso atto di creatività ma sono basate su decodificate metodologie.","Speaker":"Lucia Zappacosta","SpeakerId":"329","Day":"Saturday"}]},{"Id":"145","Name":"Luigi Bennardis","Role":"System Manager - Poste Italiane","Bio":"Laurea in Scienze Statistiche e Economiche e certificato MCSD. \r\nDal 2007 in Poste Italiane. Attualmente Information Sistem Manager, già Architetto IT (MS-J2EE) e Configuration Manager(Change Management-continuus integration-build automation). \r\nIn Banksiel per dieci anni come Operation Manager, incaricato nel rilascio di soluzioni applicative e di sicurezza per banche.\r\nNelle le precedenti esperienze in ISTAT e in Sistemi Informativi ha svolto il ruolo di sviluppatore OOP e di IT Solution Architect in tecnologie Java e Microsoft. Dal 2009 ha pubblicato una quindicina di articoli su Mokabyte.","Links":[{"Icon":"linkedin","Url":"http://it.linkedin.com/pub/luigi-bennardis/2/6a7/a5","Text":"http://it.linkedin.com/pub/luigi-bennardis/2/6a7/a5"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1159","Title":"Java EE facile con Spring Boot","TimeSlotId":"17:30/18:10","TrackId":"8","Abstract":"Costruiamo con Spring Boot una applicazione Java EE con transazioni multiple JDBC-JMS utilizzando  H2 e HornetQ (embedded in memory), il supporto di autoconfiguration JAX-RS (Jersey), le annotazioni JSR 250 per i lifecycle hooks, e le annotazioni JSR 330 utilizzabili per AS proprietari e per la portabilità in container di dependency injection come Spring. Per finire distribuiremo su Undertow embedded HTTTP server, su un AS standalone (Apache TomEE) e come PAAS su Cloud Foundry.","Speaker":"Luigi Bennardis","SpeakerId":"145","Day":"Saturday"}]},{"Id":"141","Name":"Luigi Dell Aquila","Role":"project manager - Orient Technologies LTD","Bio":"Computer engineer, Open Source enthusiast, technology addicted.\r\nProgramming languages, tools and frameworks are my toy box.\r\nICT consultant in the rest of the time.","Links":[{"Icon":"twitter","Url":"","Text":"@ldellaquila"}],"Sessions":[{"Id":"1157","Title":"Fully Reactive - from Data to UI with OrientDB + Node.js + Socket.io","TimeSlotId":"16:20/17:20","TrackId":"8","Abstract":"Having both a reactive application layer and front-end is just not enough anymore. Today&#039;s reality demands a fully reactive architecture where all the layers, including the database, are able to interact with each other using a paradigm. In this presentation, you&#039;ll learn how to build a fully reactive application in a few minutes with just a few lines of code resulting in every database change propagating asynchronously between the application layer and the front-end.","Speaker":"Luigi Dell Aquila","SpeakerId":"141","Day":"Saturday"}]},{"Id":"513","Name":"Mandy Waite","Role":"Developer Advocate - Google","Bio":"Mandy works at Google as a Developer Advocate for Google Cloud Platform and is working to make the world a better place for developers building applications for the Cloud. She came to Google from Sun Microsystems where she worked with partners on performance and optimisation of large scale applications and services before moving on to building an ecosystem of Open Source applications for OpenSolaris. In her spare time she is learning Japanese and plays the guitar.","Links":[{"Icon":"website","Url":"developers.google.com","Text":"developers.google.com"},{"Icon":"twitter","Url":"","Text":"@tekgrrl"}],"Sessions":[{"Id":"1048","Title":"From Docker To Kubernetes: A Developer&#039;s Guide To Containers","TimeSlotId":"14:00/14:40","TrackId":"7","Abstract":"Everyone is talking about Containers, but mostly in the context of how they work and not why and when they are useful or how to apply them to your own often complex and unique Use Cases. We&#039;ll start by looking at how Docker works by manually creating a simple guestbook application using Docker Containers running Redis and PHP.  We&#039;ll then use the same application to show how you can use Kubernetes and Google Container Engine to create a cluster of nodes, declare to that cluster what you expect it to do, and then have the cluster assign resources as needed, run your work, recover from failures.","Speaker":"Mandy Waite","SpeakerId":"513","Day":"Friday"}]},{"Id":"376","Name":"Marco  Casario","Role":"CTO - Comtaste","Bio":"Marco has been passionate about programming since he was little more than a child and used to program games in Basic for Commodore 64 before dedicating himself, while still very young, to innovative projects for the web using Javascript and Flash.\r\nIn 2005, Marco has founded Comtaste (www.comtaste.com), a company dedicated to exploring new frontiers in Rich Internet and Mobile Applications and the convergence between the web and the world of mobile devices.\r\n\r\nHe is author of the following book projects: HTML 5 Solutions,  CSS3 Solutions,  Flex 4 Cookbook, AIR Cookbook, and many more.","Links":[{"Icon":"website","Url":"www.comtaste.com","Text":"www.comtaste.com"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/marcocasario","Text":"http://it.linkedin.com/in/marcocasario"},{"Icon":"twitter","Url":"","Text":"@marcocasario"}],"Sessions":[{"Id":"1037","Title":"Every millisecond counts: Techniques, strategies, and tools for a Web Performance Jedi Wannabe","TimeSlotId":"14:00/14:40","TrackId":"6","Abstract":"Developers, Designers, and Project Managers love to promise high performance for their web apps.\r\nBut they know they&#039;re lying. In fact most of the websites fail from a performance point of view.\r\nIn this talk I focus on every aspect and strategy that you have to consider to to fulfill the promise: performance metrics, measurements and monitoring strategy, optimization best practices, the paradox of third-party content, image rendering, browser performance tools.\r\n\r\nWith one goal in mind: finding small changes that led to some of the biggest performance gains.","Speaker":"Marco  Casario","SpeakerId":"376","Day":"Friday"}]},{"Id":"506","Name":"Marco Cecconi","Role":"Software Developer - Stack Exchange","Bio":"Marco Cecconi è uno sviluppatore per Stack Overflow e presenta talk su architettura e sviluppo. \r\nItaliano di origine, è nomade da qualche anno. Ha studiato a Singapore, lavorato in Francia, Portogallo, ed ora in UK dove vive con moglie e figlio da qualche anno.\r\n\r\nCome speaker ha parlato di Stack Overflow e programmazione a dozzine di conferenze internazionali, incluse keynote a Community Days Milano e QCon Pechino, talk a QCon Tokyo, Øredev Malmö, {codemotion} e molte ancora.\r\n\r\nÈ noto come Sklivvz su twitter e Stack Exchange dove ha contribuito dall&#039;inizio e è stato moderatore dal 2011.","Links":[{"Icon":"website","Url":"http://sklivvz.com","Text":"http://sklivvz.com"},{"Icon":"twitter","Url":"","Text":"sklivvz"}],"Sessions":[{"Id":"1080","Title":"Stack Overflow - obiettivo performance","TimeSlotId":"11:40/12:20","TrackId":"2","Abstract":"Stack Exchange è uno dei 50 maggiori network al mondo ed è sviluppato con l&#039;obiettivo di essere il sito più veloce in assoluto. \r\nNel talk racconto:\r\n* L&#039;architettura fisica di Stack Overflow. Quanti server abbiamo? A cosa servono e cosa sono le loro spec?\r\n* L&#039;architettura logica del software. Come scaliamo? Quali sono i pezzi principali dell&#039;applicazione?\r\n* Il sistema di tool. Cosa usiamo per sostenere la nostra filosofia di &quot;extreme optimization&quot;?\r\n* Il team di sviluppo. Quali sono i nostri valori fondamentali? Che impronta volgiamo lasciare come sviluppatori?","Speaker":"Marco Cecconi","SpeakerId":"506","Day":"Saturday"}]},{"Id":"991","Name":"Marco Trevisan","Role":"Software Engineer - Canonical Ltd","Bio":"A technology enthusiast since his first steps, Marco got soon caught by the Free Software world as an unique way to learn the art of programming from the deep and for a good cause.\r\nSo, he invested all his energies and curiosity to improve the open source world, scratching his own itches and contributing to various projects, which finally lead him to Ubuntu.\r\n\r\nDuring the years Marco has been involved in various FLOSS projects such as Compiz, Openmoko, SHR, Enlightenment, GNOME (vala, gtk, libwnck…), to which he can now continue to contribute by working at Canonical as Software Engineer for Unity","Links":[{"Icon":"website","Url":"http://www.3v1n0.net","Text":"http://www.3v1n0.net"},{"Icon":"linkedin","Url":"https://www.linkedin.com/profile/view?id=119380100","Text":"https://www.linkedin.com/profile/view?id=119380100"},{"Icon":"twitter","Url":"","Text":"@3v1n0"}],"Sessions":[{"Id":"997","Title":"Ubuntu phone, smart from the source (code)","TimeSlotId":"10:00/11:00","TrackId":"3","Abstract":"Un&#039;introduzione al mondo di Ubuntu Touch, il nuovo sistema operativo mobile che fa della convergenza la sua bandiera, creato da Canonical e dalla comunità di Ubuntu, proponendo un nuovo modello realmente aperto e basato su nuove tecnologie che cercano di rivedere i paradigmi del passato.\r\n\r\nSi parlerà di sviluppo di applicazioni, dei suoi framework, della sicurezza.","Speaker":"Marco Trevisan","SpeakerId":"991","Day":"Friday"}]},{"Id":"485","Name":"Mario Fusco","Role":"Software Engineer - Red Hat","Bio":"Mario is a senior software engineer at Red Hat working at the development of the core of Drools, the JBoss rule engine. He has a huge experience as Java developer having been involved in (and often leading) many enterprise level projects in several industries ranging from media companies to the financial sector. Among his interests there are also functional programming and Domain Specific Languages. He is also the co-author of \"Java 8 in Action\" published by Manning.","Links":[{"Icon":"twitter","Url":"","Text":"@mariofusco"}],"Sessions":[]},{"Id":"1020","Name":"Mathias Buus","Role":"hacker - dat","Bio":"Mathias is a Node.js hacker from Copenhagen, Denmark.\r\nHe is a core contributor to the open data project, dat and tends to write a bunch of npm modules whenever he has time.\r\nRecently he&#039;s been working a lot with new ways of replicating of single purpose databases using leveldb and other mad science projects.","Links":[{"Icon":"twitter","Url":"","Text":"@mafintosh"}],"Sessions":[{"Id":"987","Title":"Good artists copy; Great artists replicate","TimeSlotId":"10:00/11:00","TrackId":"2","Abstract":"Let&#039;s talk about replication.\r\n\r\nDatabase replication is probably one of the most misunderstood things in computer science.\r\nSome argue that mongodb&#039;s way is the best. Some argue postgres. Some prefer emailing zips of database dumps around the office.\r\n\r\nIn general, replication is a *really hard* problem. However, it is actually pretty simple if you are willing to accept some trade-offs.\r\n\r\nThis talk will be a hands on approach about investigating how we can make replication simpler by building specialized databases. There will be lots of demos.","Speaker":"Mathias Buus","SpeakerId":"1020","Day":"Friday"}]},{"Id":"524","Name":"Mathilde Lemée","Role":"CTO - Aetys","Bio":"After Mathilde Lemee joining Software AG (Terracotta) in 2012 as a R&D engineer working on ehcache and bigmemory, Mathilde now work as a freelancer. She co-founded the Duchess France Chapter, an organization to connect and give visibility to women in Java technology, in 2010, where she organised a lot of events (Hadoop, Mahout, Mockito, Cache …). She blogs on http://www.java-freelance.fr about performance, best practices and testing. She is a regular open source commuter and creator ofFluentLenium, a wrapper around Selenium that provide a Fluent API which is used in others open source project,","Links":[{"Icon":"website","Url":"http://www.java-freelance.fr","Text":"http://www.java-freelance.fr"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/mathildelemee/en","Text":"https://www.linkedin.com/in/mathildelemee/en"},{"Icon":"twitter","Url":"","Text":"@MathildeLemee"}],"Sessions":[{"Id":"1077","Title":"Let&#039;s talk about the cache !","TimeSlotId":"09:00/10:00","TrackId":"2","Abstract":"We all know that caching is a solution for developers to increase the performance of an application. We will start by presenting the JSR-107 terminology and the most important cache patterns. Some use cases will also be discussed and you will see how you can scale your cache from a single node to a multi node cluster. If you are a beginners in caching or if the words Cache Aside, Write-Behind, Read/Write Through doesn’t means anything to you or if you are interesting about high availabilty and scalable architecture, that this is the place to be !","Speaker":"Mathilde Lemée","SpeakerId":"524","Day":"Saturday"}]},{"Id":"1050","Name":"Matteo Antony Mistretta","Role":"Mobile Projects Tech Lead - Seat PagineGialle S.p.A.","Bio":"Software engineer, failed musician and digital craftsman, but most of all vehicle for the propagation of memes, Antony loves his job and loves bragging about it. He thinks that a master&#039;s degree in computer engineering is sufficient to save the world.","Links":[{"Icon":"linkedin","Url":"https://www.linkedin.com/in/antonymistretta","Text":"https://www.linkedin.com/in/antonymistretta"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1083","Title":"The Fast and The Mobile","TimeSlotId":"14:10/14:50","TrackId":"2","Abstract":"Frameworks such as AngularJS and Polymer are great tools for building complex systems with less coding. But what if your client wants ultra-high performance? This talk shows you how to deal with some lower-level decisions in order to achieve a solid architecture and a highly performant JavaScript on mobile web applications using some old friends like Backbone, RequireJS, Mustache and a lot of trial-and-error. The examples shown are based on PagineGialle&#039;s mobile webapp, whose performance impressed Google Italy.","Speaker":"Matteo Antony Mistretta","SpeakerId":"1050","Day":"Saturday"}]},{"Id":"167","Name":"Matteo Collina","Role":"Architect - nearForm","Bio":"Matteo is a code pirate and mad scientist. He spends most of his days programming in node.js, but in the past he worked with Ruby, Java and Objective-C. He recently defended his a Ph.D. thesis titled \"Application Platforms for the Internet of Things\". Now he is a Software Architect at nearForm, working on the nscale deployer. Matteo is also the author of the Node.js MQTT Broker, Mosca and of the LevelGraph database. Matteo spoke at several international conferences: Nodeconf.eu, LXJS, Distill by Engine Yard, and JsDay to name a few. In the summer he loves sailing the Sirocco.","Links":[{"Icon":"website","Url":"www.matteocollina.com","Text":"www.matteocollina.com"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/matteocollina","Text":"http://it.linkedin.com/in/matteocollina"},{"Icon":"twitter","Url":"","Text":"@matteocollina"}],"Sessions":[{"Id":"979","Title":"NO. La sottile arte di trovare il tempo dove non esiste.","TimeSlotId":"11:30/12:10","TrackId":"1","Abstract":"Non abbiamo mai tempo per fare nulla. Quante volte avete detto: &quot;Vorrei rilasciare un progetto Open Source&quot; oppure &quot;Vorrei studiare Obj-C e imparare a fare App!&quot;. E poi andate su GitHub e trovate persone che hanno rilasciato o contributo a CENTINAIA di progetti, conoscono 6-7 linguaggi di programmazione diversi e parlano a conferenze in giro per l&#039;Italia e l&#039;Europa. Come fanno a gestire il tempo? Sono più bravi di noi? NO è la risposta.","Speaker":"Matteo Collina","SpeakerId":"167","Day":"Friday"}]},{"Id":"908","Name":"Matteo guidotto","Role":"PM & Frontend Developer - Intesys","Bio":"Nato nell&#039;umida laguna veneta, svezzato come developer nella campagna trevigiana grazie ad E-TREE, da tre anni a questa parte vivo e lavoro a Verona occupandomi più che di tecnologia, di persone. Project Management, User Experience ma anche formazione dei dipendenti e organizzazione di corsi.\r\n\r\nSono cofondatore di FEVR - Fronteders Verona, uno usergroup che si pone come riferimento a 180 gradi su tutti i temi riguardanti interfaccia: frontenddev, ux, pm, ia, design; dal 2014 faccio parte dell&#039;organizzazione di TEDXVerona.","Links":[{"Icon":"website","Url":"http://www.matteoguidotto.com","Text":"http://www.matteoguidotto.com"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/matteoguidotto","Text":"https://www.linkedin.com/in/matteoguidotto"},{"Icon":"twitter","Url":"","Text":"@j8matteo"}],"Sessions":[{"Id":"1119","Title":"lean frontend development","TimeSlotId":"14:10/14:50","TrackId":"5","Abstract":"Il processo di maturazione dello sviluppo frontend passa per l&#039;adozione di metodologie agili e \r\nlean, vedremo una sequenza di tecniche e di metodologie per alleggerirlo, costruendo il nostro mvp \r\nin maniera modulare e realizzando progetti più scalabili","Speaker":"Matteo guidotto","SpeakerId":"908","Day":"Saturday"}]},{"Id":"1146","Name":"Matteo Pagani","Role":"Support Engineer - Microsoft","Bio":"I’m a developer with a strong passion about mobile development and, especially, the Windows and Windows Phone platforms. A passion that I love to share with the communities as a blogger, book writer and speaker in many national and international conferences. I&#039;m one of the founders of the community DotNetLombardia, I’ve been a Nokia Developer Champion and a Microsoft MVP for almost 5 years, until in November 2014 I joined Microsoft as a Support Engineer for the App Consult program to support Windows Store developers.","Links":[{"Icon":"website","Url":"http://wp.qmatteoq.com","Text":"http://wp.qmatteoq.com"},{"Icon":"twitter","Url":"","Text":"@qmatteoq."}],"Sessions":[{"Id":"999","Title":"Xamarin Forms: one technology to rule them all","TimeSlotId":"11:30/12:10","TrackId":"3","Abstract":"Xamarin Forms è la nuova tecnologia introdotta da Xamarin per supportare lo sviluppo multi piattaforma di applicazioni per iOS, Android e Windows Phone utilizzando un unico linguaggio di design (lo XAML) e di sviluppo (C#). Nel corso di questa sessione vedremo le basi di questa piattaforma, gli scenari in cui è adatta e quelli in cui lo è di meno e una serie di preziosi consigli, nati dall&#039;esperienza maturata nello sviluppo di un&#039;importante progetto.","Speaker":"Matteo Pagani","SpeakerId":"1146","Day":"Friday"}]},{"Id":"875","Name":"Matteo Scandolo Giovanni Lela","Role":"SEO - LinkMe","Bio":"LinkMe nasce nel 2009 e si rinnova nel 2013, seguendo le idee imprenditoriali di Juri Di Natale, uno dei soci fondatori. \r\nSiamo una società giovane, dinamica e agile.\r\nQuello tecnologico è un settore in rapida evoluzione. Per mantenere un vantaggio competitivo, le società sono obbligate ad adattarsi in modo flessibile. Il metodo di lavoro di LinkMe è agile e privo di sovrastrutture, per semplificare il client management e alleggerire i costi. Abbiamo creato una infrastruttura cloud che ci consente di lavorare senza confini e in completa libertà.","Links":[{"Icon":"website","Url":"http://linkme.it/","Text":"http://linkme.it/"},{"Icon":"twitter","Url":"","Text":"@LinkMeSRL"}],"Sessions":[{"Id":"1149","Title":"RealTime Ninja - Hands on MEAN","TimeSlotId":"09:00/10:00","TrackId":"8","Abstract":"Il talk sarà diviso in due parti.Nella prima analizzeremo brevemente le peculiarità di Node.js (e simili), le ragioni del suo successo e i domini applicativi di questo tipo di tecnologia. Vedremo anche cosa può aspettarsi uno sviluppatore frontend deciso a fare il grande passo e a cominciare a usare Javascript anche sul server. Nella seconda svilupperemo passo passo un servizio di API/REST in NodeJs, persistendo i dati su un database non relazionale (MongoDB). Sarà spiegato come impostare l’applicazione, definire rotte, middleware e modelli e infine come implementare notifiche realtime.","Speaker":"Matteo Scandolo Giovanni Lela","SpeakerId":"875","Day":"Saturday"}]},{"Id":"359","Name":"Matteo Valoriani","Role":"CEO - FifthIngeniunm","Bio":"Matteo Valoriani obtained the Master of Science cum Laude in Computer Engineering at Politecnico di Milano in 2011. He worked for two years at Microsoft Italy, but in 2012 he decided to follow his passion for technology and innovation and started a PhD in Computer Science. His research activity focuses on new unconventional technologies and paradigms for ambient interaction, as well as voice commands, touch and touchless gestures, proxemic Interactions. Matteo is Microsoft MVP for Kinect and Intel Software Innovator for RealSense. In 2014, he founded FifthIngeniun, focused on IT innovation.","Links":[{"Icon":"website","Url":"http://www.fifthingenium.com/","Text":"http://www.fifthingenium.com/"},{"Icon":"linkedin","Url":"https://www.linkedin.com/profile/view?id=60857524&amp;trk=spm_pic","Text":"https://www.linkedin.com/profile/view?id=60857524&amp;trk=spm_pic"},{"Icon":"twitter","Url":"","Text":"@MatteoValoriani"}],"Sessions":[{"Id":"1071","Title":"Tecnologie e Startup: ICT &egrave; solo una commodity?","TimeSlotId":"15:00/16:00","TrackId":"1","Abstract":"Questa sessione vuole affrontare il tema della tecnologia e come questa possa essere una leva fondamentale per le nuove Startup. Nella prima parte saranno discussi i maggiori trend di mercato: le tecnologie più in voga e ricercate, quelle già mature e consolidate e quelle che sono in fase calante ma che avranno un alto impatto in futuro. Nella seconda parte mostrerò alcuni tool e tecniche che possono migliorare la gestione del lavoro di una start-up introducendo meccanismi di sviluppo agili.","Speaker":"Matteo Valoriani","SpeakerId":"359","Day":"Saturday"}]},{"Id":"93","Name":"Michele Finelli","Role":"Socio - BioDec","Bio":"laureato in informatica nel 1995, studia per un ph.d., ma non lo termina: dal 1997 libero professionista e dal 2003 socio BioDec, la prima azienda bioinformatica italiana\r\n\r\nsiamo sicuri che nel 2014 serva descrivere la propria biografia ?","Links":[{"Icon":"website","Url":"http://www.biodec.com","Text":"http://www.biodec.com"},{"Icon":"linkedin","Url":"http://www.linkedin.com/in/mfinelli","Text":"http://www.linkedin.com/in/mfinelli"},{"Icon":"twitter","Url":"","Text":"@gaunilone"}],"Sessions":[{"Id":"995","Title":"Monitoraggio, logging e alerting moderni","TimeSlotId":"17:20/18:00","TrackId":"2","Abstract":"Gestire un&#039;infrastruttura sembra un&#039;attività arida e ripetitiva, ma non\r\ne così: negli ultimi anni sono stati sviluppati sempre piu software\r\nfree alternativi alle soluzioni consolidate.\r\n\r\nGrazie ai sistemi cloud e alla virtualizzazione, nei prossimi anni\r\nsarà necessario dotarsi di strumenti efficaci per gestire la\r\ncomplessità di un&#039;infrastruttura distribuita, e gli strumenti che\r\nabbiamo adesso a disposizione possono rendere questa attività\r\ngratificante ... anche da un punto di vista estetico !","Speaker":"Michele Finelli","SpeakerId":"93","Day":"Friday"}]},{"Id":"413","Name":"Nino Guarnacci","Role":"BDM - Oracle","Bio":"Passion for innovation and Information Technology coupled with extensive experience has given me a straightaway approach to Enterprise Architecture: from Mobile, Integration System and Applications Architectures to full project life cycle definitions.Experience in meeting challenging deadlines and targets as a project manager improved my professional and competencies, problem solving and decision making skills, particularly in highly complex distributed scenarios. Work-Travelling all around the world thanks to my past experience in BEA and now in Oracle help me to catch new idea and trend.","Links":[{"Icon":"website","Url":"http://www.ninoguarnacci.net","Text":"http://www.ninoguarnacci.net"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/spiderweb","Text":"http://it.linkedin.com/in/spiderweb"},{"Icon":"twitter","Url":"","Text":"@ninoguarnacci"}],"Sessions":[{"Id":"1015","Title":"Sviluppo IoT - Un approccio standard da Nerd ad Impresa, prove pratiche di Mesh","TimeSlotId":"14:00/14:40","TrackId":"4","Abstract":"Gli anni passati a veder nascere e crescere tecnologie e tendenze ci aiutano a comprendere come l&#039;Internet delle Cose sia diventata matura per il mercato delle imprese. L’intervento, che include una panoramica sulle tendenze attuali e future dell’IoT, è centrato sullo sviluppo di soluzioni basate su standard industriali in ascesa (eg. Z-Wave), mettendo in evidenza gli inevitabili vantaggi e limiti derivanti dall’adozione di una metodologia industriale: solo un approccio industriale può rappresentare il vero e proprio salto di qualità per proporre prodotti efficaci per un mercato a doppia cifra","Speaker":"Nino Guarnacci","SpeakerId":"413","Day":"Friday"}]},{"Id":"1062","Name":"Orlando K","Role":"API Overlord - Mashape","Bio":"I am a keen software developer who likes APIs a whole lot - I often go to hackathons during weekends to release my inner passion for new ideas and quick code writing/prototyping. Occasionally watch sport on TV, but only if it&#039;s a major event.","Links":[{"Icon":"twitter","Url":"","Text":"@orliesaurus"}],"Sessions":[{"Id":"982","Title":"Building Successful APIs Overnight","TimeSlotId":"14:00/14:40","TrackId":"1","Abstract":"Hackathons have boomed, people attending such events have been consuming thousands of APIs to power their creative projects. However, not everyone can consume APIs like a boss. Companies spend hundreds of thousands of dollars in promoting and ensuring best practices are followed when building APIs.\r\nIn this talk I will give you an overview of how to build a potentially successful API overnight, like hackathoneers do. A recipe for success as a takeaway from this talk will be shared.\r\nTopics covered: Evolution of APIs, Hackathons, REST API Frameworks, API Design, API Editors, API Management","Speaker":"Orlando K","SpeakerId":"1062","Day":"Friday"}]},{"Id":"977","Name":"Pete Smith","Role":"Director - One and Three Consulting Ltd","Bio":"\u0001Pete is a software consultant based in London with almost 10 years of experience making web applications with Asp.Net, specialising in API design and Javascript browser-based applications. He is the author of Superscribe - a graph based routing framework, and the OData library Linq to Querystring.","Links":[{"Icon":"website","Url":"http://roysvork.wordpress.com","Text":"http://roysvork.wordpress.com"},{"Icon":"twitter","Url":"","Text":"@roysvork"}],"Sessions":[{"Id":"1093","Title":"Beyond responsive design - UI for the modern web application","TimeSlotId":"12:30/13:10","TrackId":"3","Abstract":"Applications written for the modern web are being consumed not just on desktops, but also on a myriad of other devices... even watches and glasses. If you design your application with a pc screen in mind, you&#039;re either cutting your userbase in half or setting yourself up for an expensive redesign. In this talk I&#039;ll introduce you to some modern web design constructs, and the technologies that bring them to life. Learn how to create apps for phone, mobile and desktop with no extra effort, and without restrictive layout frameworks. Web has finally caught up with native apps... the future is now!","Speaker":"Pete Smith","SpeakerId":"977","Day":"Saturday"}]},{"Id":"1101","Name":"Philipp Krenn","Role":"DevOps - ecosio GmbH","Bio":"Philipp Krenn is running everything database related and the general infrastructure of the Vienna based B2B startup ecosio. When not fighting MongoDB, MySQL, Jenkins, or AWS, he is giving NoSQL and cloud computing trainings or organizes his meetups ViennaDB and Papers We Love Vienna.","Links":[{"Icon":"website","Url":"https://xeraa.net","Text":"https://xeraa.net"},{"Icon":"linkedin","Url":"http://at.linkedin.com/in/philippkrenn/","Text":"http://at.linkedin.com/in/philippkrenn/"},{"Icon":"twitter","Url":"","Text":"@xeraa"}],"Sessions":[{"Id":"1155","Title":"nginx for fun and performance","TimeSlotId":"14:10/14:50","TrackId":"8","Abstract":"Is it fast yet? Performance is getting ever more important and using nginx is one of the easiest hacks to make your system faster.\r\nThis talk takes a look at why and how nginx is so fast — it&#039;s all about being event-driven. Additionally, we discuss where you can make use of nginx&#039;s power, specifically for terminating SSL connections, providing a load balancer or proxy, and to run static websites as well as dynamic web-applications with PHP.","Speaker":"Philipp Krenn","SpeakerId":"1101","Day":"Saturday"}]},{"Id":"1183","Name":"Pietro Scarpino","Role":"Competence Center Manager - NTT Data","Bio":"Pietro holds a Degree in Information Technology at University of Calabria. \r\nHis current position is Mobility & Innovation Competence Center Manager at NTT DATA ATSC, located in Cosenza. The competence center born with the mission to detect Innovation in the new IT paradigms, Improve mobility projects delivery capability, support NTT DATA mobility strategy and contribute to NTT DATA global R&D strategy by collaborating with NTT DATA Corporation in Japan on Innovative topics like Mobile Security, Wearable and IoT. \r\nHis main areas of activities are:  Mobility, IoT,  Innovation, Cyber Security.","Links":[{"Icon":"linkedin","Url":"https://www.linkedin.com/in/pietroscarpino","Text":"https://www.linkedin.com/in/pietroscarpino"},{"Icon":"twitter","Url":"","Text":"@piscarpi"}],"Sessions":[{"Id":"1027","Title":"Rendere sicure le esperienze dell&#039;individuo nel mondo digitale allargato","TimeSlotId":"14:50/15:50","TrackId":"5","Abstract":"La User Experience si evolve guidata delle opportunità tecnologiche (Mobility, Active Spaces, Internet delle Cose, Wearable, ...). I nuovi servizi coinvolgono un sempre maggior numero di utenti e di Smart Objects. I volumi e la complessità degli scenari determinano una serie di nuove vulnerabilità che attirano l&#039;interesse di un Cyber-crimine sempre più determinato e sofisticato. Riconoscere il rischo e sviluppare di conseguenza soluzioni &quot;sicure&quot; è il primo, fondamentale elemento per contribuire a mitigare il quadro complessivo della minaccia tecnologica.","Speaker":"Pietro Scarpino","SpeakerId":"1183","Day":"Friday"}]},{"Id":"1164","Name":"Richard Rodger","Role":"CTO - nearForm","Bio":"Richard Rodger is the CTO of nearForm.com, a Node.js consultancy that builds large-scale systems. Richard is the author of Mobile Application Development in the Cloud (Wiley 2012), and was formerly CTO of feedhenry.com, a mobile applications platform. He is a regular contributor to the Sunday Business Post newspaper in Ireland, and holds degrees in Mathematics and Philosophy, and Computer Science.","Links":[{"Icon":"website","Url":"http://richardrodger.com","Text":"http://richardrodger.com"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/richardrodger","Text":"https://www.linkedin.com/in/richardrodger"},{"Icon":"twitter","Url":"","Text":"@rjrodger"}],"Sessions":[{"Id":"989","Title":"Measuring Micro-services","TimeSlotId":"11:30/12:10","TrackId":"2","Abstract":"Micro-service systems deliver wonderful adaptability to business needs, easy scalability, and low-risk deployment. What&#039;s not to like?\r\nYou also end up with a system that&#039;s hard to understand, measure and predict. Traditional approaches to monitoring simply aren&#039;t powerful enough to handle the emergent properties of a system with lots of moving parts.\r\nThe solution is to apply the scientific method! Anything can be measured. Uncertainty can be reduced, and stability can be an emergent property. We just have to learn the lessons that the natural world can teach us.","Speaker":"Richard Rodger","SpeakerId":"1164","Day":"Friday"}]},{"Id":"1169","Name":"Roberto Collina","Role":"Marketing Manager - Aibotix Italia","Bio":"Behind Aibotix Italia is an international, dynamic team with one great thing in common: the passion for artificial intelligence and robotics. Hence the company’s name AIBOTIX consists of AI for Artificial Intelligence and BOTIX for Robotics.  With creativity, expertise and passion we explore every day the boundaries of robotics and artificial intelligence anew. Our goal: the development of intelligent, computer-controlled devices that make our work and lives easier and safer.  Our core product is the flying robot Aibot X6.","Links":[{"Icon":"website","Url":"http://www.aibotixitalia.it","Text":"http://www.aibotixitalia.it"},{"Icon":"linkedin","Url":"Public Profile Update your public profile settingsit.linkedin.com/pub/roberto-collina/67/561/a24/en","Text":"Public Profile Update your public profile settingsit.linkedin.com/pub/roberto-collina/67/561/a24/en"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"980","Title":"In Flight Data Fusion. Drones How To and Why","TimeSlotId":"12:20/13:00","TrackId":"1","Abstract":"No one doubts that a drone flights. We will show what there is behind the data fusion of all the data from the single sensors  and how/why the drones use them for flight functionality.\r\nToday drones are &quot;isolated systems&quot; with and high need of ideas and software developments to be part of a more integrated world.","Speaker":"Roberto Collina","SpeakerId":"1169","Day":"Friday"}]},{"Id":"52","Name":"Roberto Franchini","Role":"Senior Sw Engineer - CELI s.r.l.","Bio":"Comincia con il C64 e non si ferma più.  \r\nDa 7 anni lavora per CELI (http://celi.it) dove si occupa di NLP, big data, scalabilità.  \r\nPer BlogMeter (http://www.blogmeter.it/) ha curato lo sviluppo dei back-end di analisi linguistica, concentrandosi sugli aspetti di  scalabilità del sw e della intera infrastruttura hw,  garantendo al sistema la possibilità  di analizzare più di 3 milioni di documenti al giorno. \r\nFa parte del gruppo di coordinamento del JUG Torino.","Links":[{"Icon":"linkedin","Url":"http://www.linkedin.com/in/robfrank","Text":"http://www.linkedin.com/in/robfrank"},{"Icon":"twitter","Url":"","Text":"@robfrankie"}],"Sessions":[{"Id":"1046","Title":"GlusterFS : un file system open source per i big data di oggi e domani","TimeSlotId":"12:20/13:00","TrackId":"7","Abstract":"GlusterFS (www.gluster.org) è un file system distribuito open source, scalabile  fino ai petabytes.\r\nLa presentazione ha lo scopo di mostrare le feature di questo FS e la nostra esperineza, che parte nel 2010 con un  cluster da 4TB all&#039;odierno da 30TB: perchè è stato scelto, principali features, evoluzione, fallimenti (anche quelli), futuro.  \r\nAlcune feature: accesso in user-space, protocolo nativo, NFS, SMB .  Replicazione, distribuzione, striping dei file o una loro  combinazione (e.g: distributed striped replicated).  All&#039;interno dell&#039;ecosistema Hadoop può sostituire HDFS.","Speaker":"Roberto Franchini","SpeakerId":"52","Day":"Friday"}]},{"Id":"1073","Name":"Robin Johnson","Role":"Developer Evangelist - SendGrid","Bio":"A Polyglot Programmer and Developer Evangelist at SendGrid, currently working amongst the world-wide developer community to ease the adoption of Email API technology. Having spoken at some of the world&#039;s leading technical conferences, Robin is building his way to being a player in the London tech scene; attending, speaking at, and even helping organise multiple large events.  Mentoring on topics such as Distributed Systems, Golang, NoSQL Databases and Open Source values; Robin is as much hacker as he is hustler.","Links":[{"Icon":"twitter","Url":"","Text":"rbin"}],"Sessions":[{"Id":"1039","Title":"The Value of Open Source","TimeSlotId":"16:10/17:10","TrackId":"6","Abstract":"Open Source is undoubtably valuable and has a strong intrinsic worth.  But where does this value exist?  Does the value lie in the software produced, or somewhere else?  How could Open Sourcing your software benefit your company?  In this talk we’ll explore the main benefits of Open Source, how it can benefit you and how it can lead to better software.","Speaker":"Robin Johnson","SpeakerId":"1073","Day":"Friday"}]},{"Id":"1064","Name":"Roland Guijt","Role":"Senior Developer - R.M.G. Holding B.V.","Bio":"Roland is a passionate developer, international speaker, Pluralsight author and trainer (MCT) for many years now. Disciplines are all of .Net, javascript + libraries and mobile app development.","Links":[{"Icon":"website","Url":"www.rmgsolutions.nl","Text":"www.rmgsolutions.nl"},{"Icon":"twitter","Url":"","Text":"@rolandguijt"}],"Sessions":[{"Id":"1024","Title":"Securing your apps with OAuth2 and OpenID Connect","TimeSlotId":"12:20/13:00","TrackId":"5","Abstract":"In the past you could come by with designing a login screen with a username and login textbox in your app and directly check the credentials in a database. But we&#039;re living in the age of (Web) APIs. With modern apps, like SPAs, just authenticating with the website isn&#039;t enough, you also want to connect on behalf of the logged in user in a Web API that is providing data for example.\r\nOpenId Connect and OAuth2 for authorisation together are the complete solution to this problem.\r\nIn this session after a furter explanation we&#039;ll look at a collection of .Net apps that demonstrate this process.","Speaker":"Roland Guijt","SpeakerId":"1064","Day":"Friday"}]},{"Id":"1054","Name":"Sara Vieira","Role":"Front-End Developer - Freelancer","Bio":"Sara is a freelance Front-End Developer from Portugal. She’s one of those few people in the world who love what they do and believe that the internet is something we are building and making better on a daily basis may that be through education websites or simply by creating useful one page applications. She is also a blogger on the weekend and has her work featured on Developer Drive and Webdesigner Depot. When she isn’t on the internet she’s a total TV Show addict and video game lover.","Links":[{"Icon":"website","Url":"http://iamsaravieira.com","Text":"http://iamsaravieira.com"},{"Icon":"linkedin","Url":"http://pt.linkedin.com/pub/sara-vieira/45/a4b/290/","Text":"http://pt.linkedin.com/pub/sara-vieira/45/a4b/290/"},{"Icon":"twitter","Url":"","Text":"@NikkitaFTW"}],"Sessions":[{"Id":"1116","Title":"CSS3 Layouts: Flexbox vs CSS Grid","TimeSlotId":"11:40/12:20","TrackId":"5","Abstract":"The way we create layouts is messy we have to admit it, those floats and inline-block&#039;s don&#039;t make anyone&#039;s life any easier and they aren&#039;t exactly tools for creating massive layouts, just properties we adapted for our layout needs because, well, they worked and we got used to them.\r\nWith CSS3 we got Flexbox and the CSS grid , two things created especially for the creation of layouts , in here I will talk about each one, the pros , the cons and why you should be looking forward to using these in production. All of this so you can go home with even more hope for the future of CSS.","Speaker":"Sara Vieira","SpeakerId":"1054","Day":"Saturday"}]},{"Id":"299","Name":"Simone Bordet","Role":"Lead Architct - Webtide","Bio":"Simone Bordet is a Jetty Committer, the CometD project leader and works as Lead Architect at Webtide, now part of Intalio. Active open source developer, he founded and contributed to various open source projects such as Jetty, CometD, MX4J, Foxtrot, LiveTribe, and others. Simone has been technical speaker at various national and international conferences such as Devoxx, JavaOne, CodeMotion, etc., and is a co-lead of the Java User Group of Torino, Italy. Simone specializes in server-side multi-thread development, J2EE application development, in Comet technologies applied to web development, web network protocols and in high performance JVM tuning.","Links":[{"Icon":"twitter","Url":"","Text":"@simonebordet"}],"Sessions":[{"Id":"1137","Title":"OOP and FP: become a better programmer","TimeSlotId":"09:00/10:00","TrackId":"7","Abstract":"Hear the story of Simon, an experienced OOP Java developer, exposed to the new lambda features of JDK 8.\r\nHis friend Mario, a long-bearded FP geek, will try to convince him that FP can help him develop more readable and maintainable code.\r\nA journey into the discovery of the main new feature - lambda expressions - of JDK 8.","Speaker":"Simone Bordet","SpeakerId":"299","Day":"Saturday"}]},{"Id":"156","Name":"Simone Onofri","Role":"Project Manager / Senior IT Security Consultant - Techub S.p.A.","Bio":"I am a Project Manager / Senior IT Security Consultant with 10 years of experience in IT field. I like to be Agile: DSDM® Consortium Community Member, Agile Project Management™ Practitioner and Certified ScrumMaster® (with Craig Larman). I carried out several projects in Ethical Hacking, Security Operation Center and Secure Software Development Life-Cycle areas.","Links":[{"Icon":"website","Url":"http://onofri.org/b","Text":"http://onofri.org/b"},{"Icon":"linkedin","Url":"http://www.linkedin.com/in/simoneonofri","Text":"http://www.linkedin.com/in/simoneonofri"},{"Icon":"twitter","Url":"","Text":"@simoneonofri"}],"Sessions":[{"Id":"1040","Title":"Agile Project Management: Integrare metodologie di progetto tradizionali con Agile","TimeSlotId":"17:20/18:00","TrackId":"6","Abstract":"Negli ultimi anni, anche secondo l&#039;approccio Lean Startup, il modo migliore per rilasciare prodotti - non solo software - è tramite framework Agili. Quando si è agili all&#039;interno di un organizzazione più tradizionale, questo approccio spesso si scontra con le prassi di gestione progetti più tradizionali. Nonostante lo scontro - principalmente filosofico - è in realtà possibile integrare metodologie di progetto tradizionali con quelle agili.\r\nDurante il talk, dopo una breve introduzione, saranno presentati dei modelli di ciclo di vita Agile e Tradizionale e la struttura consigliata dei team.","Speaker":"Simone Onofri","SpeakerId":"156","Day":"Friday"}]},{"Id":"1165","Name":"Stefano Sanna","Role":"Manager - Open Reply","Bio":"Stefano wrote his first mobile app in 1999 (on a PSION 5MX!). He worked for 7 years at CRS4 in the Network Distributed Applications research group. He then joined beeweeb SpA in 2006 as Mobile Application Architect, working on Mobile TV client for leading European network operators. He is currently Manager at Open Reply (Reply Group), focused 100% on mobile and wearable applications. He wrote \"Java Micro Edition\" for Hoepli and \"Android - Programmazione Avanzata\" for FAG. Far from the keyboard, Stefano loves playing LEGO Technic with his sons and enjoying cakes lovely cooked by his wife.","Links":[{"Icon":"website","Url":"http://www.gerdavax.it","Text":"http://www.gerdavax.it"},{"Icon":"linkedin","Url":"http://it.linkedin.com/in/gerdavax","Text":"http://it.linkedin.com/in/gerdavax"},{"Icon":"twitter","Url":"","Text":"@gerdavax"}],"Sessions":[{"Id":"1002","Title":"Introduzione alla tecnologia iBeacon","TimeSlotId":"14:00/14:40","TrackId":"3","Abstract":"Presentata in maniera piuttosto discreta tra le novità di iOS 7 nel 2013, le tecnologia iBeacon consente la localizzazione a corto raggio (prevalentemente indoor) e la realizzazione di servizi sensibili alla prossimità. L’intuizione di Apple sfrutta una delle caratteristiche fondamentali di Bluetooth Low Energy e questo rende gli iBeacon pressoché universali. In pochissimo tempo, sono comparsi sul mercato numerosi prodotti hardware che implementano la specifica (ufficiale e reverse engineered) e diverse API e librerie per l’integrazione di funzionalità di prossimità all’interno di mobile app.","Speaker":"Stefano Sanna","SpeakerId":"1165","Day":"Friday"}]},{"Id":"943","Name":"Svetlana Isakova","Role":"Developer - JetBrains","Bio":"Svetlana is working on Project Kotlin at JetBrains since 2011. From time to time she tries to encourage people with Kotlin at the conferences. Before joining Kotlin she had a passion for the Scala programming language. She loves concepts and ideas, and skiing in the Alps as well.","Links":[{"Icon":"website","Url":"http://kotlinlang.org/","Text":"http://kotlinlang.org/"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1054","Title":"Kotlin, the Swift of Android","TimeSlotId":"10:00/11:00","TrackId":"8","Abstract":"Apple has introduced “a better language” for iOS developers. But what options do we have for Android? Surely Kotlin should be under consideration! Android Studio is now based on Intellij Idea, the “native” environment for Kotlin.\r\nKotlin is a modern language for industry. It can help you reduce the amount of code you write for Android applications and at the same time make it readable and more maintainable. In this session we’re going to see how certain constructs and DSL’s can be used to make Android more enjoyable.","Speaker":"Svetlana Isakova","SpeakerId":"943","Day":"Friday"}]},{"Id":"1111","Name":"Valerio Del Bello","Role":"Consultant - K-Tech","Bio":"Always interested in improving software development methods and approaches, he gets excited with new technologies and technical solutions. He has been working for seven years as a consultant in (mostly) Java-oriented environments and spends it&#039;s free time exploring new methodologies or having fun experimenting the latest technology. He believes it&#039;s important to deeply understand the business needs to develop a great solution choosing the best architecture and technologies.","Links":[{"Icon":"linkedin","Url":"http://it.linkedin.com/in/valeriodelbello","Text":"http://it.linkedin.com/in/valeriodelbello"},{"Icon":"twitter","Url":"","Text":"@valeriodelbello"}],"Sessions":[{"Id":"1081","Title":"Domain Driven Design + Command Query Responsibility Segregation + Event Sourcing = l&rsquo;architettura del futuro","TimeSlotId":"12:30/13:10","TrackId":"2","Abstract":"Qual&#039;è lo stato dell&#039;arte delle architetture software? Costruiamo la soluzione con le ultime evoluzioni di Domain Driven Design, otteniamo ottime prestazioni con Command Query Responsibility Segregation e scaliamo alla grande con Event Sourcing, puntando ai microservice per ottenere un&#039;architettura robusta, affidabile, veloce, distribuita e scalabile.","Speaker":"Valerio Del Bello","SpeakerId":"1111","Day":"Saturday"}]},{"Id":"953","Name":"Werner Keil","Role":"Founder/Director - Creative Arts & Technologies","Bio":"Werner Keil is Agile Coach and IoT/Embedded/Real Time expert. Helping Global 500 Enterprises across industries and leading IT vendors. He worked for over 25 years as Program Manager, Coach, SW architect and consultant for Finance, Mobile, Media, Tansport and Public sector. Werner is Eclipse and Apache Committer and JCP member in JSRs like 333 (JCR), 342 (Java EE 7), 354 (Money), 358/364 (JCP.next), Java ME 8, 362 (Portlet 3), 363 (Units, also Spec Lead), 365 (CDI 2) and the Executive Committee.","Links":[{"Icon":"website","Url":"http://www.catmedia.us","Text":"http://www.catmedia.us"},{"Icon":"linkedin","Url":"https://www.linkedin.com/in/catmedia","Text":"https://www.linkedin.com/in/catmedia"},{"Icon":"twitter","Url":"","Text":"@wernerkeil"}],"Sessions":[{"Id":"1003","Title":"Improving Mobile UX with Apache DeviceMap","TimeSlotId":"14:50/15:50","TrackId":"3","Abstract":"We experience a growing number of mobile phones, tablets, phablets, smart TV and similar devices flooding the market almost every day. If you want to create a comfortable user experience you need dynamic content according to hardware and browser of your device. That’s the reason for Device Description Repositories (DDR).\r\n\r\nApache DeviceMap started in January 2012, after OpenDDR contributed data and APis. It graduated from Apache Incubator November 2014. Next steps include an improved data format, maintenance of device data by the community via common API based on REST/OAuth and XML or JSON.","Speaker":"Werner Keil","SpeakerId":"953","Day":"Friday"}]},{"Id":"948","Name":"Yan Cui","Role":"Senior Developer - Gamesys","Bio":"Yan works as a server side developer at Gamesys where he develops scalable backend services for Gamesys&#039;s social games on mobile and Facebook. He&#039;s a co-author of \"F# Deep Dives\" by Manning. He&#039;s a regular speaker on topics such as Aspect-Oriented Programming, F# and NoSQL, and he keeps an active blog at http://theburningmonk.com/","Links":[{"Icon":"website","Url":"http://theburningmonk.com","Text":"http://theburningmonk.com"},{"Icon":"linkedin","Url":"http://uk.linkedin.com/in/theburningmonk/","Text":"http://uk.linkedin.com/in/theburningmonk/"},{"Icon":"twitter","Url":"","Text":"@theburningmonk"}],"Sessions":[{"Id":"1062","Title":"My adventure with Elm","TimeSlotId":"17:20/18:00","TrackId":"8","Abstract":"Reactive Extensions (Rx) has brought reactive programming to the mainstream in recent years with successful adoption in languages such as C#, Java and JavaScript. But have you ever wondered what Rx will look like as a language?\r\n\r\nElm is a new programming language based on the idea of Functional Reactive Programming (FRP). Elm lets you create highly interactive web applications without all the messy callbacks tangling around shared states.\r\n\r\nIn this talk Yan Cui will give a gentle introduction to Elm and FRP and finish off with a live demo building a web-based game from scratch.","Speaker":"Yan Cui","SpeakerId":"948","Day":"Friday"}]},{"Id":"595","Name":"Yauheni Kaziak","Role":"CEO - Stone Labs","Bio":"Yauheni Kaziak is a founder of the Stone Labs, Mobile and Web Development Studio with offices in US, Lithuania, Belarus and Hong Kong. The company is engaged in custom software development and outsourcing. Prior to this he has over 7 years of Project Management and Business Analyst experience in Mobile Development field. Has presented Belarus at the \"Regional Mobile Application Contest 2013\" sponsored by Nokia (Yerevan, Armenia) where his team has won 2d place among other Countries. Keynote speaker in numerous IT Events and Conferences in Russia, Belarus, Ukraine and Lithuania.","Links":[{"Icon":"website","Url":"http://stone-labs.com/","Text":"http://stone-labs.com/"},{"Icon":"twitter","Url":"","Text":""}],"Sessions":[{"Id":"1005","Title":"Tips and Tricks for Mobile Apps Prototyping","TimeSlotId":"17:20/18:00","TrackId":"3","Abstract":"Probably every company has faced the following problem - you are starting new Mobile app with really outstanding idea. All tech processes are adjusted and the project is being developed by experienced developers, designers and QA engineers. Seems that everything should be fine, but when the app was uploaded to the App Store the users receive it coldly. &quot;It&#039;s so inconvenient, the app&#039;s logic is unclear at all!&quot; - they say. Whose fault is it? Let&#039;s try to figure out.","Speaker":"Yauheni Kaziak","SpeakerId":"595","Day":"Friday"}]}]